----------------------------------------------------------------------
       log:  d:\pglocal\data\data_NFSPanelAnalysis\OutData\dychap\Beef
> Analysis.log
  log type:  text
 opened on:  18 Jul 2011, 17:16:42

. 
. *****************************************************
. *****************************************************
. * RERC Beef Analysis Tables
. *****************************************************
. *****************************************************
. 
. *Table 1
. 
. tab cpagecat [iweight=wt] if ncattle > 0 & fsizesu >= 2 & droporig =
> = 0 & cpagecat > 0 & year == 1996

   cpagecat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 | 14,629.884       12.17       12.17
          2 | 45,736.016       38.06       50.23
          3 |14,074.9802       11.71       61.94
          4 | 4,757.0689        3.96       65.90
          5 | 4,353.9951        3.62       69.52
          6 | 8,215.7925        6.84       76.36
          7 |  7,401.341        6.16       82.51
          8 |  1,853.112        1.54       84.06
          9 | 19,161.653       15.94      100.00
------------+-----------------------------------
      Total | 120,183.84      100.00

. tab cpagecat [iweight=wt] if ncattle > 0 & fsizesu >= 2 & droporig =
> = 0 & cpagecat > 0 & year == 2008 

   cpagecat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |16,301.4902       17.31       17.31
          2 | 22,578.735       23.98       41.29
          3 |  15,735.27       16.71       58.00
          4 | 7,792.4868        8.28       66.28
          5 | 11,554.598       12.27       78.55
          6 |7,361.63879        7.82       86.37
          7 | 4,223.7237        4.49       90.86
          8 | 1,188.7649        1.26       92.12
          9 |7,420.99579        7.88      100.00
------------+-----------------------------------
      Total |94,157.7025      100.00

. tabstat dpavnohd  cptotcno-cpavno2p cpavnobl  if ncattle > 0 & year 
> == 2008 & fsizesu >= 2 & droporig == 0 [weight = wt], by(system) sta
> ts(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: system 

  system |  dpavnohd  cptotcno  cpavnocw  cpavnohc  cpavno06  cpavno61
---------+------------------------------------------------------------
       0 |  53.35398  116.9884  1.373935  7.552455  17.51604  17.08269
       1 |  18.76843  90.57505  8.235587  2.917791  13.28398  16.09324
       2 |         0  46.38023  19.56856  1.412867  9.973516  7.652907
       3 |  .0043144  53.34711  7.940579  .7634203  5.424309  8.445005
       4 |         0  33.77897  11.42067  .7744658  6.026999  5.432985
       5 |  .0950564  57.07491  10.38708  .8196283  5.339106  8.812168
---------+------------------------------------------------------------
   Total |  10.50071  63.67287   9.75727  2.218922    9.1117  10.04816
----------------------------------------------------------------------

  system |  cpavno12  cpavno2p  cpavnobl
---------+------------------------------
       0 |  17.14691  2.073277  .2024966
       1 |  25.48812  5.131082  .3887716
       2 |  6.054991  1.028752   .697399
       3 |  21.67966  8.787772  .3042137
       4 |   7.48572  2.238838   .405416
       5 |  20.50519  10.75479  .3676562
---------+------------------------------
   Total |  16.40257  5.110361  .3894882
----------------------------------------

. 
. 
. *Table 2
. 
. tab cpagecat system [iweight=wt] if ncattle > 0 & fsizesu >= 2 & dro
> porig == 0 & year == 2008 & cpagecat > 0

           |                   system
  cpagecat |         0          1          2          3 |     Total
-----------+--------------------------------------------+----------
         1 | 2,146.106  390.97118  8,811.375  1,157.741 | 16,301.49 
         2 |  4,028.07  2,024.843  6,421.078  6,793.038 | 22,578.73 
         3 | 2,527.378  2,264.746  2,404.762   6,956.28 | 15,735.27 
         4 | 110.55339  1,051.971  97.609196  5,190.365 | 7,792.487 
         5 | 69.536583 1,166.5688  275.06976  8,590.623 |  11,554.6 
         6 |         0  81.523811  42.666668   6,464.83 | 7,361.639 
         7 |4,126.7263  96.997368          0          0 | 4,223.724 
         8 | 164.06723  142.97118  491.52809  64.694443 |1,188.7649 
         9 | 2,666.563  510.88421 1,199.9105  2,084.033 | 7,420.996 
-----------+--------------------------------------------+----------
     Total |    15,839  7,731.476     19,744 37,301.604 |  94,157.7 


           |        system
  cpagecat |         4          5 |     Total
-----------+----------------------+----------
         1 |  3,687.71  107.58695 | 16,301.49 
         2 | 3,096.532   215.1739 | 22,578.73 
         3 | 775.83155  806.27292 | 15,735.27 
         4 | 657.88771      684.1 | 7,792.487 
         5 |927.466507  525.33332 |  11,554.6 
         6 | 153.35294  619.26568 | 7,361.639 
         7 |         0          0 | 4,223.724 
         8 | 248.59091   76.91304 |1,188.7649 
         9 | 523.08148  436.52415 | 7,420.996 
-----------+----------------------+----------
     Total | 10,070.45   3,471.17 |  94,157.7 


. 
. tab year cpagecat  [iweight=wt] if ncattle > 0 & fsizesu >= 2 & drop
> orig == 0 & cpagecat > 0

           |                  cpagecat
      year |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
      1994 |5,491.9825  34,979.88 8,148.4493  1,557.746 | 74,556.34 
      1995 | 6,707.905  31,794.32  7,870.217  2,459.523 | 78,576.38 
      1996 | 14,629.88  45,736.02  14,074.98  4,757.069 | 120,183.8 
      1997 | 14,193.46  44,834.56   14,062.7  6,609.358 | 119,199.7 
      1998 | 13,072.51  39,437.44  18,599.78  6,141.991 | 121,923.6 
      1999 | 13,726.92  37,922.49 18,065.672  6,050.746 | 115,461.1 
      2000 | 16,675.15  37,153.16   15,533.8  5,460.335 | 114,505.5 
      2001 | 16,756.59 31,302.542  19,317.76  3,728.135 | 112,201.9 
      2002 | 17,007.28  30,093.55  17,616.52   5,026.49 | 107,749.2 
      2003 | 18,038.88  26,678.17  18,067.47  4,388.025 | 106,542.8 
      2004 | 19,686.04  23,664.73  20,083.56  5,165.392 | 105,134.9 
      2005 | 18,298.76   23,647.8  20,392.78  6,940.479 | 101,650.2 
      2006 | 17,796.04  26,981.41  18,499.08  6,676.491 | 103,032.2 
      2007 | 18,703.76  27,106.36 19,073.975  6,495.209 | 99,649.82 
      2008 | 16,301.49  22,578.73  15,735.27  7,792.487 |  94,157.7 
      2009 | 15,380.01   22,378.6  15,090.09  7,454.783 | 92,257.31 
-----------+--------------------------------------------+----------
     Total | 242,466.7  506,289.8  260,232.1  86,704.26 | 1666782.4 


           |                  cpagecat
      year |         5          6          7          8 |     Total
-----------+--------------------------------------------+----------
      1994 | 1,452.377  5,160.163  4,181.041   436.7665 | 74,556.34 
      1995 | 1,409.895  4,805.851  6,165.578  1,060.644 | 78,576.38 
      1996 | 4,353.995  8,215.793  7,401.341  1,853.112 | 120,183.8 
      1997 | 4,614.685  7,456.771  5,419.373  1,664.095 | 119,199.7 
      1998 | 4,608.546  6,447.721  6,040.432 1,378.2453 | 121,923.6 
      1999 | 5,460.591  6,259.814  5,463.823   1,281.62 | 115,461.1 
      2000 |4,656.7386  7,933.361  3,878.566  2,273.055 | 114,505.5 
      2001 |  7,075.94  6,850.945  3,680.027  1,438.926 | 112,201.9 
      2002 | 5,459.758  8,855.663  3,551.962  1,122.662 | 107,749.2 
      2003 | 5,981.353  7,306.298  4,434.337   1,468.47 | 106,542.8 
      2004 | 5,960.666  8,548.365  4,688.843  1,423.049 | 105,134.9 
      2005 | 7,960.844  7,593.299  5,177.244  1,600.991 | 101,650.2 
      2006 | 8,949.171  6,472.457  5,233.788  1,963.459 | 103,032.2 
      2007 |  9,074.09  6,141.562  4,483.456 1,026.9043 | 99,649.82 
      2008 |  11,554.6  7,361.639  4,223.724 1,188.7649 |  94,157.7 
      2009 | 11,818.73  7,535.124  5,231.763  670.54216 | 92,257.31 
-----------+--------------------------------------------+----------
     Total |   100,392  112,944.8   79,255.3  21,851.31 | 1666782.4 


           |  cpagecat
      year |         9 |     Total
-----------+-----------+----------
      1994 | 13,147.93 | 74,556.34 
      1995 | 16,302.45 | 78,576.38 
      1996 | 19,161.65 | 120,183.8 
      1997 |  20,344.7 | 119,199.7 
      1998 | 26,196.92 | 121,923.6 
      1999 | 21,229.38 | 115,461.1 
      2000 | 20,941.33 | 114,505.5 
      2001 |    22,051 | 112,201.9 
      2002 | 19,015.31 | 107,749.2 
      2003 |20,179.754 | 106,542.8 
      2004 | 15,914.26 | 105,134.9 
      2005 | 10,037.97 | 101,650.2 
      2006 | 10,460.35 | 103,032.2 
      2007 |7,544.5113 | 99,649.82 
      2008 | 7,420.996 |  94,157.7 
      2009 |  6,697.68 | 92,257.31 
-----------+-----------+----------
     Total | 256,646.2 | 1666782.4 


. 
. tabstat dpavnohd  cptotcno-cpavno2p cpavnobl  if ncattle > 0 & year 
> == 2008 & fsizesu >= 2 & droporig == 0 & cpagecat > 0 [weight = wt],
>  by(cpagecat) stats(sum)
(analytic weights assumed)

Summary statistics: sum
  by categories of: cpagecat 

cpagecat |  dpavnohd  cptotcno  cpavnocw  cpavnohc  cpavno06  cpavno61
---------+------------------------------------------------------------
       1 |  88001.22  669270.9    224483  25388.06    152542  98953.47
       2 |  217737.1   1465589  316293.3  47301.01  256367.9  260355.3
       3 |  220235.9   1547096  246826.7  47968.38  233873.6  270258.8
       4 |  11460.82  207704.1  11281.52  4828.809  12742.62  38443.42
       5 |  3110.371  560263.4  18027.04   2279.37  13579.42   88406.1
       6 |  203.8095  306942.4  6211.892  1673.742  3194.589  9367.775
       7 |  246382.7  440176.7  3880.982  38608.71   54884.5  46797.23
       8 |  19083.26  90587.94  19355.82  5139.577  16288.06  11665.66
       9 |  184457.8  704140.4  74173.86  36153.04  113309.3  117759.8
---------+------------------------------------------------------------
   Total |  990673.1   5991771  920534.1  209340.7    856782  942007.6
----------------------------------------------------------------------

cpagecat |  cpavno12  cpavno2p  cpavnobl
---------+------------------------------
       1 |   61635.8  8606.734  8619.139
       2 |  303161.5  50051.27  11828.53
       3 |  409328.1  106080.8    9882.4
       4 |  100392.2  27544.79   771.459
       5 |  304570.5  129776.4  460.5808
       6 |  155928.6    130106  255.5274
       7 |  41545.76  4217.757   784.037
       8 |  16516.38  1795.458  480.3126
       9 |  147867.8  23949.63  3663.653
---------+------------------------------
   Total |   1540947  482128.8  36745.64
----------------------------------------

. tabstat dpavnohd  cptotcno-cpavno2p cpavnobl  if (system >= 2 & syst
> em <=3) & ncattle > 0 & year == 2008 & fsizesu >= 2 & droporig == 0 
> & cpagecat > 0 [weight = wt], by(cpagecat) stats(sum)
(analytic weights assumed)

Summary statistics: sum
  by categories of: cpagecat 

cpagecat |  dpavnohd  cptotcno  cpavnocw  cpavnohc  cpavno06  cpavno61
---------+------------------------------------------------------------
       1 |         0  398089.7  169841.6  13011.92  100468.6  64775.47
       2 |         0  729020.4  237829.1  17421.27  132674.4  132558.5
       3 |         0  683908.1  182032.7  15468.67  103648.6  113281.1
       4 |         0  141143.2  5001.035  900.4352  3752.421  28122.82
       5 |         0    441308  14995.17  2016.801  10973.47  67430.88
       6 |         0  264432.9  5532.025  1062.313  1769.087  7322.979
       8 |         0   33411.3   12779.9  869.6711  6306.316  4923.181
       9 |  161.7361  208912.6  56020.97  5763.153   37820.2  43294.15
---------+------------------------------------------------------------
   Total |  161.7361   2900226  684032.5  56514.23    397413  461709.2
----------------------------------------------------------------------

cpagecat |  cpavno12  cpavno2p  cpavnobl
---------+------------------------------
       1 |  37276.06  6402.232  6399.549
       2 |  166146.8  34102.98  8387.334
       3 |  196850.6  65860.35  6834.737
       4 |  80585.01  22606.25  175.1085
       5 |  241962.5    103600  330.5349
       6 |  141495.2  106994.8  255.5274
       8 |  7553.934  673.5371   282.562
       9 |  53864.12  9501.437  2508.247
---------+------------------------------
   Total |  925734.3  349741.6   25173.6
----------------------------------------

. tabstat  region1-region8 gmperha fsizuaa fulltime isofffarmy teagasc
>  age_holder is65 dpcfb*  if ncattle > 0 & year == 2008 & fsizesu >= 
> 2 & droporig == 0 & cpagecat > 0 [weight = wt], by(cpagecat) stats(m
> ean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: cpagecat 

cpagecat |   region1   region2   region3   region4   region5   region6
---------+------------------------------------------------------------
       1 |  .1543948         0  .0707857  .1040336  .0752609  .0939325
       2 |  .2034445  .0055131  .1213043  .0737374  .1142026  .0706941
       3 |  .1413893  .0135387  .1129715   .104761  .0501203  .2141285
       4 |   .064565         0  .1082894  .1213206  .1214862  .0981436
       5 |  .1799525   .011903   .092305   .146446  .0560874  .0949861
       6 |   .108221  .0052239  .0634072  .2152898  .0320335  .0519347
       7 |  .2657518         0  .1435812  .0463123         0  .0832414
       8 |   .209117         0  .0516901  .1579327  .0668537         0
       9 |  .3089515    .00373  .0411284  .1177273  .1740549  .0615777
---------+------------------------------------------------------------
   Total |  .1739427  .0057477  .0958045  .1113945  .0827948  .1014254
----------------------------------------------------------------------

cpagecat |   region7   region8   gmperha   fsizuaa  fulltime  isofff~y
---------+------------------------------------------------------------
       1 |  .2206701  .2809223   173.531  29.65631  .2368222  .5289748
       2 |  .1828158  .2282883  180.6174  35.30719   .422001  .3476371
       3 |  .2215022  .1415885  297.7652  51.07788  .5414623  .3419765
       4 |  .2481503  .2380449   188.687  20.04778  .0704095  .5269828
       5 |   .174724   .243596  203.9052   34.3266   .185537  .4384048
       6 |  .2437606  .2801293  259.7682  33.96552  .1314869  .3547322
       7 |  .4409753   .020138  234.4364  44.08369  .9633987  .1125638
       8 |  .4233632  .0910434  205.1439  37.51462  .3816769   .323129
       9 |  .2753948  .0174355  264.8682  47.79854  .6002204  .3334178
---------+------------------------------------------------------------
   Total |  .2269277  .2019627  218.0458  36.88236  .3668991   .392647
----------------------------------------------------------------------

cpagecat |   teagasc  age_ho~r      is65  dpcfbjan  dpcfbfeb  dpcfbmar
---------+------------------------------------------------------------
       1 |  .4193608  52.79886  .1901002  1.452892  3.425059  5.201822
       2 |  .4951341  56.37788  .2538816  1.497595  4.527829  5.950913
       3 |  .5496775  53.87538  .2080518  2.088848  6.680315  7.934059
       4 |  .2739152  59.71941  .3222354  .2943934  .5790747  1.115976
       5 |  .5091148  57.46489  .2815938  .0948109  .3735112  .3048108
       6 |  .3756784  63.97625  .4969841         0  .1099436  .2870595
       7 |  .7149873  51.58941  .0907095  5.238171  15.34699  14.42035
       8 |  .8519544  59.71859  .2956643  2.913691  5.680611  6.900489
       9 |  .6357425  54.32841  .1773161  2.909084  8.638316  9.197169
---------+------------------------------------------------------------
   Total |  .4906477   56.0099  .2504182  1.496774  4.338462  5.264575
----------------------------------------------------------------------

cpagecat |  dpcfbapr  dpcfbmay  dpcfbjun  dpcfbjul  dpcfbaug  dpcfbsep
---------+------------------------------------------------------------
       1 |  3.670052  1.663779  .7824676   .283769  .5534445  .3941882
       2 |  4.294908   2.36878  1.078438  .5193772  .4618059   .494579
       3 |  4.750239  2.475695  .9844079  .4681202  .6741579  .5638469
       4 |   .539425  .1574006  .0743826         0  .0088714  .1406752
       5 |  .3989463  .1616653  .0452685  .0957404  .0029386  .0357091
       6 |  .1366365  .0806724  .0406105  .1003921         0  .0214545
       7 |  8.723345  3.613045  1.012473  .3176384  1.137495  2.003041
       8 |  4.734489  2.106638   1.98388  .6448906  .4357972   1.46121
       9 |  5.134867  2.073841  .7031434  .5158163  .5432123  1.014293
---------+------------------------------------------------------------
   Total |  3.419213  1.661096  .6993536  .3345466  .4196556  .4870154
----------------------------------------------------------------------

cpagecat |  dpcfboct  dpcfbnov  dpcfbdec  dpcfbtot
---------+----------------------------------------
       1 |  .4166199  .6009797  .5128332  18.95791
       2 |   .798839  .5132024  .3847905  22.89106
       3 |  .8847104  .6988159  .4932566  28.69647
       4 |  .0328522  .0566296  .0070507  3.006731
       5 |  .1207686  .0262643   .011198  1.671632
       6 |   .034353         0  .0637539   .874876
       7 |  1.865945  1.492442  .9274597   56.0984
       8 |  .8448827  .8965728  .2413951  28.84455
       9 |  1.044342  .8466042  .5858491  33.20654
---------+----------------------------------------
   Total |  .6084414   .496797  .3612566  19.58719
--------------------------------------------------

. 
. * Technical
. * Mainly Summer Production    1
. * Mainly Winter               2
. * Both Summer and w           3
. 
. 
. tab year cpseaprd [iweight=wt] if ncattle > 0 & fsizesu >= 2 & dropo
> rig == 0 & cpagecat > 0

           |             cpseaprd
      year |         1          2          3 |     Total
-----------+---------------------------------+----------
      1994 | 5,223.048  628.88256  68,704.41 | 74,556.34 
      1995 |  3,853.46  943.57323  73,779.35 | 78,576.38 
      1996 | 9,889.871  2,625.436  107,668.5 | 120,183.8 
      1997 | 11,703.64  1,522.059    105,974 | 119,199.7 
      1998 | 9,669.517  576.18975  111,677.9 | 121,923.6 
      1999 |13,074.846  1,470.656  100,915.6 | 115,461.1 
      2000 | 14,496.82  1,733.406  98,275.27 | 114,505.5 
      2001 | 13,637.85  1,931.596  96,632.42 | 112,201.9 
      2002 |  14,456.7  1,514.205  91,778.29 | 107,749.2 
      2003 |13,054.865  1,799.165  91,688.73 | 106,542.8 
      2004 | 15,663.41  2,850.577  86,620.92 | 105,134.9 
      2005 | 17,208.23  3,611.709  80,830.22 | 101,650.2 
      2006 | 20,314.35  2,025.767  80,692.13 | 103,032.2 
      2007 | 16,963.22  904.59392 81,782.008 | 99,649.82 
      2008 | 17,280.32 885.487915  75,991.89 |  94,157.7 
      2009 | 16,528.34  1,165.637  74,563.33 | 92,257.31 
-----------+---------------------------------+----------
     Total | 213,018.5  26,188.94  1427574.9 | 1666782.4 


. tab cpagecat cpseaprd [iweight=wt] if ncattle > 0 & fsizesu >= 2 & d
> roporig == 0 & cpagecat > 0 & year == 2008

           |             cpseaprd
  cpagecat |         1          2          3 |     Total
-----------+---------------------------------+----------
         1 |  7,500.98          0 8,800.5098 | 16,301.49 
         2 | 2,704.474  105.08658  19,769.17 | 22,578.73 
         3 | 450.56617  119.63697  15,165.07 | 15,735.27 
         4 | 2,403.968   38.45652 5,350.0622 | 7,792.487 
         5 |2,052.4166  52.111111   9,450.07 |  11,554.6 
         6 |1,264.6283  531.74021   5,565.27 | 7,361.639 
         7 | 154.59373          0   4,069.13 | 4,223.724 
         8 |356.820076   38.45652   793.4883 |1,188.7649 
         9 | 391.87532          0   7,029.12 | 7,420.996 
-----------+---------------------------------+----------
     Total | 17,280.32 885.487915  75,991.89 |  94,157.7 


. tab cpseaprd region [iweight=wt] if ncattle > 0 & fsizesu >= 2 & dro
> porig == 0 & cpagecat > 0 & year == 2008

           |                   region
  cpseaprd |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         1 | 2,686.919          0  1,517.662  1,408.593 | 17,280.32 
         2 |         0          0  52.111111  106.43038 |885.487915 
         3 | 13,691.13  541.18598  7,450.955  8,973.627 | 75,991.89 
-----------+--------------------------------------------+----------
     Total | 16,378.05  541.18598  9,020.728  10,488.65 |  94,157.7 


           |                   region
  cpseaprd |         5          6          7          8 |     Total
-----------+--------------------------------------------+----------
         1 | 1,086.538 615.546669  2,855.843  7,109.221 | 17,280.32 
         2 | 69.536583   38.45652  618.95332          0 |885.487915 
         3 | 6,639.696  8,895.979  17,892.19 11,907.127 | 75,991.89 
-----------+--------------------------------------------+----------
     Total | 7,795.771  9,549.982  21,366.99  19,016.35 |  94,157.7 


. tabstat  dpcfb*  if ncattle > 0 & year == 2008 & fsizesu >= 2 & drop
> orig == 0 & cpagecat > 0 [weight = wt], by(cpseaprd) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: cpseaprd 

cpseaprd |  dpcfbjan  dpcfbfeb  dpcfbmar  dpcfbapr  dpcfbmay  dpcfbjun
---------+------------------------------------------------------------
       1 |  .6719004  1.642879  3.114112  2.421468  1.356831  .6606264
       2 |  .4327929   3.89791   3.69116  2.135606  .5274569  .6022104
       3 |  1.696746  4.956563  5.771918  3.661054  1.743495   .709292
---------+------------------------------------------------------------
   Total |  1.496774  4.338462  5.264575  3.419213  1.661096  .6993536
----------------------------------------------------------------------

cpseaprd |  dpcfbjul  dpcfbaug  dpcfbsep  dpcfboct  dpcfbnov  dpcfbdec
---------+------------------------------------------------------------
       1 |  .1714398  .1968455  .1523201  .1436452  .1690766  .2278984
       2 |  .1605894  .0802947         0         0  .9635366  .3211789
       3 |  .3736636  .4742763   .568799  .7212245  .5658809  .3920489
---------+------------------------------------------------------------
   Total |  .3345466  .4196556  .4870154  .6084414   .496797  .3612566
----------------------------------------------------------------------

cpseaprd |  dpcfbtot
---------+----------
       1 |  10.92904
       2 |  12.81273
       3 |  21.63496
---------+----------
   Total |  19.58719
--------------------

. 
. 
. *Output
. 
. gen co_netdy = cotftdvl - cotffdvl
(52 missing values generated)

. local co_out_vlist = "cosalesv copurval cosubsid covalcno co_netdy"

. foreach var in  `co_out_vlist' {
  2.         gen `var'_oha = `var'/cpforacs
  3.         gen `var'_olu = `var'/fnocatlu
  4. }
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)

. 
. tabstat  co*_oha  if ncattle > 0 & year == 2008 & fsizesu >= 2 & dro
> porig == 0 & cpagecat > 0 [weight = wt], by(cpagecat) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: cpagecat 

cpagecat |  cosale~a  copurv~a  cosubs~a  covalc~a  co_net~a
---------+--------------------------------------------------
       1 |  643.4307  101.4389  27.48229  3.983292   63.6294
       2 |  710.8112  102.7722  16.67929  16.71901   47.1151
       3 |  951.2622  128.2451  13.27939  -19.5047  43.55827
       4 |  1684.304  1078.307  .5644968  10.78591  .9192603
       5 |  1461.762   856.993  1.195803  14.55356  2.238306
       6 |  1754.887  1080.088  .4600963 -56.09608 -1.310847
       7 |  761.0441   32.0294  .3041118   -1030.5  1770.961
       8 |  1105.295  307.1348  13.10465  -171.214  193.4159
       9 |  1081.391  279.2527  7.621707 -12.63287  142.1874
---------+--------------------------------------------------
   Total |  1030.119  369.8146  11.98607 -49.65143  122.9319
------------------------------------------------------------

. tabstat  co*_olu  if ncattle > 0 & year == 2008 & fsizesu >= 2 & dro
> porig == 0 & cpagecat > 0 [weight = wt], by(cpagecat) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: cpagecat 

cpagecat |  cosale~u  copurv~u  cosubs~u  covalc~u  co_net~u
---------+--------------------------------------------------
       1 |  505.7579  82.63079  21.73617  3.124489  34.39255
       2 |  488.2311  72.36526   11.8913  3.734714  27.27782
       3 |  588.8958   85.7197  8.299294 -7.897899  20.47211
       4 |  1256.351   876.582  .3580119  36.26323  .6180015
       5 |  1092.043  635.5256  .6693153 -9.612966  1.519574
       6 |  1415.487  935.0626  .3108741 -18.43724 -1.221067
       7 |  422.1692  17.48158  .1452647 -418.9901  754.8348
       8 |  889.4916  192.1909  6.742108 -281.3252  88.20008
       9 |  711.4969  198.3015  5.718893 -33.83282  70.66291
---------+--------------------------------------------------
   Total |  737.9507  288.4654  8.680059 -24.51673  56.60206
------------------------------------------------------------

. 
. tabstat  co*_oha  if ncattle > 0 & fsizesu >= 2 & droporig == 0 & cp
> agecat > 0 [weight = wt], by(year) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cosale~a  copurv~a  cosubs~a  covalc~a  co_net~a
---------+--------------------------------------------------
    1994 |  791.7696  244.0411  182.7562   59.6884  21.12855
    1995 |  788.7673  238.2775  213.6993  52.84445  47.16115
    1996 |  619.8893  202.3361  245.5821  51.48039  51.53738
    1997 |  626.5737  232.8952  220.4914  65.20498  53.67872
    1998 |  659.5387  160.6501  260.1113 -73.89056  62.69938
    1999 |  847.1894  255.9433  237.9785 -116.8012  62.95619
    2000 |  907.4911  272.0079  330.8545  -71.1412  42.39238
    2001 |  806.7172  288.3254  283.3954  72.64268  13.67917
    2002 |  894.6857  291.0111   327.102 -62.26947   28.5465
    2003 |  821.8798   287.598  336.8088 -26.70104  57.77281
    2004 |  911.9769  302.2579  308.9669 -21.70102  54.60797
    2005 |  868.5619  293.2014  248.9259 -.8342519  85.91975
    2006 |  936.1193  272.0784         0 -68.04235  73.54793
    2007 |  922.8341  453.0921         0  129.6251  72.42001
    2008 |  1030.119  369.8146  11.98607 -49.65143  122.9319
    2009 |  951.0521  304.0883         0  -27.4375  44.48887
---------+--------------------------------------------------
   Total |  830.3996  276.7473  207.1275 -7.871004  56.00449
------------------------------------------------------------

. tabstat  co*_olu  if ncattle > 0 & fsizesu >= 2 & droporig == 0 & cp
> agecat > 0 [weight = wt], by(year) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cosale~u  copurv~u  cosubs~u  covalc~u  co_net~u
---------+--------------------------------------------------
    1994 |   469.691  146.0297  117.1596   21.1256  9.414273
    1995 |  472.0347    148.13  135.9578  25.69529  22.78619
    1996 |  394.5026  130.7626  161.8483  9.668508  28.24612
    1997 |  395.6139  160.1083  143.8825  33.05068   31.0492
    1998 |  352.7621  106.4935  165.4612 -15.51078  32.58596
    1999 |  549.6584  166.2884   161.684 -99.08012  39.72223
    2000 |  596.0676  191.7924  231.8479 -51.04332  20.66063
    2001 |  514.8689   199.057  191.7938  42.08451  4.736933
    2002 |  591.5754  222.1357  232.5034 -20.99674   15.0606
    2003 |  533.5163  190.8763  239.4953 -18.72907   26.4507
    2004 |  625.1072  218.0589  225.7482 -33.62232  27.39904
    2005 |  587.4244  215.4192  176.2533 -4.212747  42.50905
    2006 |  673.9751  211.2409         0 -59.25818  34.78174
    2007 |  664.6545  287.8827         0  26.68917  33.97708
    2008 |  737.9507  288.4654  8.680059 -24.51673  56.60206
    2009 |  694.5901  246.8014         0 -31.16381  21.67739
---------+--------------------------------------------------
   Total |  548.6203   193.957  141.5696 -13.56415  28.18974
------------------------------------------------------------

. 
. 
. ** Gross Margin
. 
. * Correct for different definition pre 2000
. replace cdgrsmar = cogrosso - cdtotldc
(10423 real changes made)

. 
. gen cogm_nosub = cdgrsmar - cosubsid
(52 missing values generated)

. gen cogo_nosub = cogrosso - cosubsid
(52 missing values generated)

. gen co_stock = fnocatlu/cpforacs
(1214 missing values generated)

. 
. local co_gm_vlist = "cdgrsmar cogm_nosub cosubsid cogrosso cogo_nosu
> b cdtotldc"

. foreach var in  `co_gm_vlist' {
  2.         gen `var'_mha = `var'/cpforacs
  3.         gen `var'_mlu = `var'/fnocatlu
  4. }
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)

. tabstat  *_mha cpforacs fnocatlu co_stock if ncattle > 0 & year == 2
> 008 & fsizesu >= 2 & droporig == 0 & cpagecat > 0 [weight = wt], by(
> cpagecat) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: cpagecat 

cpagecat |  cdgrsm~a  cogm_n~a  cosu~mha  cogros~a  cogo_n~a  cdtotl~a
---------+------------------------------------------------------------
       1 |   173.531  146.0487  27.48229  637.0868  609.6045  463.5557
       2 |  180.6174  163.9381  16.67929  688.5525  671.8732  507.9351
       3 |  297.7652  284.4858  13.27939  860.3501  847.0707  562.5849
       4 |   188.687  188.1225  .5644968  618.2665   617.702  429.5795
       5 |  203.9052  202.7094  1.195803  622.7561  621.5603  418.8509
       6 |  259.7682  259.3081  .4600963   617.852  617.3919  358.0838
       7 |  234.4364  234.1323  .3041118   1469.78  1469.476  1235.343
       8 |  205.1439  192.0393  13.10465  833.4666  820.3619  628.3226
       9 |  264.8682  257.2465  7.621707   939.315  931.6933  674.4468
---------+------------------------------------------------------------
   Total |  218.0458  206.0597  11.98607  745.5712  733.5852  527.5254
----------------------------------------------------------------------

cpagecat |  cpforacs  fnocatlu  co_stock
---------+------------------------------
       1 |  18.77956  21.48957  1.288131
       2 |   23.2806  33.10287   1.48316
       3 |  32.75724  51.68621  1.590275
       4 |  13.38309   16.6935  1.371378
       5 |  25.86435   34.5734  1.317207
       6 |   25.5573  34.06163  1.240498
       7 |  10.60749  22.33173  2.038422
       8 |  22.96219  35.99696  1.510014
       9 |  26.24685  39.48628  1.657127
---------+------------------------------
   Total |  23.42226  33.15169  1.457665
----------------------------------------

. tabstat  *_mlu cpforacs fnocatlu co_stock if ncattle > 0 & year == 2
> 008 & fsizesu >= 2 & droporig == 0 & cpagecat > 0 [weight = wt], by(
> cpagecat) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: cpagecat 

cpagecat |  cdgrsm~u  cogm_n~u  cosu~mlu  cogros~u  cogo_n~u  cdtotl~u
---------+------------------------------------------------------------
       1 |  127.0659  105.3297  21.73617  482.3803  460.6441  355.3144
       2 |  121.1899  109.2986   11.8913  458.7696  446.8783  337.5798
       3 |  184.9981  176.6988  8.299294  524.0496  515.7503  339.0515
       4 |  108.2889  107.9309  .3580119  417.0086  416.6506  308.7197
       5 |  142.8635  142.1942  .6693153  449.0934  448.4241  306.2298
       6 |  190.3582  190.0473  .3108741  461.0765  460.7656  270.7183
       7 |  141.9111  141.7658  .1452647  740.6777  740.5324  598.7666
       8 |  120.4006  113.6585  6.742108  510.9177  504.1756  390.5171
       9 |  158.8553  153.1364  5.718893  555.7444  550.0255  396.8891
---------+------------------------------------------------------------
   Total |  143.7586  135.0785  8.680059  490.2507  481.5706  346.4921
----------------------------------------------------------------------

cpagecat |  cpforacs  fnocatlu  co_stock
---------+------------------------------
       1 |  18.77956  21.48957  1.288131
       2 |   23.2806  33.10287   1.48316
       3 |  32.75724  51.68621  1.590275
       4 |  13.38309   16.6935  1.371378
       5 |  25.86435   34.5734  1.317207
       6 |   25.5573  34.06163  1.240498
       7 |  10.60749  22.33173  2.038422
       8 |  22.96219  35.99696  1.510014
       9 |  26.24685  39.48628  1.657127
---------+------------------------------
   Total |  23.42226  33.15169  1.457665
----------------------------------------

. 
. tabstat  *_mha  cpforacs fnocatlu co_stock if ncattle > 0 & fsizesu 
> >= 2 & droporig == 0 & cpagecat > 0 [weight = wt], by(year) stats(me
> an)
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cdgrsm~a  cogm_n~a  cosu~mha  cogros~a  cogo_n~a  cdtotl~a
---------+------------------------------------------------------------
    1994 |  392.3975  209.6413  182.7562   798.612  615.8558  406.2145
    1995 |  415.4257  201.7264  213.6993    852.96  639.2608  437.5343
    1996 |  358.9342  113.3521  245.5821  755.2084  509.6263  396.2742
    1997 |  364.6445  144.1532  220.4914  719.1911  498.6998  354.5466
    1998 |  305.9718  45.86042  260.1113  763.5178  503.4064   457.546
    1999 |  386.5905   148.612  237.9785  775.3795  537.4011  388.7891
    2000 |  527.9778  197.1233  330.8545  937.5889  606.7344  409.6111
    2001 |   469.284  185.8887  283.3954  888.1091  604.7137  418.8251
    2002 |  394.1481  67.04611   327.102  897.0536  569.9516  502.9055
    2003 |  447.8441  111.0354  336.8088  902.1623  565.3535  454.3181
    2004 |  500.8035  191.8366  308.9669  951.5928  642.6259  450.7893
    2005 |  463.4464  214.5205  248.9259  909.3719   660.446  445.9255
    2006 |  206.4064  206.4064         0  669.5465  669.5465  463.1401
    2007 |  158.7382  158.7382         0  671.7872  671.7872   513.049
    2008 |  218.0458  206.0597  11.98607  745.5712  733.5852  527.5254
    2009 |  118.8528  118.8528         0  672.0702  672.0702  553.2174
---------+------------------------------------------------------------
   Total |  361.2694  154.1419  207.1275  807.6304  600.5029   446.361
----------------------------------------------------------------------

    year |  cpforacs  fnocatlu  co_stock
---------+------------------------------
    1994 |  18.82387   30.8059  1.701596
    1995 |  19.20522  31.11243   1.69546
    1996 |  18.59204  29.18137  1.639267
    1997 |  19.58772  31.03727  1.638645
    1998 |  20.03883  32.09264  1.757445
    1999 |  19.95647  31.64483  1.625611
    2000 |  20.30233  30.85557  1.562774
    2001 |  21.49722     32.26  1.568581
    2002 |   22.3234  32.43155  1.499017
    2003 |  21.50486  31.89124  1.553884
    2004 |   21.3699  31.30496  1.529214
    2005 |  22.43868  33.75784  1.532207
    2006 |  21.79212  31.43586  1.469204
    2007 |  22.02353  31.80219  1.480199
    2008 |  23.42226  33.15169  1.457665
    2009 |  23.72886  32.89209  1.422935
---------+------------------------------
   Total |   21.0133  31.70576  1.572125
----------------------------------------

. tabstat  *_mlu  cpforacs fnocatlu co_stock if ncattle > 0 & fsizesu 
> >= 2 & droporig == 0 & cpagecat > 0 [weight = wt], by(year) stats(me
> an)
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cdgrsm~u  cogm_n~u  cosu~mlu  cogros~u  cogo_n~u  cdtotl~u
---------+------------------------------------------------------------
    1994 |  235.9771  118.8175  117.1596  466.8695  349.7099  230.8924
    1995 |  253.8406  117.8828  135.9578  502.8812  366.9234  249.0406
    1996 |  231.7726  69.92429  161.8483  461.4474  299.5991  229.6748
    1997 |  226.1471  82.26463  143.8825  436.4614  292.5789  210.3143
    1998 |  200.4285  34.96737  165.4612  432.1025  266.6413  231.6739
    1999 |  251.0728  89.38876   161.684  485.6961   324.012  234.6233
    2000 |  352.7077  120.8597  231.8479  605.7404  373.8924  253.0327
    2001 |  301.1879  109.3941  191.7938  554.4273  362.6335  253.2394
    2002 |  298.7028  66.19942  232.5034   596.007  363.5036  297.3041
    2003 |  305.1266  65.63132  239.4953  589.8569  350.3616  284.7303
    2004 |  329.8425  104.0943  225.7482  626.5732   400.825  296.7308
    2005 |  303.0971  126.8438  176.2533  586.5547  410.3014  283.4577
    2006 |  131.1614  131.1614         0  438.2578  438.2578  307.0964
    2007 |  111.5201  111.5201         0   437.438   437.438   325.918
    2008 |  143.7586  135.0785  8.680059  490.2507  481.5706  346.4921
    2009 |  78.05756  78.05756         0  444.2398  444.2398  366.1823
---------+------------------------------------------------------------
   Total |  237.2861  95.71656  141.5696  510.3192  368.7496   273.033
----------------------------------------------------------------------

    year |  cpforacs  fnocatlu  co_stock
---------+------------------------------
    1994 |  18.82387   30.8059  1.701596
    1995 |  19.20522  31.11243   1.69546
    1996 |  18.59204  29.18137  1.639267
    1997 |  19.58772  31.03727  1.638645
    1998 |  20.03883  32.09264  1.757445
    1999 |  19.95647  31.64483  1.625611
    2000 |  20.30233  30.85557  1.562774
    2001 |  21.49722     32.26  1.568581
    2002 |   22.3234  32.43155  1.499017
    2003 |  21.50486  31.89124  1.553884
    2004 |   21.3699  31.30496  1.529214
    2005 |  22.43868  33.75784  1.532207
    2006 |  21.79212  31.43586  1.469204
    2007 |  22.02353  31.80219  1.480199
    2008 |  23.42226  33.15169  1.457665
    2009 |  23.72886  32.89209  1.422935
---------+------------------------------
   Total |   21.0133  31.70576  1.572125
----------------------------------------

. 
. 
. * Inputs
. gen co_othmiscdc = cdmiscdc - ivmallc - iaisfcat - itecattl - imiscc
> tl - flabccct
(52 missing values generated)

. 
. local co_inp_vlist = "cdconcen cdpastur cdwinfor cdmilsub ivmallc ia
> isfcat itecattl imiscctl flabccct co_othmiscdc cdtotldc"

. foreach var in  `co_inp_vlist' {
  2.         gen `var'_iha = `var'/cpforacs
  3.         gen `var'_ilu = `var'/fnocatlu
  4. }
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)
(1214 missing values generated)
(1212 missing values generated)

. 
. * table 7
. tabstat  *_iha  if ncattle > 0 & year == 2008 & fsizesu >= 2 & dropo
> rig == 0 & cpagecat > 0 [weight = wt], by(cpagecat) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: cpagecat 

cpagecat |  cdconc~a  cdpast~a  cdwinf~a  cdmils~a  ivmall~a  iaisfc~a
---------+------------------------------------------------------------
       1 |  123.0814  61.97088   147.476   47.4017  57.14651  7.159444
       2 |  159.8747  78.03559  156.5386  28.58757  61.28286  5.220887
       3 |  212.6388  91.22762  148.5904  25.76666  54.44093  4.602212
       4 |   114.693  75.09311  153.2017   2.32173  59.74675  .8241738
       5 |  168.7032  60.31557  133.7951  .1757348  34.16997  1.209083
       6 |  152.7319  53.51646  96.57335  .0635257  29.52649  .3628319
       7 |  250.4467   230.691  238.0632  352.3798  117.2262  13.25333
       8 |  203.2702  94.11218  188.0568  27.80816  75.10235  7.198382
       9 |  245.4437  87.06197  164.3064  62.71716  82.82476  3.495613
---------+------------------------------------------------------------
   Total |   170.463  80.88606   150.553  40.68771  57.86799  4.466422
----------------------------------------------------------------------

cpagecat |  itecat~a  imiscc~a  flabc~ha  co_oth~a  cdto~iha
---------+--------------------------------------------------
       1 |  2.394481  15.87241  1.053201         0  463.5557
       2 |  2.150193  15.32156   .923177         0  507.9351
       3 |  3.583228  21.16305  .5718796         0  562.5849
       4 |  8.858501  14.84046         0         0  429.5795
       5 |  7.438139  12.85829  .1857465         0  418.8509
       6 |  11.34233  12.65297  1.314004         0  358.0838
       7 |  2.617002  30.47716   .188966         0  1235.343
       8 |  14.14842  18.62616         0         0  628.3226
       9 |  3.773966  22.83281  1.990333         0  674.4468
---------+--------------------------------------------------
   Total |  4.655138  17.15596  .7901578         0  527.5254
------------------------------------------------------------

. tabstat  *_ilu  if ncattle > 0 & year == 2008 & fsizesu >= 2 & dropo
> rig == 0 & cpagecat > 0 [weight = wt], by(cpagecat) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: cpagecat 

cpagecat |  cdconc~u  cdpast~u  cdwinf~u  cdmils~u  ivmall~u  iaisfc~u
---------+------------------------------------------------------------
       1 |  90.44787   47.5677  121.6921  29.65328  45.49421  6.019329
       2 |  105.4032  51.72087  107.9491  16.04467  40.51227   4.06409
       3 |  123.1387  55.72576   95.4304  13.06615  33.72383  3.107319
       4 |  74.00233  67.49355  106.6712  .9464977  40.22342  .4807104
       5 |  117.1685  43.57377  102.0283  .1182714  26.17881  .7072803
       6 |  105.7757  46.10768   74.5629  .0591748  23.11916  .2390121
       7 |  125.5429  102.8396  123.7372   171.681  53.26066  4.917472
       8 |  127.6352  59.24943  117.9609  13.37134  47.58871  5.106765
       9 |  143.1992  52.63295  101.0219  32.42959  47.86223  2.555582
---------+------------------------------------------------------------
   Total |  108.8151  53.99784  105.0824  21.68836  38.33812  3.167708
----------------------------------------------------------------------

cpagecat |  itecat~u  imiscc~u  flabcc~u  co_oth~u  cdto~ilu
---------+--------------------------------------------------
       1 |  2.134761  11.42887  .8764145         0  355.3144
       2 |  1.460989  9.922275  .5022794         0  337.5798
       3 |  2.233168  12.25732  .3688225         0  339.0515
       4 |  5.966894  12.93501         0         0  308.7197
       5 |   5.81838  10.51315  .1233169         0  306.2298
       6 |  8.639764  11.41807   .796846         0  270.7183
       7 |  1.145536  15.56757  .0746933         0  598.7666
       8 |  9.262914  10.34184         0         0  390.5171
       9 |  2.207493  13.66521   1.31489         0  396.8891
---------+--------------------------------------------------
   Total |  3.318762  11.56566  .5182312         0  346.4921
------------------------------------------------------------

. 
. tabstat  *_iha  if ncattle > 0 & fsizesu >= 2 & droporig == 0 & cpag
> ecat > 0 [weight = wt], by(year) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cdconc~a  cdpast~a  cdwinf~a  cdmils~a  ivmall~a  iaisfc~a
---------+------------------------------------------------------------
    1994 |  103.9466  46.92344  87.75535  35.08189  31.46082  5.213673
    1995 |  110.6893  53.59078  92.31798  37.36895  33.45437  5.401061
    1996 |  86.35466   49.1181  95.97202  29.37929  37.50462  6.386371
    1997 |  71.07971  41.59144  85.76721    28.072  40.15629  6.231077
    1998 |  81.84783   43.1336   125.182  51.72963  45.77702   6.89415
    1999 |  112.8236  59.59196  114.2311  33.03354  39.23992    5.7562
    2000 |   110.529  59.37625   119.132  41.09055  40.58026  7.135111
    2001 |  125.6169  66.66083  107.6797  43.67847  42.87921  7.056081
    2002 |  123.0271  63.67534  171.9096  52.61734  58.16796  6.887368
    2003 |  139.9114  67.23138  123.9918  39.31711  51.40894  6.816566
    2004 |  134.9434  64.52104  131.4715  35.36179  51.17815  6.504519
    2005 |  132.9488  68.47605  132.7671  32.85481  52.93225  5.119545
    2006 |   142.119  69.81258  143.0049  30.75464  50.36531  4.557054
    2007 |  154.0464  69.48993  158.2332  46.65132  56.89029  5.208125
    2008 |   170.463  80.88606   150.553  40.68771  57.86799  4.466422
    2009 |  164.6348  73.70752  163.2456  70.59014  53.08288  5.252637
---------+------------------------------------------------------------
   Total |  121.2777  60.76735  125.0985  40.34043  46.52511  6.002141
----------------------------------------------------------------------

    year |  itecat~a  imiscc~a  flabc~ha  co_oth~a  cdto~iha
---------+--------------------------------------------------
    1994 |  4.764083  16.87224  .2368074  .0586118  406.2145
    1995 |   4.97478  19.92231  .2314583  .2122037  437.5343
    1996 |  4.211987  16.19189  .2939547  .4388131  396.2742
    1997 |  4.594771  14.59006  .5820855  .7241632  354.5466
    1998 |  4.531228  15.03072  .8923725  1.016302   457.546
    1999 |  5.643647  16.97247   .505963  .9906784  388.7891
    2000 |  5.927118  23.84058  .6777534  1.322362  409.6111
    2001 |  5.661702  17.08278  .7085433   1.80083  418.8251
    2002 |  5.892263   17.1997  1.449119  2.079728  502.9055
    2003 |  5.828599  16.16117  1.108987  2.542145  454.3181
    2004 |  6.664842  15.59664  2.647829  1.899704  450.7893
    2005 |  5.925566  13.91162  .9897654         0  445.9255
    2006 |  5.576815  16.28549  .6642779  1.02e-08  463.1401
    2007 |  4.277351  17.07403  1.178195         0   513.049
    2008 |  4.655138  17.15596  .7901578         0  527.5254
    2009 |  4.179616  18.13246  .3918298         0  553.2174
---------+--------------------------------------------------
   Total |  5.220572  16.94529  .8487631  .8681454   446.361
------------------------------------------------------------

. tabstat  *_ilu  if ncattle > 0 & fsizesu >= 2 & droporig == 0 & cpag
> ecat > 0 [weight = wt], by(year) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cdconc~u  cdpast~u  cdwinf~u  cdmils~u  ivmall~u  iaisfc~u
---------+------------------------------------------------------------
    1994 |  57.33824  26.26392  51.42837  19.97973  18.00352   3.50341
    1995 |  61.73058  30.52727  54.09211  20.57023  19.12771  3.471266
    1996 |  47.83725  27.98855  58.33396  15.88804  22.36766  4.307164
    1997 |  40.79455  24.08178  53.65776  14.57446  24.32336  4.230285
    1998 |  44.87931  24.58293  54.54345  26.38052  23.25762  4.545486
    1999 |  65.64921  35.77222  72.12251  17.92842  24.04902   3.83916
    2000 |  64.95466  35.53477  78.52392  23.57222  25.88002  4.974467
    2001 |  71.57878  39.91925  71.16756  22.42643  27.29614  5.020053
    2002 |  76.35472  40.28817  98.50034  23.94968  34.73715  4.950495
    2003 |  83.41511  42.23373  81.56173  21.02203  33.90761  5.230312
    2004 |  83.58436  41.11686  97.00659  19.51937  33.05991  4.555656
    2005 |  82.00519  43.09632  89.19735  17.06366  34.78972  3.754821
    2006 |  88.80485  46.09205  102.4688  15.91706  34.50043  3.405816
    2007 |  96.95253  46.28296  101.9677  22.32624  38.95549  3.961474
    2008 |  108.8151  53.99784  105.0824  21.68836  38.33812  3.167708
    2009 |  108.6937  52.00883  116.0962  32.94174  36.94261  3.821195
---------+------------------------------------------------------------
   Total |  72.94336  37.83007  79.99727  20.88311   29.3341  4.220087
----------------------------------------------------------------------

    year |  itecat~u  imiscc~u  flabcc~u  co_oth~u  cdto~ilu
---------+--------------------------------------------------
    1994 |  2.764407   9.58992   .129133  .0389139  230.8924
    1995 |    2.9264  11.22676  .1519657  .1478738  249.0406
    1996 |  2.644461  9.336795  .2103396  .2476923  229.6748
    1997 |  3.007243  8.866015  .4180949  .4214345  210.3143
    1998 |  2.935201   8.61703  .6690715  .6590098  231.6739
    1999 |   3.88984  10.39958  .3152409  .6581395  234.6233
    2000 |  4.275322  13.85568  .5093167  .9522825  253.0327
    2001 |  3.722452   10.4486  .4332042  1.226807  253.2394
    2002 |  4.371756  11.74304  .8274401  1.581358  297.3041
    2003 |  4.225628  10.34692  .7973145  1.989959  284.7303
    2004 |  4.547397  10.17579  1.826936  1.337961  296.7308
    2005 |  4.077104  8.786789  .6867065         0  283.4577
    2006 |  4.261618  11.00595  .6397917  9.02e-09  307.0964
    2007 |  3.397541   11.1156  .9583468         0   325.918
    2008 |  3.318762  11.56566  .5182312         0  346.4921
    2009 |  3.277967  12.08442  .3156135         0  366.1823
---------+--------------------------------------------------
   Total |  3.619481  10.53682  .5980975  .6123333   273.033
------------------------------------------------------------

. 
. * Distributional Analysis - GM
. 
. gen cogm_nosub_mha_q = .
(18672 missing values generated)

. local i = 1994

. while `i' <= 2009 {
  2. 
.         xtile cogm_nosub_mha_q`i' = cogm_nosub_mha if year == `i' & 
> ncattle > 0 & fsizesu >= 2 & droporig == 0 & cpagecat != 0, nq(5)
  3.         replace cogm_nosub_mha_q = cogm_nosub_mha_q`i' if year ==
>  `i' & ncattle > 0 & fsizesu >= 2 & droporig == 0 & cpagecat != 0
  4.         local i = `i' + 1
  5. }
(708 real changes made)
(787 real changes made)
(1096 real changes made)
(1116 real changes made)
(1045 real changes made)
(1053 real changes made)
(1057 real changes made)
(1113 real changes made)
(1110 real changes made)
(1138 real changes made)
(1152 real changes made)
(1105 real changes made)
(1087 real changes made)
(1067 real changes made)
(1009 real changes made)
(947 real changes made)

. 
. * Table 8
. tab year cogm_nosub_mha_q [weight = wt] if ncattle > 0 & fsizesu >= 
> 2 & droporig == 0 & cpagecat != 0, sum(cogm_nosub_mha) nost nofreq n
> oobs
(analytic weights assumed)

                          Means of cogm_nosub_mha

           |                 cogm_nosub_mha_q
      year |         1          2          3          4          5 |  
>    Total
-----------+-------------------------------------------------------+--
> --------
      1994 |-51.157626  104.30661   179.6439  287.43847  517.28475 |  
> 209.6413
      1995 | -92.28208  100.40496  180.13731  269.21072  500.95954 | 2
> 01.72643
      1996 |-121.23238  46.905184   114.0012  197.29457  402.86258 | 1
> 13.35212
      1997 |-86.715496  69.758194  144.67674  227.67838  442.41264 | 1
> 44.15319
      1998 |-315.49741  15.694814  85.503927   174.6578  404.50214 | 4
> 5.860422
      1999 |-130.60827  53.337637    151.308  264.42203   511.7741 | 1
> 48.61197
      2000 | -155.1465  103.04505  212.15689  345.28961  638.11341 | 1
> 97.12335
      2001 |-107.13888  87.311519  191.93828  316.61973  704.60193 | 1
> 85.88866
      2002 |-459.20681  50.441627  150.15509  263.91726  604.28004 | 6
> 7.046106
      2003 |-250.29207  23.702383  132.87163  249.67571  587.44402 | 1
> 11.03536
      2004 |-161.39936  85.856697  193.71064  341.93221  717.95354 | 1
> 91.83661
      2005 |-92.403605  94.486705  206.07942    347.722  727.63129 | 2
> 14.52052
      2006 |-96.432813  105.48938  216.95731   347.5775  678.15849 | 2
> 06.40644
      2007 |-257.72751  98.431466  211.57306  339.25451  655.81234 | 1
> 58.73822
      2008 |-154.32145   106.5561  210.11119  362.53256  688.66242 | 2
> 06.05975
      2009 |-317.66308  36.701213  145.09243  281.57815  651.03446 | 1
> 18.85278
-----------+-------------------------------------------------------+--
> --------
     Total | -184.2685    71.4707   168.9836  284.63141  578.64968 | 1
> 54.14191

. 
. 
. gen cogm_nosub_mha_neg = cogm_nosub_mha < 0

. tab year  [weight = wt] if ncattle > 0 & fsizesu >= 2 & droporig == 
> 0 & cpagecat != 0, sum(cogm_nosub_mha_neg) 
(analytic weights assumed)

            |          Summary of cogm_nosub_mha_neg
       year |        Mean   Std. Dev.       Freq.        Obs.
------------+------------------------------------------------
       1994 |   .10398813   .30546094   74556.338         708
       1995 |   .13022517   .33676502   78576.383         787
       1996 |   .21880381   .41362382   120183.84        1097
       1997 |    .1800627   .38441193   119199.71        1116
       1998 |   .28820705   .45314484   121923.58        1045
       1999 |    .2022337   .40185643   115461.05        1053
       2000 |   .15756467   .36450463    114505.5        1058
       2001 |   .18590589   .38920559   112201.86        1113
       2002 |   .24390041   .42962692   107749.19        1110
       2003 |   .29513058   .45630196   106542.76        1138
       2004 |   .20941865   .40707041   105134.91        1152
       2005 |   .16497594   .37132689   101650.16        1105
       2006 |   .16698217   .37313147   103032.24        1088
       2007 |   .19882691   .39930464   99649.824        1067
       2008 |   .16849515   .37449103   94157.702        1009
       2009 |   .27523157   .44686689   92257.312         947
------------+------------------------------------------------
      Total |   .20273916    .4020519   1666782.4       16593

. 
. tabstat  *_mha  cpforacs fnocatlu co_stock if ncattle > 0 & fsizesu 
> >= 2 & droporig == 0 & cpagecat > 0 & cogm_nosub_mha_neg == 1 [weigh
> t = wt], by(year) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cdgrsm~a  cogm_n~a  cosu~mha  cogros~a  cogo_n~a  cdto~mha
---------+------------------------------------------------------------
    1994 |  47.60092 -120.4662  168.0672  576.9165  408.8494  529.3156
    1995 |  52.31763 -138.5445  190.8621  658.1115  467.2494  605.7939
    1996 |  129.6502 -124.6592  254.3095  645.6156  391.3061  515.9654
    1997 |  123.3204 -115.7551  239.0755  607.0889  368.0134  483.7684
    1998 |  56.66202 -249.6518  306.3139  802.5266  496.2127  745.8646
    1999 |  102.5944 -135.5454  238.1399   530.701  292.5612  428.1066
    2000 |  109.3232 -227.2941  336.6172  638.6742  302.0569   529.351
    2001 |  115.8142 -132.8601  248.6744  580.6197  331.9453  464.8054
    2002 | -119.5763 -461.5183   341.942  645.9977  304.0557   765.574
    2003 |  196.0414 -185.5344  381.5758   739.468  357.8923  543.4267
    2004 |  171.2805 -192.0115  363.2921  692.3693  329.0772  521.0887
    2005 |   77.0759 -139.4848  216.5607  532.3193  315.7586  455.2434
    2006 | -147.1309 -147.1309         0  487.0408  487.0408  634.1717
    2007 | -325.3727 -325.3727         0  461.7059  461.7059  787.0787
    2008 | -211.7758 -219.4347  7.658868  474.8149  467.1561  686.5907
    2009 | -285.4046 -285.4046         0  354.8885  354.8885  640.2931
---------+------------------------------------------------------------
   Total |  12.53594 -210.5803  223.1163  603.4295  380.3133  590.8936
----------------------------------------------------------------------

    year |  cpforacs  fnocatlu  co_stock
---------+------------------------------
    1994 |   12.2629  18.87902  1.584858
    1995 |  14.91119  26.38787  1.679369
    1996 |  14.24935  22.52869   1.69334
    1997 |  15.12552  23.47953  1.552164
    1998 |  16.47031  24.67834  1.895271
    1999 |  16.84328  23.80637  1.485863
    2000 |    16.902  22.76617  1.362878
    2001 |  19.24313   25.4127  1.346104
    2002 |  19.11032  24.03468  1.347278
    2003 |  18.59632  26.38964  1.540624
    2004 |  16.59879  21.21207  1.407974
    2005 |  18.32609  22.85579  1.342596
    2006 |  14.08744   18.7679  1.495028
    2007 |  15.05007  20.71811  1.503547
    2008 |  17.80491  22.14583  1.370326
    2009 |  19.65804  22.78689  1.262789
---------+------------------------------
   Total |  16.88951  23.23536   1.50318
----------------------------------------

. tabstat  *_mha  cpforacs fnocatlu co_stock if ncattle > 0 & fsizesu 
> >= 2 & droporig == 0 & cpagecat > 0 & cogm_nosub_mha_neg == 0 [weigh
> t = wt], by(year) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cdgrsm~a  cogm_n~a  cosu~mha  cogros~a  cogo_n~a  cdto~mha
---------+------------------------------------------------------------
    1994 |  432.4134  247.9525   184.461  824.3412  639.8803  391.9278
    1995 |  469.7913  252.6728  217.1185  882.1333  665.0148   412.342
    1996 |   423.199   180.063   243.136  785.9256  542.7896  362.7266
    1997 |  417.6406  201.2305  216.4102  743.8094  527.3992  326.1688
    1998 |   406.918  165.5142  241.4038   747.723  506.3192  340.8049
    1999 |  458.5834  220.6458  237.9376  837.4055  599.4679  378.8221
    2000 |  606.3022  276.5258  329.7763  993.5116  663.7352  387.2094
    2001 |  550.0021  258.6779  291.3242  958.3272  667.0029   408.325
    2002 |  559.8638  237.5489  322.3149  978.0385  655.7236  418.1747
    2003 |  553.2746  235.2099  318.0647  970.2827   652.218  417.0082
    2004 |  588.0915  293.5149  294.5766  1020.259  725.6824  432.1675
    2005 |  539.7817  284.4615  255.3202  983.8663   728.546  444.0845
    2006 |  277.7141  277.7141         0  706.3575  706.3575  428.6434
    2007 |  278.8799  278.8799         0   723.923   723.923  445.0431
    2008 |  305.1444  292.2814  12.86293   800.437   787.574  495.2926
    2009 |    272.37    272.37         0  792.5203  792.5203  520.1504
---------+------------------------------------------------------------
   Total |  449.9919  246.9322  203.0597  859.5818  656.5221  409.5899
----------------------------------------------------------------------

    year |  cpforacs  fnocatlu  co_stock
---------+------------------------------
    1994 |  19.58532  32.19009  1.715144
    1995 |  19.84813   31.8198  1.697869
    1996 |  19.80837  31.04471  1.624112
    1997 |  20.56764  32.69699  1.657636
    1998 |  21.48374  35.09471  1.701639
    1999 |  20.74566  33.63188  1.661038
    2000 |  20.93831  32.36857  1.600172
    2001 |  22.01196  33.82364  1.619386
    2002 |  23.35986  35.14019  1.547965
    2003 |  22.72267  34.19477  1.559436
    2004 |  22.63372  33.97848  1.561329
    2005 |  23.25121  35.91176  1.569668
    2006 |  23.33656  33.97521  1.463996
    2007 |  23.75413  34.55293  1.474405
    2008 |  24.56055   35.3819  1.475363
    2009 |  25.27475  36.72955  1.483751
---------+------------------------------
   Total |  22.06196  33.85973  1.589665
----------------------------------------

. 
. 
. * table 9
. tab  cpagecat cogm_nosub_mha_q2008 if year == 2008 & ncattle > 0 & f
> sizesu >= 2 & droporig == 0 & cpagecat > 0 [iweight = wt]

           |       5 quantiles of cogm_nosub_mha 
  cpagecat |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         1 | 4,503.541    3,660.7  4,168.032  2,196.579 | 16,301.49 
         2 | 6,141.663  5,956.228  5,058.365  3,272.018 | 22,578.73 
         3 | 1,782.773  2,510.377  3,822.141  4,366.033 | 15,735.27 
         4 | 2,226.065  1,379.368  1,122.292  1,788.395 | 7,792.487 
         5 | 2,959.688  2,767.687  1,950.354  2,675.607 |  11,554.6 
         6 | 1,258.055  1,045.605  1,944.025  2,076.192 | 7,361.639 
         7 | 933.12292  558.31183  681.86443  488.43765 | 4,223.724 
         8 | 199.45366 523.660675  108.22916  210.69334 |1,188.7649 
         9 | 1,675.124  1,331.256  1,204.028  1,566.072 | 7,420.996 
-----------+--------------------------------------------+----------
     Total | 21,679.48  19,733.19  20,059.33  18,640.03 |  94,157.7 


           |     5
           | quantiles
           |     of
           | cogm_nosub
           |   _mha 
  cpagecat |         5 |     Total
-----------+-----------+----------
         1 | 1,772.638 | 16,301.49 
         2 | 2,150.461 | 22,578.73 
         3 | 3,253.946 | 15,735.27 
         4 | 1,276.366 | 7,792.487 
         5 | 1,201.262 |  11,554.6 
         6 | 1,037.762 | 7,361.639 
         7 | 1,561.987 | 4,223.724 
         8 | 146.72806 |1,188.7649 
         9 | 1,644.516 | 7,420.996 
-----------+-----------+----------
     Total | 14,045.67 |  94,157.7 


. 
. * table 10
. sort cogm_nosub_mha_q

. by cogm_nosub_mha_q: tabstat  *_mha  cpforacs fnocatlu co_stock if n
> cattle > 0 & fsizesu >= 2 & droporig == 0 & cpagecat > 0 [weight = w
> t], by(year) stats(mean)

----------------------------------------------------------------------
-> cogm_nosub_mha_q = 1
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cdgrsm~a  cogm_n~a  cosu~mha  cogros~a  cogo_n~a  cdto~mha
---------+------------------------------------------------------------
    1994 |   116.926 -51.15763  168.0836  583.6367  415.5531  466.7107
    1995 |  99.57982 -92.28208  191.8619  615.9522  424.0903  516.3724
    1996 |  131.3196 -121.2324  252.5519  646.4744  393.9225  515.1548
    1997 |  147.4408  -86.7155  234.1563  589.5764  355.4201  442.1356
    1998 |  9.160654 -315.4974  324.6581  878.4851  553.8271  869.3245
    1999 |  110.8439 -130.6083  241.4522  537.4456  295.9935  426.6018
    2000 |  170.7165 -155.1465   325.863  636.7841  310.9211  466.0676
    2001 |  145.4097 -107.1389  252.5486  582.1666   329.618  436.7569
    2002 | -117.6959 -459.2068  341.5109  646.6901  305.1792   764.386
    2003 |  160.3789 -250.2921  410.6709  802.6699  391.9989   642.291
    2004 |  190.5805 -161.3994  351.9799  683.4208  331.4409  492.8403
    2005 |  131.0209 -92.40361  223.4245  569.6764  346.2518  438.6555
    2006 | -96.43281 -96.43281         0  448.4653  448.4653  544.8981
    2007 | -257.7275 -257.7275         0  442.5326  442.5326  700.2601
    2008 | -146.2157 -154.3215  8.105796  452.2386  444.1328  598.4542
    2009 | -317.6631 -317.6631         0  356.5985  356.5985  674.2616
---------+------------------------------------------------------------
   Total |  29.52352 -184.2685   213.792  596.1691  382.3771  566.6456
----------------------------------------------------------------------

    year |  cpforacs  fnocatlu  co_stock
---------+------------------------------
    1994 |  16.30712  21.65419  1.524077
    1995 |  18.52968   27.3436  1.577175
    1996 |  14.12345  22.29737  1.687116
    1997 |  16.54141  24.67852  1.517162
    1998 |  15.22343   24.0071  2.051454
    1999 |  16.65269  23.45122   1.47344
    2000 |   19.0474  23.25934  1.297331
    2001 |  19.80797  26.09132  1.343997
    2002 |  19.15341  24.07285  1.346668
    2003 |  19.04608  29.26449  1.722042
    2004 |  17.50935  22.11537  1.376461
    2005 |  18.29307  22.33221  1.323458
    2006 |  16.41003  19.94842  1.368527
    2007 |  16.65428  21.44422  1.431838
    2008 |  18.81858  21.40948  1.263177
    2009 |  18.81108  22.16036  1.281347
---------+------------------------------
   Total |  17.50795  23.42178  1.476388
----------------------------------------

----------------------------------------------------------------------
-> cogm_nosub_mha_q = 2
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cdgrsm~a  cogm_n~a  cosu~mha  cogros~a  cogo_n~a  cdto~mha
---------+------------------------------------------------------------
    1994 |  263.9298  104.3066  159.6232  590.8624  431.2393  326.9326
    1995 |  304.0891   100.405  203.6841  687.0409  483.3568  382.9518
    1996 |  266.9883  46.90518  220.0831  579.3562  359.2731  312.3679
    1997 |  263.9076  69.75819  194.1494  535.9274   341.778  272.0198
    1998 |  242.5116  15.69481  226.8168  524.0137  297.1969  281.5021
    1999 |  284.0909  53.33764  230.7532   618.028  387.2747  333.9371
    2000 |   431.535   103.045    328.49    762.66    434.17  331.1249
    2001 |  371.9016  87.31152  284.5901   714.136  429.5459  342.2344
    2002 |  343.7385  50.44163  293.2969  702.0964  408.7995  358.3579
    2003 |  329.3815  23.70238  305.6791  647.5039  341.8248  318.1224
    2004 |  363.0095   85.8567  277.1528  697.9218  420.7691  334.9124
    2005 |  303.5937   94.4867   209.107  640.0297  430.9227   336.436
    2006 |  105.4894  105.4894         0  466.4011  466.4011  360.9117
    2007 |  98.43147  98.43147         0  477.9294  477.9294  379.4979
    2008 |  116.8614  106.5561  10.30528  523.5699  513.2646  406.7085
    2009 |  36.70121  36.70121         0  468.1691  468.1691  431.4679
---------+------------------------------------------------------------
   Total |  264.1459   71.4707  192.6752  605.2292   412.554  341.0833
----------------------------------------------------------------------

    year |  cpforacs  fnocatlu  co_stock
---------+------------------------------
    1994 |  21.98628  30.02643  1.446335
    1995 |   22.1073  29.74123  1.449342
    1996 |  22.12316  27.37583  1.383896
    1997 |  24.63491  31.39754  1.391877
    1998 |  22.25587  27.95236  1.413224
    1999 |  22.01178  27.94674  1.388723
    2000 |  21.75337  29.25451   1.40041
    2001 |  22.28603  28.32927  1.387098
    2002 |  24.79168  31.30268  1.288272
    2003 |  21.83944  25.28617  1.192435
    2004 |  25.64252  30.70761  1.235719
    2005 |  23.28836  27.43983  1.184671
    2006 |  23.25662  27.52103   1.22783
    2007 |  22.84092  26.21894  1.185685
    2008 |  23.71006  28.68089  1.251676
    2009 |  24.78952  28.52366  1.244582
---------+------------------------------
   Total |  23.04059  28.49831  1.316072
----------------------------------------

----------------------------------------------------------------------
-> cogm_nosub_mha_q = 3
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cdgrsm~a  cogm_n~a  cosu~mha  cogros~a  cogo_n~a  cdto~mha
---------+------------------------------------------------------------
    1994 |   363.841  179.6439  184.1971  691.7437  507.5466  327.9027
    1995 |  421.3888  180.1373  241.2514  790.0184   548.767  368.6296
    1996 |  353.3788  114.0012  239.3776   653.105  413.7274  299.7262
    1997 |  365.7289  144.6767  221.0522  660.2699  439.2177   294.541
    1998 |  347.6981  85.50393  262.1941  646.9486  384.7545  299.2506
    1999 |  391.6384   151.308  240.3304  709.0009  468.6705  317.3625
    2000 |  531.9925  212.1569  319.8356  859.5438  539.7082  327.5513
    2001 |  470.1928  191.9383  278.2545  816.6016   538.347  346.4088
    2002 |  461.3111  150.1551   311.156  815.1459  503.9899  353.8348
    2003 |  447.3765  132.8716  314.5049  796.7393  482.2345  349.3628
    2004 |  498.2617  193.7106  304.5511  904.3749  599.8238  406.1132
    2005 |  446.7367  206.0794  240.6572  842.8882   602.231  396.1515
    2006 |  216.9573  216.9573         0  587.1426  587.1426  370.1853
    2007 |  211.5731  211.5731         0  596.2078  596.2078  384.6347
    2008 |  228.0398  210.1112  17.92859  645.6722  627.7436  417.6324
    2009 |  145.0924  145.0924         0  578.0152  578.0152  432.9228
---------+------------------------------------------------------------
   Total |  372.8671  168.9836  203.8835  725.7942  521.9108  352.9272
----------------------------------------------------------------------

    year |  cpforacs  fnocatlu  co_stock
---------+------------------------------
    1994 |  18.87903  28.09295  1.525707
    1995 |  22.07678  34.10661  1.596529
    1996 |  19.52451  28.51339  1.494671
    1997 |  21.64952  32.76467  1.559383
    1998 |   22.5519  34.86565  1.594441
    1999 |  20.43669  30.63916  1.525651
    2000 |  22.86463  34.59889  1.493324
    2001 |  23.51644  34.51044  1.515118
    2002 |  24.03406  32.19977  1.376225
    2003 |  23.00364  31.09539  1.356333
    2004 |  23.86525  34.10387  1.501113
    2005 |  25.60659  38.19539  1.501026
    2006 |  23.24796  32.51541  1.410662
    2007 |  24.36973   34.2467  1.402721
    2008 |  24.30616  31.75898   1.35525
    2009 |  26.41754  34.69065  1.325695
---------+------------------------------
   Total |  22.87043  32.92508  1.471458
----------------------------------------

----------------------------------------------------------------------
-> cogm_nosub_mha_q = 4
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cdgrsm~a  cogm_n~a  cosu~mha  cogros~a  cogo_n~a  cdto~mha
---------+------------------------------------------------------------
    1994 |  496.3412  287.4385  208.9027   879.919  671.0163  383.5778
    1995 |  489.6543  269.2107  220.4435  887.4022  666.9586  397.7479
    1996 |  469.9894  197.2946  272.6948  816.7396  544.0448  346.7502
    1997 |  458.6024  227.6784   230.924  752.8032  521.8792  294.2008
    1998 |  425.8458  174.6578   251.188  763.7899  512.6018   337.944
    1999 |  510.2108   264.422  245.7888  918.0703  672.2815  407.8595
    2000 |  685.6043  345.2896  340.3147  1094.811  754.4966   409.207
    2001 |   631.017  316.6197  314.3972  1019.664  705.2668  388.6471
    2002 |  617.1515  263.9173  353.2342  1015.649  662.4145  398.4972
    2003 |  577.5473  249.6757  327.8716  979.8674  651.9958  402.3201
    2004 |  659.6234  341.9322  317.6912  1080.218  762.5266  420.5944
    2005 |  624.4873   347.722  276.7653  1064.068  787.3031  439.5811
    2006 |  347.5775  347.5775         0  758.1412  758.1412  410.5637
    2007 |  339.2545  339.2545         0  758.1995  758.1995   418.945
    2008 |  377.3902  362.5326  14.85761  891.6706   876.813  514.2804
    2009 |  281.5781  281.5781         0  744.1344  744.1344  462.5563
---------+------------------------------------------------------------
   Total |  504.4189  284.6314  219.7875  902.5405   682.753  398.1216
----------------------------------------------------------------------

    year |  cpforacs  fnocatlu  co_stock
---------+------------------------------
    1994 |  18.35643  33.72194  1.771317
    1995 |   18.1977  31.07042  1.702738
    1996 |   20.5807  34.44806   1.66257
    1997 |  18.85253  32.17835    1.6671
    1998 |  20.34466  35.56505  1.735102
    1999 |  19.54789  35.26998  1.837782
    2000 |  19.67076  33.25028  1.721251
    2001 |  22.96135  38.48569  1.696905
    2002 |  23.19909  37.94763  1.648326
    2003 |  24.03628  38.78606  1.634878
    2004 |  21.66718  36.19681   1.64984
    2005 |  23.17143  39.46918  1.717721
    2006 |  25.65165  39.93619  1.528776
    2007 |  25.34215  39.37021  1.555302
    2008 |  26.03759  41.44145   1.63369
    2009 |  27.58195  41.08767  1.488108
---------+------------------------------
   Total |  22.05626  36.63572  1.670529
----------------------------------------

----------------------------------------------------------------------
-> cogm_nosub_mha_q = 5
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cdgrsm~a  cogm_n~a  cosu~mha  cogros~a  cogo_n~a  cdto~mha
---------+------------------------------------------------------------
    1994 |  707.3949  517.2848  190.1101  1238.047  1047.937  530.6523
    1995 |  711.0859  500.9595  210.1264  1233.083  1022.957  521.9974
    1996 |  645.6985  402.8626  242.8359  1156.978  914.1425  511.2799
    1997 |  660.7873  442.4126  218.3747  1133.886  915.5117  473.0991
    1998 |  626.8329  404.5021  222.3308  1094.663  872.3324  467.8302
    1999 |   741.857  511.7741  230.0829  1233.682  1003.599  491.8247
    2000 |  983.3121  638.1134  345.1987   1540.49  1195.292  557.1782
    2001 |  1003.069  704.6019  298.4676  1704.069  1405.602  700.9999
    2002 |  943.9441    604.28   339.664  1570.912  1231.248  626.9683
    2003 |  911.6103   587.444  324.1663  1536.402  1212.235  624.7914
    2004 |  996.4699  717.9535  278.5164  1633.565  1355.049  637.0956
    2005 |  1051.842  727.6313  324.2106  1759.936  1435.725  708.0937
    2006 |  678.1585  678.1585         0  1368.583  1368.583  690.4246
    2007 |  655.8123  655.8123         0  1346.474  1346.474  690.6619
    2008 |  696.7014  688.6624  8.039015  1459.009   1450.97  762.3073
    2009 |  651.0345  651.0345         0  1413.682  1413.682  762.6474
---------+------------------------------------------------------------
   Total |  784.6943  578.6497  206.0446  1384.768  1178.724  600.0738
----------------------------------------------------------------------

    year |  cpforacs  fnocatlu  co_stock
---------+------------------------------
    1994 |  18.76699  40.50768  2.236705
    1995 |  15.42875  32.91225  2.108135
    1996 |  16.94453  35.19387  2.024031
    1997 |  16.49237   35.9243  2.144881
    1998 |   20.2488  41.96107  2.066898
    1999 |  21.38266   44.8314  2.037687
    2000 |  17.24016  35.95609  2.082107
    2001 |  17.55867  38.50788  2.231733
    2002 |  20.46813  41.33994  2.047622
    2003 |  19.24579  39.53581   2.10374
    2004 |  18.03853  37.15326  2.063774
    2005 |   22.3153    47.659  2.189469
    2006 |  22.37644  45.63899  2.023386
    2007 |  22.51614  44.83031  2.014124
    2008 |  25.39053   48.5446  1.959919
    2009 |   22.3705  43.09251  1.891542
---------+------------------------------
   Total |   19.6121  40.52284  2.075769
----------------------------------------

----------------------------------------------------------------------
-> cogm_nosub_mha_q = .
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cdgrsm~a  cogm_n~a  cosu~mha  cogros~a  cogo_n~a  cdto~mha
---------+------------------------------------------------------------
    1996 |         .         .         .         .         .         .
    2000 |         .         .         .         .         .         .
    2006 |         .         .         .         .         .         .
---------+------------------------------------------------------------
   Total |         .         .         .         .         .         .
----------------------------------------------------------------------

    year |  cpforacs  fnocatlu  co_stock
---------+------------------------------
    1996 |         0        .3         .
    2000 |         0       .25         .
    2006 |         0       1.4         .
---------+------------------------------
   Total |         0  1.234713         .
----------------------------------------

. by cogm_nosub_mha_q: tabstat  *_mlu  cpforacs fnocatlu co_stock if n
> cattle > 0 & fsizesu >= 2 & droporig == 0 & cpagecat > 0 [weight = w
> t], by(year) stats(mean)

----------------------------------------------------------------------
-> cogm_nosub_mha_q = 1
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cdgrsm~u  cogm_n~u  cosu~mlu  cogros~u  cogo_n~u  cdto~mlu
---------+------------------------------------------------------------
    1994 |  91.21728  -31.6689  122.8862  379.1001  256.2139  287.8828
    1995 |  84.45247 -54.92353   139.376  397.6944  258.3184  313.2419
    1996 |  92.59434 -74.72334  167.3177  391.3018  223.9841  298.7074
    1997 |  95.77693 -70.37477  166.1517  387.8693  221.7176  292.0924
    1998 |  51.87084 -147.5846  199.4554  411.2324   211.777  359.3616
    1999 |  85.29556 -91.01986  176.3154  374.4679  198.1525  289.1724
    2000 |  170.3779 -106.7833  277.1612   504.229  227.0679  333.8512
    2001 |  119.3873 -73.15905  192.5463  422.5029  229.9566  303.1156
    2002 |  79.82497 -196.6528  276.4777  491.4772  214.9995  411.6523
    2003 |  110.4297 -161.2954  271.7251  490.0124  218.2872  379.5826
    2004 |  103.3375 -161.9866  265.3241  495.8037  230.4796  392.4662
    2005 |  109.8339 -71.77239  181.6063  431.1103   249.504  321.2764
    2006 | -71.57595 -71.57595         0  311.4757  311.4757  383.0517
    2007 | -145.1135 -145.1135         0  292.8003  292.8003  437.9138
    2008 | -98.40512 -105.2504  6.845258  343.3499  336.5047   441.755
    2009 | -206.4976 -206.4976         0  260.4995  260.4995  466.9971
---------+------------------------------------------------------------
   Total |  42.98118 -113.9417  156.9229  401.2314  244.3085  358.2502
----------------------------------------------------------------------

    year |  cpforacs  fnocatlu  co_stock
---------+------------------------------
    1994 |  16.30712  21.65419  1.524077
    1995 |  18.52968   27.3436  1.577175
    1996 |  14.12345  22.29737  1.687116
    1997 |  16.54141  24.67852  1.517162
    1998 |  15.22343   24.0071  2.051454
    1999 |  16.65269  23.45122   1.47344
    2000 |   19.0474  23.25934  1.297331
    2001 |  19.80797  26.09132  1.343997
    2002 |  19.15341  24.07285  1.346668
    2003 |  19.04608  29.26449  1.722042
    2004 |  17.50935  22.11537  1.376461
    2005 |  18.29307  22.33221  1.323458
    2006 |  16.41003  19.94842  1.368527
    2007 |  16.65428  21.44422  1.431838
    2008 |  18.81858  21.40948  1.263177
    2009 |  18.81108  22.16036  1.281347
---------+------------------------------
   Total |  17.50795  23.42178  1.476388
----------------------------------------

----------------------------------------------------------------------
-> cogm_nosub_mha_q = 2
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cdgrsm~u  cogm_n~u  cosu~mlu  cogros~u  cogo_n~u  cdto~mlu
---------+------------------------------------------------------------
    1994 |  199.4623   79.0942  120.3681  412.6153  292.2472   213.153
    1995 |  223.7968  78.95464  144.8421  472.0334  327.1913  248.2366
    1996 |  216.9838  40.22491  176.7589  424.9184  248.1595  207.9346
    1997 |  209.2129    60.003  149.2099  393.0026  243.7927  183.7897
    1998 |  185.4282  12.57778  172.8504  384.5118  211.6613  199.0836
    1999 |  226.6715  46.08496  180.5865  456.2316   275.645  229.5601
    2000 |  339.4658  88.34405  251.1217  570.3406  319.2188  230.8748
    2001 |   285.315  73.76817  211.5468  518.6169  307.0701  233.3019
    2002 |  277.5137  46.08233  231.4314  546.2006  314.7692  268.6869
    2003 |  297.3004  22.77777  274.5227  558.0746  283.5519  260.7742
    2004 |  311.8026  79.67571  232.1269  571.5378  339.4109  259.7352
    2005 |  275.2374   92.1016  183.1358  546.0069  362.8711  270.7695
    2006 |    98.013    98.013         0  378.5838  378.5838  280.5708
    2007 |  100.3017  100.3017         0  400.2254  400.2254  299.9238
    2008 |  108.9267  99.43691  9.489748   418.436  408.9463  309.5094
    2009 |  35.68655  35.68655         0  364.1427  364.1427  328.4562
---------+------------------------------------------------------------
   Total |  217.2995  63.95115  153.3483  466.9028  313.5545  249.6034
----------------------------------------------------------------------

    year |  cpforacs  fnocatlu  co_stock
---------+------------------------------
    1994 |  21.98628  30.02643  1.446335
    1995 |   22.1073  29.74123  1.449342
    1996 |  22.12316  27.37583  1.383896
    1997 |  24.63491  31.39754  1.391877
    1998 |  22.25587  27.95236  1.413224
    1999 |  22.01178  27.94674  1.388723
    2000 |  21.75337  29.25451   1.40041
    2001 |  22.28603  28.32927  1.387098
    2002 |  24.79168  31.30268  1.288272
    2003 |  21.83944  25.28617  1.192435
    2004 |  25.64252  30.70761  1.235719
    2005 |  23.28836  27.43983  1.184671
    2006 |  23.25662  27.52103   1.22783
    2007 |  22.84092  26.21894  1.185685
    2008 |  23.71006  28.68089  1.251676
    2009 |  24.78952  28.52366  1.244582
---------+------------------------------
   Total |  23.04059  28.49831  1.316072
----------------------------------------

----------------------------------------------------------------------
-> cogm_nosub_mha_q = 3
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cdgrsm~u  cogm_n~u  cosu~mlu  cogros~u  cogo_n~u  cdto~mlu
---------+------------------------------------------------------------
    1994 |  258.2322  129.2694  128.9628  467.7613  338.7984   209.529
    1995 |  282.8455  124.1745   158.671  498.6706  339.9995   215.825
    1996 |  250.2043   85.1704  165.0339  438.5412  273.5072  188.3368
    1997 |  248.9843  101.7515  147.2328  426.6453  279.4126   177.661
    1998 |   235.528  61.82571  173.7023  413.3839  239.6816  177.8559
    1999 |  288.2717   117.541  170.7307  487.3724  316.6417  199.1007
    2000 |    384.37   157.484   226.886  593.2673  366.3813  208.8974
    2001 |  338.2339  142.7846  195.4493  560.9156  365.4663  222.6816
    2002 |  357.5082  126.2127  231.2955  599.4314  368.1359  241.9233
    2003 |  349.4871  110.2114  239.2757   600.328  361.0522  250.8408
    2004 |  360.9425  147.7498  213.1927  620.1915  406.9989  259.2491
    2005 |  324.6519  152.5474  172.1045  578.0193  405.9148  253.3674
    2006 |  172.6577  172.6577         0  424.8586  424.8586  252.2009
    2007 |  163.1659  163.1659         0  428.4975  428.4975  265.3316
    2008 |  185.3373  172.8799  12.45737  477.5665  465.1092  292.2293
    2009 |  124.0749  124.0749         0  439.9034  439.9034  315.8285
---------+------------------------------------------------------------
   Total |  273.3704  129.6881  143.6822   504.488  360.8057  231.1176
----------------------------------------------------------------------

    year |  cpforacs  fnocatlu  co_stock
---------+------------------------------
    1994 |  18.87903  28.09295  1.525707
    1995 |  22.07678  34.10661  1.596529
    1996 |  19.52451  28.51339  1.494671
    1997 |  21.64952  32.76467  1.559383
    1998 |   22.5519  34.86565  1.594441
    1999 |  20.43669  30.63916  1.525651
    2000 |  22.86463  34.59889  1.493324
    2001 |  23.51644  34.51044  1.515118
    2002 |  24.03406  32.19977  1.376225
    2003 |  23.00364  31.09539  1.356333
    2004 |  23.86525  34.10387  1.501113
    2005 |  25.60659  38.19539  1.501026
    2006 |  23.24796  32.51541  1.410662
    2007 |  24.36973   34.2467  1.402721
    2008 |  24.30616  31.75898   1.35525
    2009 |  26.41754  34.69065  1.325695
---------+------------------------------
   Total |  22.87043  32.92508  1.471458
----------------------------------------

----------------------------------------------------------------------
-> cogm_nosub_mha_q = 4
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cdgrsm~u  cogm_n~u  cosu~mlu  cogros~u  cogo_n~u  cdto~mlu
---------+------------------------------------------------------------
    1994 |  296.3434  173.2771  123.0663  508.0308  384.9645  211.6874
    1995 |  300.9251  168.4009  132.5243  525.0015  392.4773  224.0764
    1996 |  297.8585   129.232  168.6265  498.3923  329.7658  200.5338
    1997 |  287.4608  146.8499   140.611  456.4454  315.8344  168.9845
    1998 |  259.9199  108.4939   151.426  444.4956  293.0696  184.5757
    1999 |  296.1565  154.4612  141.6953  513.1499  371.4545  216.9934
    2000 |  429.3905  222.6991  206.6914  658.0731  451.3817  228.6826
    2001 |  391.5114  198.2933  193.2181  610.0897  416.8716  218.5783
    2002 |  399.7697  173.9019  225.8678  635.3401  409.4723  235.5704
    2003 |  374.6905  166.3036  208.3869  611.7294  403.3425  237.0389
    2004 |  467.7436  224.5126   243.231  716.0367  472.8057  248.2931
    2005 |  385.3181  214.6995  170.6186  633.6224  463.0038  248.3043
    2006 |  245.1403  245.1403         0  503.4017  503.4017  258.2614
    2007 |   233.903   233.903         0  496.6113  496.6113  262.7082
    2008 |  249.6975  240.4373  9.260283  555.4173   546.157  305.7197
    2009 |  201.4724  201.4724         0  503.1265  503.1265  301.6542
---------+------------------------------------------------------------
   Total |  322.1412   184.627  137.5142  553.4417  415.9276  231.3006
----------------------------------------------------------------------

    year |  cpforacs  fnocatlu  co_stock
---------+------------------------------
    1994 |  18.35643  33.72194  1.771317
    1995 |   18.1977  31.07042  1.702738
    1996 |   20.5807  34.44806   1.66257
    1997 |  18.85253  32.17835    1.6671
    1998 |  20.34466  35.56505  1.735102
    1999 |  19.54789  35.26998  1.837782
    2000 |  19.67076  33.25028  1.721251
    2001 |  22.96135  38.48569  1.696905
    2002 |  23.19909  37.94763  1.648326
    2003 |  24.03628  38.78606  1.634878
    2004 |  21.66718  36.19681   1.64984
    2005 |  23.17143  39.46918  1.717721
    2006 |  25.65165  39.93619  1.528776
    2007 |  25.34215  39.37021  1.555302
    2008 |  26.03759  41.44145   1.63369
    2009 |  27.58195  41.08767  1.488108
---------+------------------------------
   Total |  22.05626  36.63572  1.670529
----------------------------------------

----------------------------------------------------------------------
-> cogm_nosub_mha_q = 5
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cdgrsm~u  cogm_n~u  cosu~mlu  cogros~u  cogo_n~u  cdto~mlu
---------+------------------------------------------------------------
    1994 |  325.4735   236.097  89.37647  560.3388  470.9624  234.8654
    1995 |  354.3825  246.9482  107.4343  603.6445  496.2102   249.262
    1996 |  334.0728  208.1248   125.948  582.2362  456.2882  248.1634
    1997 |   322.176  214.8089  107.3672  539.6519  432.2847  217.4758
    1998 |  318.7329  206.7135  112.0195  540.6319  428.6125   221.899
    1999 |  401.1143  273.2512  127.8631  641.6521  513.7891  240.5379
    2000 |  494.9992  317.8218  177.1774  755.5111  578.3337  260.5119
    2001 |  465.0453  322.5092  142.5361  769.2925  626.7564  304.2472
    2002 |  479.9036  310.7127  169.1909   788.765  619.5741  308.8614
    2003 |  454.7161  283.1597  171.5564  748.6897  577.1333  293.9736
    2004 |  508.9249  359.3193  149.6056  811.4328  661.8272  302.5079
    2005 |   515.992  344.9688  171.0232  851.0538  680.0306  335.0618
    2006 |  348.7104  348.7104         0  683.5091  683.5091  334.7987
    2007 |  339.0365  339.0365         0  677.2367  677.2367  338.2002
    2008 |  366.5022  362.2922  4.209923  749.5189   745.309  383.0167
    2009 |  359.4473  359.4473         0  752.3634  752.3634   392.916
---------+------------------------------------------------------------
   Total |  396.2818  290.6733  105.6085  683.2128  577.6043  286.9311
----------------------------------------------------------------------

    year |  cpforacs  fnocatlu  co_stock
---------+------------------------------
    1994 |  18.76699  40.50768  2.236705
    1995 |  15.42875  32.91225  2.108135
    1996 |  16.94453  35.19387  2.024031
    1997 |  16.49237   35.9243  2.144881
    1998 |   20.2488  41.96107  2.066898
    1999 |  21.38266   44.8314  2.037687
    2000 |  17.24016  35.95609  2.082107
    2001 |  17.55867  38.50788  2.231733
    2002 |  20.46813  41.33994  2.047622
    2003 |  19.24579  39.53581   2.10374
    2004 |  18.03853  37.15326  2.063774
    2005 |   22.3153    47.659  2.189469
    2006 |  22.37644  45.63899  2.023386
    2007 |  22.51614  44.83031  2.014124
    2008 |  25.39053   48.5446  1.959919
    2009 |   22.3705  43.09251  1.891542
---------+------------------------------
   Total |   19.6121  40.52284  2.075769
----------------------------------------

----------------------------------------------------------------------
-> cogm_nosub_mha_q = .
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cdgrsm~u  cogm_n~u  cosu~mlu  cogros~u  cogo_n~u  cdto~mlu
---------+------------------------------------------------------------
    1996 |  266.6667  266.6667         0  266.6667  266.6667         0
    2000 |   1010.72   1010.72         0   1188.48   1188.48    177.76
    2006 | -740.7143 -740.7143         0  410.7143  410.7143  1151.429
---------+------------------------------------------------------------
   Total |  -559.752  -559.752         0  428.4132  428.4132  988.1652
----------------------------------------------------------------------

    year |  cpforacs  fnocatlu  co_stock
---------+------------------------------
    1996 |         0        .3         .
    2000 |         0       .25         .
    2006 |         0       1.4         .
---------+------------------------------
   Total |         0  1.234713         .
----------------------------------------

. by cogm_nosub_mha_q: tabstat  cogm_nosub_mlu cogo_nosub_mlu cdtotldc
> _mlu cdconcen_ilu cdpastur_ilu cdwinfor_ilu cdmilsub_ilu ivmallc_ilu
>  iaisfcat_ilu itecattl_ilu if ncattle > 0 & fsizesu >= 2 & droporig 
> == 0 & cpagecat > 0 [weight = wt], by(year) stats(mean)

----------------------------------------------------------------------
-> cogm_nosub_mha_q = 1
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cogm_n~u  cogo_n~u  cdto~mlu  cdconc~u  cdpast~u  cdwinf~u
---------+------------------------------------------------------------
    1994 |  -31.6689  256.2139  287.8828  72.07809  27.22063  69.70942
    1995 | -54.92353  258.3184  313.2419  83.82931  32.50606  72.06901
    1996 | -74.72334  223.9841  298.7074  66.11086  33.14944   81.2538
    1997 | -70.37477  221.7176  292.0924  63.36917  29.04435  77.19127
    1998 | -147.5846   211.777  359.3616  72.73934   29.4518  68.14596
    1999 | -91.01986  198.1525  289.1724  87.00762  44.43959  88.50358
    2000 | -106.7833  227.0679  333.8512  75.76754  40.71393  111.5167
    2001 | -73.15905  229.9566  303.1156  86.06141  46.69116  87.48902
    2002 | -196.6528  214.9995  411.6523  89.96608  41.14288   158.954
    2003 | -161.2954  218.2872  379.5826  130.6918  48.08756   92.9582
    2004 | -161.9866  230.4796  392.4662  111.6187  44.83999  144.3426
    2005 | -71.77239   249.504  321.2764  99.21704  46.00171  101.8611
    2006 | -71.57595  311.4757  383.0517  114.2615  51.82685  130.2671
    2007 | -145.1135  292.8003  437.9138  134.6251  50.42174  137.3294
    2008 | -105.2504  336.5047   441.755  136.8267  68.58876  134.7326
    2009 | -206.4976  260.4995  466.9971  124.6551  65.09727  147.8158
---------+------------------------------------------------------------
   Total | -113.9417  244.3085  358.2502  96.52638   43.8161  107.7514
----------------------------------------------------------------------

    year |  cdmils~u  ivmall~u  iaisfc~u  itecat~u
---------+----------------------------------------
    1994 |  26.36669  21.08637  3.981085  2.875192
    1995 |  27.52603  20.08399  4.229005  2.754923
    1996 |  20.45394  24.55229  4.320634  3.545431
    1997 |  18.86854  28.23355  5.078997  4.626166
    1998 |  72.44023  26.64327  6.343571  5.247748
    1999 |  20.05036  28.68576  4.995061  4.224814
    2000 |  37.19799  29.63275  5.647119  4.209631
    2001 |   28.7634  30.24586  4.814452  5.489901
    2002 |  38.60207  50.87365  4.904867  7.017551
    2003 |  37.08064  41.01445  4.817332  6.509849
    2004 |  20.98789   35.9412  4.818522  7.743246
    2005 |  15.40357  37.26876  3.693554  5.937256
    2006 |  23.58821   38.8524  3.582458  5.840641
    2007 |  43.72688  47.00474   4.43167  4.683441
    2008 |  34.03117  45.34186  3.400311  3.590628
    2009 |  65.37675  42.88899  4.245724  4.348806
---------+----------------------------------------
   Total |  33.45154  34.74818  4.639316  5.042863
--------------------------------------------------

----------------------------------------------------------------------
-> cogm_nosub_mha_q = 2
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cogm_n~u  cogo_n~u  cdto~mlu  cdconc~u  cdpast~u  cdwinf~u
---------+------------------------------------------------------------
    1994 |   79.0942  292.2472   213.153  53.72812  27.28343  48.28759
    1995 |  78.95464  327.1913  248.2366  63.40768  32.67038  52.56732
    1996 |  40.22491  248.1595  207.9346  42.37381  25.19841  56.20325
    1997 |    60.003  243.7927  183.7897  32.65942  23.06346  50.30453
    1998 |  12.57778  211.6613  199.0836  39.08186  21.93996  57.11706
    1999 |  46.08496   275.645  229.5601  63.54242  33.00613  74.22453
    2000 |  88.34405  319.2188  230.8748  60.18785  32.16908   76.3933
    2001 |  73.76817  307.0701  233.3019  63.66669  36.04157  76.92274
    2002 |  46.08233  314.7692  268.6869  72.42388  40.64657  90.55148
    2003 |  22.77777  283.5519  260.7742  69.72458  37.77935  86.38758
    2004 |  79.67571  339.4109  259.7352   72.7072  38.27556  88.40083
    2005 |   92.1016  362.8711  270.7695  70.45875  40.64181  96.03805
    2006 |    98.013  378.5838  280.5708  74.16009  47.26657  101.5932
    2007 |  100.3017  400.2254  299.9238  86.38455  49.08133  101.6106
    2008 |  99.43691  408.9463  309.5094  88.27098   47.6554  106.1687
    2009 |  35.68655  364.1427  328.4562  102.7964  48.55469  116.3162
---------+------------------------------------------------------------
   Total |  63.95115  313.5545  249.6034  65.14284  36.05441  80.05386
----------------------------------------------------------------------

    year |  cdmils~u  ivmall~u  iaisfc~u  itecat~u
---------+----------------------------------------
    1994 |  12.89947  17.48478  4.203478  2.505882
    1995 |  16.50478  20.23795  3.449033  3.317176
    1996 |   9.74444  21.81606  4.182192  2.565275
    1997 |  7.054508  23.14602  3.789799  3.696761
    1998 |  7.589498  23.14361  5.253642   2.25306
    1999 |  15.09133  24.43761  5.008329  3.293868
    2000 |  15.32871  24.83929   5.51467  5.464426
    2001 |     10.07  25.54129  4.847306  3.885028
    2002 |  13.06192  28.81716  4.568661  4.659983
    2003 |  8.716738  35.13883  7.014735  4.914151
    2004 |  9.340944  31.07191  5.120021  3.512197
    2005 |  9.665635  36.48664  5.253887  4.006357
    2006 |  6.400563  33.45154   4.12701  4.302637
    2007 |  6.588922  37.40585  4.239536  4.076371
    2008 |  12.63275  37.41312   3.32177  2.788106
    2009 |  7.995574   35.2862  3.553026  3.071858
---------+----------------------------------------
   Total |  10.38452  28.58078  4.685987  3.691314
--------------------------------------------------

----------------------------------------------------------------------
-> cogm_nosub_mha_q = 3
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cogm_n~u  cogo_n~u  cdto~mlu  cdconc~u  cdpast~u  cdwinf~u
---------+------------------------------------------------------------
    1994 |  129.2694  338.7984   209.529   46.9883  24.99725  47.32187
    1995 |  124.1745  339.9995   215.825  49.38517  27.18598  53.11891
    1996 |   85.1704  273.5072  188.3368  34.28249   25.7983  51.26879
    1997 |  101.7515  279.4126   177.661  32.94036  21.91852  46.18156
    1998 |  61.82571  239.6816  177.8559  30.76415  22.25606  50.12564
    1999 |   117.541  316.6417  199.1007  51.84892  29.04087  67.08103
    2000 |   157.484  366.3813  208.8974  59.68746  32.28147  66.15712
    2001 |  142.7846  365.4663  222.6816  62.16355  36.48494  61.63606
    2002 |  126.2127  368.1359  241.9233  64.92179  35.98425  76.39934
    2003 |  110.2114  361.0522  250.8408  68.78086  37.56953  81.63248
    2004 |  147.7498  406.9989  259.2491  72.24878  40.70201  82.10311
    2005 |  152.5474  405.9148  253.3674  68.63288  39.77287  82.99148
    2006 |  172.6577  424.8586  252.2009   69.4955  41.12725  87.08414
    2007 |  163.1659  428.4975  265.3316  75.50457  38.14179  92.36261
    2008 |  172.8799  465.1092  292.2293  87.85886  46.41064  97.59666
    2009 |  124.0749  439.9034  315.8285  98.66747  47.18268  108.3482
---------+------------------------------------------------------------
   Total |  129.6881  360.8057  231.1176  60.12741  33.99398  71.62596
----------------------------------------------------------------------

    year |  cdmils~u  ivmall~u  iaisfc~u  itecat~u
---------+----------------------------------------
    1994 |  20.62341  15.37744  3.428699  3.533145
    1995 |  12.69382  18.12443  3.604447  2.717741
    1996 |  8.805807  20.26117   4.51231  2.560033
    1997 |  10.34375  21.97548  5.060685  2.374235
    1998 |  8.795038  20.59896  4.533058  2.640415
    1999 |  12.01767  21.58202  3.088505  3.957833
    2000 |  11.03921  21.77593  4.554423  3.458081
    2001 |  17.16748  26.67778  5.623386    2.8454
    2002 |  14.71347  29.48945  5.794297  3.668029
    2003 |  10.94047   29.8163  5.659814  3.127139
    2004 |  14.13899   32.5468  4.400919  3.994596
    2005 |  12.22034  34.59487  3.887446  3.058143
    2006 |  7.076321  30.65984  2.690032  3.065736
    2007 |  6.416306   35.4005  3.710967   3.24638
    2008 |     9.187  34.27546   3.79046  3.024073
    2009 |  10.01787  34.50859  3.413021  2.871538
---------+----------------------------------------
   Total |  11.47702   26.7311  4.280326  3.139005
--------------------------------------------------

----------------------------------------------------------------------
-> cogm_nosub_mha_q = 4
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cogm_n~u  cogo_n~u  cdto~mlu  cdconc~u  cdpast~u  cdwinf~u
---------+------------------------------------------------------------
    1994 |  173.2771  384.9645  211.6874  54.78187  24.75798  46.27118
    1995 |  168.4009  392.4773  224.0764  53.57933  29.29174  47.80063
    1996 |   129.232  329.7658  200.5338  39.59062  25.14254  50.37168
    1997 |  146.8499  315.8344  168.9845  27.77815  19.38084  45.86932
    1998 |  108.4939  293.0696  184.5757  33.56699  22.87639  46.45195
    1999 |  154.4612  371.4545  216.9934  61.20952  34.54745   63.4324
    2000 |  222.6991  451.3817  228.6826  58.72688  33.32985  66.55646
    2001 |  198.2933  416.8716  218.5783  62.20868  33.50469  61.21496
    2002 |  173.9019  409.4723  235.5704  65.68333  36.10362  74.32594
    2003 |  166.3036  403.3425  237.0389  61.69882  37.77413  73.37582
    2004 |  224.5126  472.8057  248.2931  71.10606  36.88909  74.75558
    2005 |  214.6995  463.0038  248.3043  69.80915  39.77227  80.39992
    2006 |  245.1403  503.4017  258.2614  80.47111  39.88675  79.29368
    2007 |   233.903  496.6113  262.7082  77.26694  41.48939  82.53543
    2008 |  240.4373   546.157  305.7197  102.1324  49.33254  91.21074
    2009 |  201.4724  503.1265  301.6542  93.07312  44.58446  97.19148
---------+------------------------------------------------------------
   Total |   184.627  415.9276  231.3006  61.60793  33.75165  66.67462
----------------------------------------------------------------------

    year |  cdmils~u  ivmall~u  iaisfc~u  itecat~u
---------+----------------------------------------
    1994 |  16.58816  15.88852  3.554669  1.877919
    1995 |  16.48011  18.46752  3.353842  3.237686
    1996 |  13.47742  21.51944  4.150755  2.564244
    1997 |   10.9129  23.10831  3.592996  2.261273
    1998 |  11.52259  22.60166  3.324579  2.183851
    1999 |  18.15609  21.67047  3.446194  3.921831
    2000 |   22.3665  25.13344  5.261162  4.245458
    2001 |  15.86332  25.84859  5.368577  3.211052
    2002 |   13.8288  27.15883  5.049626  3.069001
    2003 |  16.92083  29.93121  4.166513  2.708442
    2004 |  18.96257  30.68686    4.0737  2.099983
    2005 |  12.39784   30.3705  2.991261  3.883947
    2006 |   11.6255  31.18795  3.041511  3.156226
    2007 |  12.32757   34.7372  3.572838  2.108727
    2008 |  12.53434  33.72392  2.442066  2.905667
    2009 |  12.59898  33.69964  3.584708  2.793576
---------+----------------------------------------
   Total |  14.75743  26.44453  3.838951  2.905923
--------------------------------------------------

----------------------------------------------------------------------
-> cogm_nosub_mha_q = 5
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cogm_n~u  cogo_n~u  cdto~mlu  cdconc~u  cdpast~u  cdwinf~u
---------+------------------------------------------------------------
    1994 |   236.097  470.9624  234.8654  60.26283  27.32759  46.24832
    1995 |  246.9482  496.2102   249.262  60.39226  31.06204  47.13946
    1996 |  208.1248  456.2882  248.1634   56.0654  30.48051  48.49911
    1997 |  214.8089  432.2847  217.4758  44.32488  26.75098  43.53209
    1998 |  206.7135  428.6125   221.899  45.25781  26.49619  46.96146
    1999 |  273.2512  513.7891  240.5379  64.78877  39.00497  65.17371
    2000 |  317.8218  578.3337  260.5119  71.49614  40.28392  66.23787
    2001 |  322.5092  626.7564  304.2472  90.53742   50.5863  60.18355
    2002 |  310.7127  619.5741  308.8614  90.30922  50.48062  72.04258
    2003 |  283.1597  577.1333  293.9736  85.19927  53.45395  66.68198
    2004 |  359.3193  661.8272  302.5079   83.7657  44.65257   79.7919
    2005 |  344.9688  680.0306  335.0618  108.3848  51.71445  79.48866
    2006 |  348.7104  683.5091  334.7987  105.0762  51.65006  84.88169
    2007 |  339.0365  677.2367  338.2002  103.3913  52.63227  80.06334
    2008 |  362.2922   745.309  383.0167  133.2394  57.41444  86.89101
    2009 |  359.4473  752.3634   392.916   120.937  50.71372  98.77063
---------+------------------------------------------------------------
   Total |  290.6733  577.6043  286.9311  80.21818  41.79199  65.75763
----------------------------------------------------------------------

    year |  cdmils~u  ivmall~u  iaisfc~u  itecat~u
---------+----------------------------------------
    1994 |  23.13073  20.54386  2.406906  2.970972
    1995 |  29.50759  18.82184  2.839867  2.600065
    1996 |  28.41331  23.70436  4.386887  1.756012
    1997 |  26.72829  24.54374  3.384566   1.65592
    1998 |  27.98348  22.73166  2.460099  1.876949
    1999 |  27.15289  23.74315  2.162755  4.146219
    2000 |  34.89371  28.70836  3.453681  3.863291
    2001 |  54.16267  28.71996   4.27131  2.394052
    2002 |  41.98052  33.63112   4.15958   2.23392
    2003 |   37.8998  32.17764  3.513185  3.159252
    2004 |  38.89762  34.68733  4.161598  4.524981
    2005 |  45.00733  34.74654  2.464432  2.870771
    2006 |  37.09942  34.91919  3.689172  3.629738
    2007 |  44.16886  37.83573   3.58802  2.003383
    2008 |  45.36189  40.75299  2.665855  4.613752
    2009 |  64.65923  36.60181  4.257318  2.960296
---------+----------------------------------------
   Total |  37.16683   29.3079   3.37024  2.907804
--------------------------------------------------

----------------------------------------------------------------------
-> cogm_nosub_mha_q = .
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  cogm_n~u  cogo_n~u  cdto~mlu  cdconc~u  cdpast~u  cdwinf~u
---------+------------------------------------------------------------
    1996 |  266.6667  266.6667         0         0         0         0
    2000 |   1010.72   1188.48    177.76         0         0         0
    2006 | -740.7143  410.7143  1151.429  187.1429         0  785.7143
---------+------------------------------------------------------------
   Total |  -559.752  428.4132  988.1652  159.3831         0  669.1656
----------------------------------------------------------------------

    year |  cdmils~u  ivmall~u  iaisfc~u  itecat~u
---------+----------------------------------------
    1996 |         0         0         0         0
    2000 |         0         0         0         0
    2006 |         0  142.8571         0  35.71429
---------+----------------------------------------
   Total |         0  121.6665         0  30.41662
--------------------------------------------------

. by cogm_nosub_mha_q: tab year cpagecat if ncattle > 0 & fsizesu >= 2
>  & droporig == 0 & cpagecat > 0 [iweight = wt]

----------------------------------------------------------------------
-> cogm_nosub_mha_q = 1

           |                  cpagecat
      year |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
      1994 | 1,642.253  5,032.867   1,581.37  799.55389 | 14,505.43 
      1995 | 1,871.809  4,025.256 1,321.6626  512.60177 | 14,367.12 
      1996 | 3,973.959  9,389.128   2,319.64  1,845.491 |27,029.634 
      1997 | 3,609.879  8,676.409    2,061.1  2,531.344 | 27,646.07 
      1998 | 4,375.221  6,447.109  3,056.007  2,527.848 | 27,541.35 
      1999 | 4,884.208  9,227.357  1,698.973  626.92829 |  24,224.6 
      2000 | 4,978.329   8,310.22  1,138.566  1,938.996 | 25,385.67 
      2001 | 3,060.721  7,084.093  3,730.976  642.48471 | 25,357.44 
      2002 | 3,173.429   8,457.84  2,644.343  2,037.531 | 26,412.33 
      2003 | 2,211.918 4,503.4024  2,867.665  1,377.729 |  22,880.5 
      2004 | 4,694.228  3,948.652  2,359.882  1,759.628 | 25,862.21 
      2005 | 4,765.357  4,242.403  2,728.538  1,131.725 | 23,735.05 
      2006 | 4,452.559  5,973.782   2,950.41  1,731.174 | 24,620.49 
      2007 | 3,685.636  7,826.435   3,276.61  2,365.532 | 24,734.93 
      2008 | 4,503.541  6,141.663  1,782.773  2,226.065 | 21,679.48 
      2009 | 4,391.581 6,214.7424  2,321.093  2,870.341 |  22,701.2 
-----------+--------------------------------------------+----------
     Total | 60,274.63  105,501.4  37,839.61  26,924.97 | 378,683.5 


           |                  cpagecat
      year |         5          6          7          8 |     Total
-----------+--------------------------------------------+----------
      1994 | 122.43333 1,660.4761  1,254.439  87.416664 | 14,505.43 
      1995 | 355.20321   1,192.89  1,680.523     108.92 | 14,367.12 
      1996 | 1,169.274  1,892.069   2,135.31  499.93733 |27,029.634 
      1997 | 1,252.299  2,768.006  1,124.724  694.27478 | 27,646.07 
      1998 | 705.55772  2,421.613  1,725.367  332.27931 | 27,541.35 
      1999 | 459.94764 955.824791  1,249.995  532.11263 |  24,224.6 
      2000 |977.104147 2,151.8596  1,087.614  761.95345 | 25,385.67 
      2001 | 2,204.013  2,774.584  1,194.753  351.27349 | 25,357.44 
      2002 | 2,349.143  4,540.281  449.93305  80.493828 | 26,412.33 
      2003 | 3,495.209  4,474.723 1,082.4353  110.18468 |  22,880.5 
      2004 | 3,009.935  5,496.207  1,019.126  380.32565 | 25,862.21 
      2005 | 2,291.275  4,826.468  1,217.963  920.16094 | 23,735.05 
      2006 | 1,602.991  2,962.711  1,270.776  1,158.791 | 24,620.49 
      2007 |  2,272.82  2,310.769 1,093.8702  476.68784 | 24,734.93 
      2008 | 2,959.688  1,258.055  933.12292  199.45366 | 21,679.48 
      2009 |2,864.7828  2,209.742  904.19114   76.73333 |  22,701.2 
-----------+--------------------------------------------+----------
     Total | 28,091.68  43,896.28  19,424.14  6,770.999 | 378,683.5 


           |  cpagecat
      year |         9 |     Total
-----------+-----------+----------
      1994 |  2,324.62 | 14,505.43 
      1995 | 3,298.256 | 14,367.12 
      1996 | 3,804.826 |27,029.634 
      1997 | 4,928.031 | 27,646.07 
      1998 | 5,950.346 | 27,541.35 
      1999 | 4,589.253 |  24,224.6 
      2000 |  4,041.03 | 25,385.67 
      2001 | 4,314.542 | 25,357.44 
      2002 | 2,679.338 | 26,412.33 
      2003 | 2,757.232 |  22,880.5 
      2004 | 3,194.224 | 25,862.21 
      2005 | 1,611.158 | 23,735.05 
      2006 | 2,517.295 | 24,620.49 
      2007 | 1,426.571 | 24,734.93 
      2008 | 1,675.124 | 21,679.48 
      2009 | 847.99685 |  22,701.2 
-----------+-----------+----------
     Total | 49,959.84 | 378,683.5 


----------------------------------------------------------------------
-> cogm_nosub_mha_q = 2

           |                  cpagecat
      year |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
      1994 | 804.05119  7,625.461  787.15402  182.31667 | 13,787.34 
      1995 | 1,677.219 6,843.0767 1,237.1781  758.96229 | 15,773.28 
      1996 | 3,692.442  9,581.651  1,250.261  1,015.351 | 24,365.52 
      1997 | 4,109.439  7,577.915  2,351.834  1,855.569 | 23,047.42 
      1998 | 3,880.583  11,977.57    3,219.2  316.93297 | 27,243.11 
      1999 | 3,469.163 10,625.005   2,497.05  1,857.579 | 25,347.74 
      2000 | 2,898.643  8,151.934  3,091.705  1,436.806 | 25,021.22 
      2001 | 4,805.804  6,682.135  4,658.193  1,206.001 | 29,010.16 
      2002 | 3,574.453  5,729.866  3,651.285  961.52048 |21,956.028 
      2003 | 5,473.766  6,266.209  2,471.686  1,228.236 | 26,447.56 
      2004 | 3,722.289  6,361.418  3,358.242  837.74908 | 21,825.34 
      2005 | 5,758.161  5,403.698  3,909.564  1,276.037 | 21,975.59 
      2006 | 4,887.186  6,864.838  2,958.459  1,292.839 |    22,398 
      2007 | 5,607.394  5,191.086 3,985.3509  1,227.394 | 21,535.01 
      2008 |   3,660.7  5,956.228  2,510.377  1,379.368 | 19,733.19 
      2009 | 3,254.483 4,757.8546  2,750.698   876.4614 | 19,301.91 
-----------+--------------------------------------------+----------
     Total | 61,275.77  115,595.9  44,688.24  17,709.12 | 358,768.4 


           |                  cpagecat
      year |         5          6          7          8 |     Total
-----------+--------------------------------------------+----------
      1994 |199.661972   780.2147  454.25965  194.80243 | 13,787.34 
      1995 | 326.70724  1,532.118  961.33918  43.419998 | 15,773.28 
      1996 | 637.43333   3,671.92  821.59162  232.24097 | 24,365.52 
      1997 |1,452.1037  1,762.177  290.15911          0 | 23,047.42 
      1998 | 1,061.911  955.81383  507.76989          0 | 27,243.11 
      1999 | 756.99215  1,307.083  969.07446  119.18333 | 25,347.74 
      2000 | 1,722.971  2,150.651 292.612381  716.56432 | 25,021.22 
      2001 | 3,971.023  3,552.371  483.26721  298.08704 | 29,010.16 
      2002 | 1,429.266  2,313.393   390.2094  51.765152 |21,956.028 
      2003 | 1,579.376  1,928.228  207.86252    61.0625 | 26,447.56 
      2004 | 1,625.027  1,539.824   331.9759  288.53789 | 21,825.34 
      2005 | 1,905.403  1,242.818  649.63662   227.7853 | 21,975.59 
      2006 | 1,959.828 660.392971  394.38478  464.57083 |    22,398 
      2007 |2,104.1257  1,510.415  460.98433   72.35714 | 21,535.01 
      2008 | 2,767.687  1,045.605  558.31183 523.660675 | 19,733.19 
      2009 | 2,868.448   2,660.35 1,085.7075  98.384613 | 19,301.91 
-----------+--------------------------------------------+----------
     Total | 26,367.97  28,613.37  8,859.146  3,392.422 | 358,768.4 


           |  cpagecat
      year |         9 |     Total
-----------+-----------+----------
      1994 | 2,759.421 | 13,787.34 
      1995 | 2,393.263 | 15,773.28 
      1996 | 3,462.627 | 24,365.52 
      1997 | 3,648.218 | 23,047.42 
      1998 |5,323.3241 | 27,243.11 
      1999 | 3,746.613 | 25,347.74 
      2000 | 4,559.337 | 25,021.22 
      2001 | 3,353.275 | 29,010.16 
      2002 | 3,854.269 |21,956.028 
      2003 | 7,231.133 | 26,447.56 
      2004 | 3,760.278 | 21,825.34 
      2005 | 1,602.486 | 21,975.59 
      2006 | 2,915.498 |    22,398 
      2007 | 1,375.907 | 21,535.01 
      2008 | 1,331.256 | 19,733.19 
      2009 | 949.52314 | 19,301.91 
-----------+-----------+----------
     Total | 52,266.43 | 358,768.4 


----------------------------------------------------------------------
-> cogm_nosub_mha_q = 3

           |                  cpagecat
      year |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
      1994 | 1,045.542  9,444.783  1,394.854  180.46667 | 16,232.13 
      1995 | 1,354.008  8,284.579 1,741.7162  323.18444 | 15,361.64 
      1996 | 3,071.311 10,027.752  3,408.957  963.20031 | 24,487.54 
      1997 | 1,705.406  11,826.75  3,654.681  511.24928 | 23,539.54 
      1998 | 2,159.396  9,828.245  4,027.019  649.39946 |  24,228.8 
      1999 | 3,084.831  8,604.578  4,977.163  1,121.243 |  25,101.2 
      2000 | 3,811.319  9,059.884  3,867.383  392.26229 | 24,664.56 
      2001 | 4,102.298  9,261.337  3,506.571 690.036438 | 22,620.66 
      2002 | 4,684.636  6,387.606  3,435.129  986.50043 | 23,329.66 
      2003 | 3,900.626  7,321.783  5,332.882  728.39748 | 22,279.35 
      2004 | 4,223.962  5,378.842  5,852.639  989.47813 | 21,860.93 
      2005 | 3,714.701  4,734.336  5,230.328  1,514.579 | 20,938.02 
      2006 | 3,654.416  6,938.677    4,493.8  1,664.248 |22,783.299 
      2007 | 4,148.485  5,677.647  4,044.263  1,975.984 | 21,024.35 
      2008 | 4,168.032  5,058.365  3,822.141  1,122.292 | 20,059.33 
      2009 | 3,485.053  4,425.395 2,957.5589  1,497.197 | 18,018.94 
-----------+--------------------------------------------+----------
     Total | 52,314.02  122,260.6 61,747.085  15,309.72 | 346,529.9 


           |                  cpagecat
      year |         5          6          7          8 |     Total
-----------+--------------------------------------------+----------
      1994 |254.974472  1,323.975   976.2826  154.54741 | 16,232.13 
      1995 | 352.07576  564.95636    364.925  250.33204 | 15,361.64 
      1996 | 1,437.211    1,161.6  476.51783  291.84136 | 24,487.54 
      1997 | 822.02478  719.07083  886.04198  217.13438 | 23,539.54 
      1998 | 719.80065  1,166.247  586.70538  337.50681 |  24,228.8 
      1999 | 1,233.583  1,828.689  680.16351  165.10326 |  25,101.2 
      2000 |  1,174.96  1,067.451   206.0669  344.54719 | 24,664.56 
      2001 | 258.27896  222.93951  225.08166  133.30568 | 22,620.66 
      2002 | 808.85943  1,147.057  690.90956          0 | 23,329.66 
      2003 | 462.90246 394.906517   296.4222   240.9527 | 22,279.35 
      2004 | 547.67008   853.2384  497.97091   301.7159 | 21,860.93 
      2005 | 1,581.058  749.47483  577.67454  277.13746 | 20,938.02 
      2006 | 2,464.104  1,557.509  505.54647          0 |22,783.299 
      2007 | 2,494.739 829.750351  163.64358  381.72726 | 21,024.35 
      2008 | 1,950.354  1,944.025  681.86443  108.22916 | 20,059.33 
      2009 | 2,499.723 819.790657  523.49622  151.85052 | 18,018.94 
-----------+--------------------------------------------+----------
     Total | 19,062.32  16,350.68  8,339.313  3,355.931 | 346,529.9 


           |  cpagecat
      year |         9 |     Total
-----------+-----------+----------
      1994 | 1,456.703 | 16,232.13 
      1995 | 2,125.861 | 15,361.64 
      1996 | 3,649.153 | 24,487.54 
      1997 |  3,197.18 | 23,539.54 
      1998 | 4,754.483 |  24,228.8 
      1999 | 3,405.848 |  25,101.2 
      2000 | 4,740.682 | 24,664.56 
      2001 | 4,220.807 | 22,620.66 
      2002 | 5,188.964 | 23,329.66 
      2003 | 3,600.477 | 22,279.35 
      2004 | 3,215.414 | 21,860.93 
      2005 | 2,558.735 | 20,938.02 
      2006 | 1,504.997 |22,783.299 
      2007 | 1,308.108 | 21,024.35 
      2008 | 1,204.028 | 20,059.33 
      2009 | 1,658.873 | 18,018.94 
-----------+-----------+----------
     Total |47,790.312 | 346,529.9 


----------------------------------------------------------------------
-> cogm_nosub_mha_q = 4

           |                  cpagecat
      year |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
      1994 | 1,002.693    6,610.5  2,563.525  289.82572 | 15,300.52 
      1995 | 1,296.123  5,838.207  1,585.003  695.21552 | 16,151.39 
      1996 | 1,753.093  10,542.91  3,379.817  805.79764 | 23,655.14 
      1997 | 3,269.139  9,167.522  2,962.154  1,429.342 | 24,806.65 
      1998 | 1,784.035  7,149.098  4,788.333  1,624.962 | 24,259.28 
      1999 | 1,266.471  6,497.471   4,807.72 1,699.8964 | 23,048.79 
      2000 | 3,114.979  6,850.937  3,621.468  1,403.103 | 22,035.94 
      2001 | 3,392.501  5,326.304  4,796.362  378.61314 | 20,909.33 
      2002 | 4,060.339  5,505.174  4,301.549  710.86392 | 20,691.69 
      2003 | 4,305.316  5,372.474  4,503.815  287.93127 |19,400.596 
      2004 | 4,198.603  4,435.674  5,010.115  682.64017 | 19,453.91 
      2005 | 3,226.208 6,352.0066  4,658.959  2,259.015 | 20,689.76 
      2006 | 3,081.723  4,289.175   4,167.98  919.59697 | 18,001.56 
      2007 | 3,769.733  4,972.837  4,206.934  607.24478 | 17,671.21 
      2008 | 2,196.579  3,272.018  4,366.033  1,788.395 | 18,640.03 
      2009 | 2,268.079  3,638.002   3,817.16  1,630.672 | 16,599.28 
-----------+--------------------------------------------+----------
     Total | 43,985.61  95,820.31  63,536.93  17,213.12 | 321,315.1 


           |                  cpagecat
      year |         5          6          7          8 |     Total
-----------+--------------------------------------------+----------
      1994 | 575.83687  521.95107  648.83333          0 | 15,300.52 
      1995 |     128.4  1,158.507  935.92749  515.97236 | 16,151.39 
      1996 | 684.89011  968.31545  745.67876  176.31638 | 23,655.14 
      1997 | 841.41366  1,969.954  656.86172     607.75 | 24,806.65 
      1998 | 893.84946  968.88088   653.3867  416.85084 | 24,259.28 
      1999 |  1,088.27 884.692585  1,481.059  61.076271 | 23,048.79 
      2000 | 781.70268  932.44994  988.03513  72.300003 | 22,035.94 
      2001 | 409.44827  225.16935  400.40326  519.66522 | 20,909.33 
      2002 | 587.68668  805.93259  520.33598  460.64313 | 20,691.69 
      2003 | 300.94821  508.44019  584.06118  251.82039 |19,400.596 
      2004 | 544.68243  611.91095  838.53524  214.38095 | 19,453.91 
      2005 | 976.35827  381.99106  950.62404  81.157898 | 20,689.76 
      2006 |  1,784.11  934.57006  806.16919 38.5390625 | 18,001.56 
      2007 | 1,442.153  981.02248  615.64005  59.848484 | 17,671.21 
      2008 | 2,675.607  2,076.192  488.43765  210.69334 | 18,640.03 
      2009 | 1,634.833  1,289.215  625.94867   44.06422 | 16,599.28 
-----------+--------------------------------------------+----------
     Total | 15,350.19  15,219.19  11,939.94  3,731.079 | 321,315.1 


           |  cpagecat
      year |         9 |     Total
-----------+-----------+----------
      1994 | 3,087.357 | 15,300.52 
      1995 | 3,998.037 | 16,151.39 
      1996 | 4,598.319 | 23,655.14 
      1997 |3,902.5177 | 24,806.65 
      1998 | 5,979.882 | 24,259.28 
      1999 | 5,262.136 | 23,048.79 
      2000 | 4,270.968 | 22,035.94 
      2001 | 5,460.861 | 20,909.33 
      2002 | 3,739.169 | 20,691.69 
      2003 |  3,285.79 |19,400.596 
      2004 | 2,917.367 | 19,453.91 
      2005 | 1,803.441 | 20,689.76 
      2006 | 1,979.693 | 18,001.56 
      2007 | 1,015.791 | 17,671.21 
      2008 | 1,566.072 | 18,640.03 
      2009 | 1,651.308 | 16,599.28 
-----------+-----------+----------
     Total | 54,518.71 | 321,315.1 


----------------------------------------------------------------------
-> cogm_nosub_mha_q = 5

           |                  cpagecat
      year |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
      1994 | 997.44366  6,266.271  1,821.546  105.58334 | 14,730.92 
      1995 | 508.74672  6,803.204  1,984.657  169.55882 | 16,922.95 
      1996 |2,073.2668  6,194.573  3,716.305  127.22895 |  20,580.2 
      1997 | 1,499.599  7,585.961  3,032.934  281.85345 | 20,160.03 
      1998 | 873.27168  4,035.413 3,509.2178  1,022.849 | 18,651.04 
      1999 | 1,022.249 2,968.0761  4,084.767 745.098175 | 17,738.72 
      2000 | 1,871.878  4,780.188  3,814.682  262.84335 | 17,371.78 
      2001 | 1,395.261  2,948.673  2,625.661 811.000309 | 14,304.28 
      2002 | 1,514.425  4,013.065   3,584.21  330.07483 |15,359.478 
      2003 | 2,147.255  3,214.299  2,891.425    765.732 | 15,534.76 
      2004 |  2,846.96  3,540.149  3,502.679  895.89714 | 16,132.53 
      2005 | 834.33497  2,915.352   3,865.39  759.12284 | 14,311.74 
      2006 | 1,720.156  2,914.937  3,928.433  539.63264 |  14,699.9 
      2007 | 1,492.508  3,438.355  3,560.817  319.05542 | 14,684.33 
      2008 | 1,772.638  2,150.461  3,253.946  1,276.366 | 14,045.67 
      2009 |  1,980.81  3,342.607  3,243.575  580.11247 | 15,635.98 
-----------+--------------------------------------------+----------
     Total |  24,550.8  67,111.59  52,420.25 8,992.0088 | 260,864.3 


           |                  cpagecat
      year |         5          6          7          8 |     Total
-----------+--------------------------------------------+----------
      1994 |    299.47  873.54532  847.22668          0 | 14,730.92 
      1995 | 247.50909  357.37997  2,222.863        142 | 16,922.95 
      1996 | 425.18697  521.88848  3,222.243  652.77598 |  20,580.2 
      1997 | 246.84375   237.5625 2,461.5858  144.93623 | 20,160.03 
      1998 | 1,227.427  935.16673  2,567.203 291.608345 | 18,651.04 
      1999 | 1,921.799  1,283.526   1,083.53  404.14405 | 17,738.72 
      2000 |         0  1,630.949  1,304.238  377.68961 | 17,371.78 
      2001 |  233.1767   75.88073  1,376.522  136.59434 | 14,304.28 
      2002 | 284.80279         49  1,500.574  529.76021 |15,359.478 
      2003 | 142.91734          0  2,263.556  804.44974 | 15,534.76 
      2004 | 233.35122  47.184212  2,001.235  238.08904 | 16,132.53 
      2005 |  1,206.75  392.54684  1,781.346 94.7497673 | 14,311.74 
      2006 | 1,138.138 357.273243  2,256.912  301.55759 |  14,699.9 
      2007 | 760.25195 509.605629  2,149.317  36.283581 | 14,684.33 
      2008 | 1,201.262  1,037.762  1,561.987  146.72806 | 14,045.67 
      2009 | 1,950.941  556.02677  2,092.419  299.50948 | 15,635.98 
-----------+--------------------------------------------+----------
     Total | 11,519.83  8,865.297  30,692.76  4,600.876 | 260,864.3 


           |  cpagecat
      year |         9 |     Total
-----------+-----------+----------
      1994 |  3,519.83 | 14,730.92 
      1995 | 4,487.031 | 16,922.95 
      1996 | 3,646.728 |  20,580.2 
      1997 | 4,668.753 | 20,160.03 
      1998 | 4,188.883 | 18,651.04 
      1999 | 4,225.532 | 17,738.72 
      2000 | 3,329.312 | 17,371.78 
      2001 | 4,701.514 | 14,304.28 
      2002 | 3,553.565 |15,359.478 
      2003 | 3,305.121 | 15,534.76 
      2004 | 2,826.979 | 16,132.53 
      2005 | 2,462.145 | 14,311.74 
      2006 | 1,542.863 |  14,699.9 
      2007 | 2,418.133 | 14,684.33 
      2008 | 1,644.516 | 14,045.67 
      2009 | 1,589.979 | 15,635.98 
-----------+-----------+----------
     Total | 52,110.89 | 260,864.3 


----------------------------------------------------------------------
-> cogm_nosub_mha_q = .

           |       cpagecat
      year |         1          4 |     Total
-----------+----------------------+----------
      1996 |   65.8125          0 |   65.8125 
      2000 |         0 26.3235302 |26.3235302 
      2006 |         0        529 |       529 
-----------+----------------------+----------
     Total |   65.8125  555.32353 | 621.13603 



. 
. 
. * Off-farm employment
. tab year cogm_nosub_mha_q [weight = wt] if ncattle > 0 & fsizesu >= 
> 2 & droporig == 0 & cpagecat != 0, sum(isofffarmy) nost nofreq noobs
(analytic weights assumed)

                            Means of isofffarmy

           |                 cogm_nosub_mha_q
      year |         1          2          3          4          5 |  
>    Total
-----------+-------------------------------------------------------+--
> --------
      1994 |  .2621496  .17821729  .26091396   .1411124  .16390805 | .
> 20210935
      1995 |   .269821  .28329216   .1957902  .23419142  .16749402 | .
> 22869043
      1996 | .30972927  .35394886  .30862433    .261679  .14978098 |  
> .2816067
      1997 | .34140959  .30673957  .30783302  .29285325  .14077554 | .
> 28403747
      1998 | .36381973  .31077068  .28491665  .31073403  .18604903 | .
> 29852984
      1999 | .34750164  .34551402  .30389484  .33293185  .22568222 | .
> 31596112
      2000 | .27430484   .3849944  .35570139  .29073113  .26115335 | .
> 31720087
      2001 | .31838903  .38228058  .31217158  .29811942  .24801229 | .
> 32090546
      2002 | .31099063  .39693412  .31366482  .37694533  .23645728 | .
> 33112337
      2003 | .35542946  .32318381  .32737371  .41329386  .22121032 | .
> 33252466
      2004 | .39616502  .38199543  .34933708  .34444748  .27028051 | .
> 35460031
      2005 | .35757312  .41104381  .41581529  .41955458  .18848728 | .
> 36993902
      2006 | .32790257  .47882725  .50348909  .33875209  .32207457 | .
> 40097819
      2007 | .41033679  .36460234  .49360589  .35959812  .34673464 | .
> 39965156
      2008 | .36701841  .44141763  .42864028  .39828321  .30480176 | .
> 39264701
      2009 | .36067726  .31428924  .40038778  .33450713  .25205143 | .
> 33560919
-----------+-------------------------------------------------------+--
> --------
     Total | .33909906  .35831688  .34925939  .32328563   .2257943 | .
> 32456106

. 
. * Net Margins Analysis
. 
. tabstat  ffiperhectare marketffi_ha mkt_fcgm_ha prod_fc_ha oth_fc_ha
>  farmdc_ha mkt_fcgm1_ha  dirpayts_ha isofffarmy is65 if (system >= 2
>  & system <=3) & ncattle > 0 & fsizesu >= 2 & droporig == 0 & (syste
> m == 2 | system == 3) & cpagecat != 0 [weight = wt], by(year) stats(
> mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  ffiper~e  mar~i_ha  ~fcgm_ha  prod_f~a  oth_fc~a  farmdc~a
---------+------------------------------------------------------------
    1994 |  374.2463  72.58077  334.6431  78.32766  183.8053    273.17
    1995 |  326.4988   31.9307  294.4833  75.89087  186.6618  256.7904
    1996 |  305.2442 -10.37212  233.2036  68.60165  174.9928  240.9187
    1997 |  315.3298  32.19551  266.2192  68.61544  165.4083  232.0116
    1998 |  334.3231 -14.11762  235.4616  73.50105  176.0782  246.1451
    1999 |  203.7879 -101.2599  166.8979  76.66387  192.2309  267.8908
    2000 |  290.1584 -86.91596  215.7356  84.20538  219.0079  275.3347
    2001 |   307.922 -93.82636  224.9349  84.74582    234.62  276.8175
    2002 |  327.1086 -127.1191   202.394  86.28373  243.6326  300.1306
    2003 |  267.7395 -189.5099  127.8929  80.99077  236.6432  292.9693
    2004 |  252.9841 -174.3506  161.2485  79.18471  256.4392  291.4369
    2005 |  516.2215 -171.1869  186.8241  81.43784   276.636  301.6713
    2006 |  333.6266 -167.7112  187.9891  78.13151  278.4689  310.0295
    2007 |   298.795 -193.2788  189.4678  79.31033  304.1043  320.1425
    2008 |   302.928 -221.0864  202.0866  82.26403  342.1242  363.7009
    2009 |  245.0582 -240.6996  131.7139  79.33488  293.8771  366.1241
---------+------------------------------------------------------------
   Total |  308.5509 -115.1539  201.4859  78.67868  238.3831  289.3984
----------------------------------------------------------------------

    year |  mkt~1_ha  dirpay~a  isofff~y      is65
---------+----------------------------------------
    1994 |  256.3154  301.6656  .2040442  .1762527
    1995 |  218.5925  294.5681  .3344432  .2306683
    1996 |   164.602  315.6163  .3952036   .208632
    1997 |  197.6038  283.1343  .3962453  .2727725
    1998 |  161.9605  348.4407  .4317637  .2655145
    1999 |  90.23399  305.0478  .4293079  .2796477
    2000 |  131.5302  377.0743  .4489148  .2668453
    2001 |  140.1891  401.7483  .4421694  .2426138
    2002 |  116.1103  454.2278  .4653668   .241757
    2003 |  46.90216  457.2494  .4646725  .2030167
    2004 |  82.06379  427.3347  .4759438  .2397571
    2005 |  105.3862  687.4084  .4922217  .2378273
    2006 |  109.8576  501.3378  .5040174  .2425336
    2007 |  110.1575  492.0738  .4737209  .2636728
    2008 |  119.8225  524.0144   .457998  .2882556
    2009 |  52.37905  485.7578  .4146199  .2862251
---------+----------------------------------------
   Total |  122.8072  423.7048   .441276  .2510712
--------------------------------------------------

. 
. 
. *Table 8
. tabstat  ffiperhectare marketffi_ha mkt_fcgm_ha prod_fc_ha oth_fc_ha
>   farmdc_ha mkt_fcgm1_ha  dirpayts_ha isofffarmy is65 if (system >= 
> 2 & system <=3) & ncattle > 0 & fsizesu >= 2 & droporig == 0 & (syst
> em == 2 | system == 3) & cpagecat != 0 [weight = wt], by(mkt_fcgm1_q
> 2008) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: mkt_fcgm1_q2008 (5 quantiles of mkt_fcgm1_ha )

mkt_fcgm1_q2008 |  ffiper~e  mar~i_ha  ~fcgm_ha  prod_f~a  oth_fc~a
----------------+--------------------------------------------------
              1 |  52.73278  -464.272 -39.51139  98.96507  330.1886
              2 |  174.5071 -297.5556  88.69214  78.59309  309.2043
              3 |  277.0659 -234.8449  173.5467  79.18869   329.203
              4 |  367.4347 -139.2576  251.9087  63.79415  327.3722
              5 |  618.8138  22.05721  511.8746  86.46288  403.3545
----------------+--------------------------------------------------
          Total |   302.928 -221.0864  202.0866  82.26403  342.1242
-------------------------------------------------------------------

mkt_fcgm1_q2008 |  farmdc~a  mkt~1_ha  dirpay~a  isofff~y      is65
----------------+--------------------------------------------------
              1 |  415.3985 -138.4765  517.0048  .3986066  .3098621
              2 |  307.2676  10.09905  472.0627  .5101905  .2479302
              3 |  317.1137  94.35801  511.9108  .4669626  .3530282
              4 |  320.7959  188.1146  506.6923  .4718806  .2598815
              5 |  436.2692  425.4117  596.7566  .4545512  .2600216
----------------+--------------------------------------------------
          Total |  363.7009  119.8225  524.0144   .457998  .2882556
-------------------------------------------------------------------

. tabstat  ffiperhectare marketffi_ha mkt_fcgm_ha prod_fc_ha oth_fc_ha
>   farmdc_ha mkt_fcgm1_ha  dirpayts_ha isofffarmy is65 if (system >= 
> 2 & system <=3) & ncattle > 0 & fsizesu >= 2 & droporig == 0 & (syst
> em == 2 | system == 3) & cpagecat != 0 [weight = wt], by(mkt_fcgm1_q
> 2004) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: mkt_fcgm1_q2004 (5 quantiles of mkt_fcgm1_ha )

mkt_fcgm1_q2004 |  ffiper~e  mar~i_ha  ~fcgm_ha  prod_f~a  oth_fc~a
----------------+--------------------------------------------------
              1 |  -25.0768 -499.6933  -124.037  99.77061  275.8856
              2 |  158.0698 -268.7713  70.04137  77.12726  261.8273
              3 |   240.823 -135.9808  129.5331  63.56397    201.95
              4 |   379.809  -45.5167  238.5573   70.0859  213.9882
              5 |  530.4795   107.638  502.8334  80.13949   315.056
----------------+--------------------------------------------------
          Total |  252.9841 -174.3506  161.2485  79.18471  256.4392
-------------------------------------------------------------------

mkt_fcgm1_q2004 |  farmdc~a  mkt~1_ha  dirpay~a  isofff~y      is65
----------------+--------------------------------------------------
              1 |  380.6391 -223.8076  474.6165  .5783091  .2151846
              2 |  250.2576 -7.085896  426.8411  .5588836  .2255878
              3 |  224.6856  65.96916  376.8038    .43619  .2690953
              4 |  270.7995  168.4714  425.3257  .4352004  .2000005
              5 |  304.6613  422.6939  422.8415  .3688374  .2857689
----------------+--------------------------------------------------
          Total |  291.4369  82.06379  427.3347  .4759438  .2397571
-------------------------------------------------------------------

. 
. 
. * Cost Structure
. tabstat  ffiperhectare marketffi_ha mkt_fcgm_ha prod_fc_ha oth_fc_ha
>   farmdc_ha mkt_fcgm1_ha  dirpayts_ha isofffarmy is65 if (system >= 
> 2 & system <=3) & ncattle > 0 & fsizesu >= 2 & droporig == 0 & (syst
> em == 2 | system == 3) & cpagecat != 0 & mkt_fcgm1_q == 1 [weight = 
> wt], by(year) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  ffiper~e  mar~i_ha  ~fcgm_ha  prod_f~a  oth_fc~a  farmdc~a
---------+------------------------------------------------------------
    1994 |   131.758  -107.774  66.27576   86.6008  87.44906  184.2877
    1995 |  89.59445 -201.7585  53.82206  90.45362  165.1269  255.5605
    1996 |   73.6074 -227.7696  39.65315  86.33576  181.0869  289.2791
    1997 |  153.4691 -190.5282  37.08596  80.82543  146.7886  245.7348
    1998 |  117.3364 -248.9616  29.04884  107.2535   170.757  251.4736
    1999 |  -11.0418 -337.0413 -56.44857  112.0758  171.4956  290.9765
    2000 |  17.83462 -384.7888  -23.3505  121.6954  240.5197  328.2811
    2001 |  38.12163 -335.9672 -18.49576  104.7648   215.856  277.7481
    2002 |  71.05132 -407.9842 -78.80834  105.9567  223.9913  355.2641
    2003 |  60.35498 -471.7738 -131.2013  102.5355   238.037  367.6444
    2004 |  -25.0768 -499.6933  -124.037  99.77061  275.8856  380.6391
    2005 |   297.369 -432.8885  -46.3397   100.502  286.0467  385.6502
    2006 |  184.7557 -389.7871 -50.26899  100.6635  242.5749  380.0399
    2007 |  64.62578 -416.3377 -60.18042  89.81567  267.7217   357.932
    2008 |  52.73278  -464.272 -39.51139  98.96507  330.1886  415.3985
    2009 |  26.02878 -460.2154 -105.2677  89.96727  266.2159  388.6822
---------+------------------------------------------------------------
   Total |  80.07051 -371.4924 -42.47909  99.66769  230.6146  334.5626
----------------------------------------------------------------------

    year |  mkt~1_ha  dirpay~a  isofff~y      is65
---------+----------------------------------------
    1994 | -20.32504   239.532  .2978013  .0635494
    1995 | -36.63156  291.3529   .372933  .3204732
    1996 | -46.68261  301.3769  .5568598  .1890283
    1997 | -43.73947  343.9973   .545396  .2047016
    1998 | -78.20463  366.2981  .4631336  .2152063
    1999 | -168.5244  325.9995  .3944236  .3433096
    2000 | -145.0459  402.6234  .4219482  .2613575
    2001 | -123.2606  374.0888  .3403138  .2642674
    2002 |  -184.765  479.0355  .4454336  .2309097
    2003 | -233.7368  532.1288  .5124982  .2085168
    2004 | -223.8076  474.6165  .5783091  .2151846
    2005 | -146.8417  730.2575  .4655895   .297855
    2006 | -150.9324  574.5428  .4911644  .3329944
    2007 | -149.9961  480.9635  .5674694  .2505432
    2008 | -138.4765  517.0048  .3986066  .3098621
    2009 |  -195.235  486.2442  .4589085  .2615569
---------+----------------------------------------
   Total | -142.1468  451.5629  .4706735  .2562942
--------------------------------------------------

. tabstat  ffiperhectare marketffi_ha mkt_fcgm_ha prod_fc_ha oth_fc_ha
>   farmdc_ha mkt_fcgm1_ha  dirpayts_ha isofffarmy is65 if (system >= 
> 2 & system <=3) & ncattle > 0 & fsizesu >= 2 & droporig == 0 & (syst
> em == 2 | system == 3) & cpagecat != 0 & mkt_fcgm1_q == 5 [weight = 
> wt], by(year) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: year 

    year |  ffiper~e  mar~i_ha  ~fcgm_ha  prod_f~a  oth_fc~a  farmdc~a
---------+------------------------------------------------------------
    1994 |  569.9221   305.223  669.5695  102.3406  262.0059  365.5129
    1995 |  503.6069   206.215  554.3312    76.075  272.0413   324.228
    1996 |  538.2718  187.2737  491.4343  72.03183  232.1505  273.3144
    1997 |   513.578  239.2291  507.5972  58.24619  210.1218  255.3825
    1998 |  584.6953  234.8744  552.1386   75.6289  241.6353  278.8854
    1999 |  425.4651  121.9946  439.1299   70.9625  246.1728  298.1799
    2000 |  564.1481  140.1551  520.9501  74.63846  306.1566  335.7496
    2001 |  659.4756  200.2867  594.7945   93.4904  301.0173  331.3292
    2002 |  648.1108  143.4935  643.0018   108.982  390.5262  365.6465
    2003 |  521.9665  83.49377  427.5921   75.3723  269.0218  279.3445
    2004 |  530.4795   107.638  502.8334  80.13949   315.056  304.6613
    2005 |  795.2177  37.08891  490.8373  82.16771  371.5806  320.5843
    2006 |  628.2703  80.45032  557.0191  90.83886  385.7299  336.1865
    2007 |   534.009 -13.38992  507.0495  82.10116  440.0903  397.5996
    2008 |  618.8138  22.05721  511.8746  86.46288  403.3545  436.2692
    2009 |   555.422  5.618274  445.8514  82.44715  357.7859   409.283
---------+------------------------------------------------------------
   Total |  573.7782  125.3709  517.9983  80.66495  312.0866  328.3677
----------------------------------------------------------------------

    year |  mkt~1_ha  dirpay~a  isofff~y      is65
---------+----------------------------------------
    1994 |  567.2288  264.6992  .0716624  .0615012
    1995 |  478.2562  297.3919    .41626  .1566364
    1996 |  419.4024  350.9981  .3543344  .1146426
    1997 |   449.351  274.3489  .3527596  .2615695
    1998 |  476.5097  349.8208  .4389899   .206004
    1999 |  368.1674  303.4704  .3987394  .2647564
    2000 |  446.3117   423.993  .4022211  .2618026
    2001 |  501.3041  459.1889  .3546235  .2973292
    2002 |  534.0198  504.6172  .5128275  .2567528
    2003 |  352.2198  438.4727  .4556619  .2060615
    2004 |  422.6939  422.8415  .3688374  .2857689
    2005 |  408.6696  758.1288  .3585478  .2163291
    2006 |  466.1802    547.82  .3886935   .226641
    2007 |  424.9483   547.399  .4635253  .2403956
    2008 |  425.4117  596.7566  .4545512  .2600216
    2009 |  363.4042  549.8037  .3464085  .3026637
---------+----------------------------------------
   Total |  437.3333  448.4074  .3993184  .2382424
--------------------------------------------------

. 
. 
. * Incorporating Labour
. 
. scalar sc_agewage_1996 = 9705

. scalar sc_agewage_1997 = 10047

. scalar sc_agewage_1998 = 10278

. scalar sc_agewage_1999 = 10642

. scalar sc_agewage_2000 = 11437

. scalar sc_agewage_2001 = 12481

. scalar sc_agewage_2002 = 13208

. scalar sc_agewage_2003 = 13802

. scalar sc_agewage_2004 = 14196

. scalar sc_agewage_2005 = 15513

. scalar sc_agewage_2006 = 16062

. scalar sc_agewage_2007 = 17339

. scalar sc_agewage_2008 = 17339*1.02

. scalar sc_agewage_2009 = 17339

. 
. 
. 
. gen ave_Wage = (sc_agewage_1996)*(year == 1996) + (sc_agewage_1997)*
> (year == 1997) + (sc_agewage_1998)*(year == 1998) + (sc_agewage_1999
> )*(year == 1999) + (sc_agewage_2000)*(year == 2000) + (sc_agewage_20
> 01)*(year == 2001) + (sc_agewage_2002)*(year == 2002) + (sc_agewage_
> 2003)*(year == 2003) + (sc_agewage_2004)*(year == 2004) + (sc_agewag
> e_2005)*(year == 2005) + (sc_agewage_2006)*(year == 2006) + (sc_agew
> age_2007)*(year == 2007) + (sc_agewage_2008)*(year == 2008) + (sc_ag
> ewage_2009)*(year == 2009)

. gen wage_cost = flabunpd*ave_Wage
(52 missing values generated)

. 
. gen wage_cost2_ha = wage_cost/fsizuaa
(60 missing values generated)

. gen wage_cost3_ha = (ave_Wage*flabsmds/(48*5))/fsizuaa
(60 missing values generated)

. 
. gen farmgo_ha = farmgo/fsizuaa
(60 missing values generated)

. capture gen farmdc_ha = farmdc/fsizuaa

. 
. tab cpagecat if cpagecat > 0, gen(cpagecat)

   cpagecat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,206       12.64       12.64
          2 |      5,083       29.14       41.78
          3 |      3,321       19.04       60.82
          4 |        586        3.36       64.18
          5 |        894        5.12       69.30
          6 |        963        5.52       74.82
          7 |      1,096        6.28       81.10
          8 |        218        1.25       82.35
          9 |      3,079       17.65      100.00
------------+-----------------------------------
      Total |     17,446      100.00

. 
. gen mkt_fcgm2_ha = mkt_fcgm1_ha - wage_cost2_ha
(60 missing values generated)

. gen mkt_fcgm3_ha = mkt_fcgm1_ha - wage_cost3_ha
(60 missing values generated)

. gen marketffi3_ha = marketffi_ha - wage_cost3_ha
(60 missing values generated)

. gen ffi3_ha = ffiperhectare - wage_cost3_ha
(60 missing values generated)

. * Table 14
. tabstat  mkt_fcgm1_ha  mkt_fcgm3_ha marketffi3_ha wage_cost3_ha  if 
> (system >= 2 & system <=3) & ncattle > 0 & fsizesu >= 2 & droporig =
> = 0 & (system == 2 | system == 3) & cpagecat != 0 & year == 2008 [we
> ight = wt], by(mkt_fcgm1_q) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: mkt_fcgm1_q 

mkt_fcgm1_q |  mkt~1_ha  mkt~3_ha  mar~3_ha  wag~3_ha
------------+----------------------------------------
          1 | -138.4765 -400.8123 -726.6078  262.3359
          2 |  10.09905 -228.0357 -535.6904  238.1348
          3 |  94.35801 -177.4143 -506.6173  271.7723
          4 |  188.1146 -66.03853 -393.4107  254.1531
          5 |  425.4117  82.57597 -320.7785  342.8357
------------+----------------------------------------
      Total |  119.8225 -156.7903 -497.6992  276.6129
-----------------------------------------------------

. 
. gen pos_marketffi3_ha = marketffi3_ha > 0 & marketffi3_ha != .

. gen pos_mkt_fcgm1_ha = mkt_fcgm1_ha > 0 & mkt_fcgm1_ha != .

. * Table 15
. tabstat  isofffarmy is65 flabunpd fnocatlu co_stock fsizuaa region1-
> region8 if (system >= 2 & system <=3) & ncattle > 0 & fsizesu >= 2 &
>  droporig == 0 & (system == 2 | system == 3) & cpagecat != 0 & year 
> == 2008 [weight = wt], by(mkt_fcgm1_q) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: mkt_fcgm1_q 

mkt_fcgm1_q |  isofff~y      is65  flabunpd  fnocatlu  co_stock
------------+--------------------------------------------------
          1 |  .3986066  .3098621   .886738  28.41053  1.231304
          2 |  .5101905  .2479302   .954068  28.11637   1.09894
          3 |  .4669626  .3530282  .9316411  30.03939  1.227766
          4 |  .4718806  .2598815  .9625795  41.36015  1.258959
          5 |  .4545512  .2600216  .9359746  42.26765  1.598352
------------+--------------------------------------------------
      Total |   .457998  .2882556   .932322  34.05567  1.293998
---------------------------------------------------------------

mkt_fcgm1_q |   fsizuaa   region1   region2   region3   region4
------------+--------------------------------------------------
          1 |  26.61624  .3020526         0  .0744421  .0862792
          2 |   30.9846  .1197111  .0054703  .0342145  .0849552
          3 |  29.32761  .2349075         0   .120738  .0648429
          4 |  37.00113  .1745756  .0050823  .0466858  .1583385
          5 |  30.21548  .0484066  .0108021  .0863276  .2683347
------------+--------------------------------------------------
      Total |  30.57459  .1768776  .0042607  .0749739  .1347116
---------------------------------------------------------------

mkt_fcgm1_q |   region5   region6   region7   region8
------------+----------------------------------------
          1 |  .1133944  .0283975  .1974262  .1980081
          2 |  .1112051  .1086666  .2034062   .332371
          3 |  .0420639  .0141654  .1518511  .3714312
          4 |  .1040268  .0849534  .2244506   .201887
          5 |  .0956674  .1545094  .1689186  .1670335
------------+----------------------------------------
      Total |  .0923126  .0775303  .1871795  .2521537
-----------------------------------------------------

. 
. * other variables
. tabstat pos_marketffi3_ha pos_mkt_fcgm1_ha 

   stats |  pos_ma~a  pos_mk~a
---------+--------------------
    mean |  .2685304  .8560947
------------------------------

. *Table 9
. local cattle1_vlist = "cpavnocw cpavno06 cpavno61 cpavno12 cpavno2p"

. foreach var in `cattle1_vlist' {
  2. 
.         tab mtmarketffi_q2004 if ncattle > 0 & fsizesu >= 2 & dropor
> ig == 0 & (system == 2 | system == 3) & cpagecat != 0 & year == 2004
>  & is2004 == 1 & is2009 == 1 [weight = wt], sum(`var'_d)
  3.         tab mtmarketffi_q2004 if ncattle > 0 & fsizesu >= 2 & dro
> porig == 0 & (system == 2 | system == 3) & cpagecat != 0 & year == 2
> 004 & is2004 == 1 & is2009 == 1 [weight = wt], sum(`var')
  4. 
. 
. }

mtmarketffi |              Summary of cpavnocw_d
     _q2004 |        Mean   Std. Dev.       Freq.        Obs.
------------+------------------------------------------------
          1 |   .10219718   6.9246194   8199.8912          57
          2 |  -.78407391   7.2046245   6870.4651          67
          3 |   .30564195   8.4587131   6904.8029          65
          4 |  -.78999898   6.5940457   5495.7689          55
          5 |   .06609202   10.120704   5729.7262          49
------------+------------------------------------------------
      Total |  -.19281282   7.8534773   33200.654         293

mtmarketffi |               Summary of cpavnocw
     _q2004 |        Mean   Std. Dev.       Freq.        Obs.
------------+------------------------------------------------
          1 |   7.3597842   9.5581098   8199.8912          57
          2 |   15.216172   17.744348   6870.4651          67
          3 |   14.416622   12.254017   6904.8029          65
          4 |   18.237996   13.319572   5495.7689          55
          5 |   16.832599   14.696106   5729.7262          49
------------+------------------------------------------------
      Total |   13.888688   14.096159   33200.654         293

mtmarketffi |              Summary of cpavno06_d
     _q2004 |        Mean   Std. Dev.       Freq.        Obs.
------------+------------------------------------------------
          1 |  -.02422827   2.8592799   8199.8912          57
          2 |  -1.2514192   7.8864798   6870.4651          67
          3 |  -.46829415   3.8641927   6904.8029          65
          4 |   -.8938518   5.3287727   5495.7689          55
          5 |  -.46528918   6.4099592   5729.7262          49
------------+------------------------------------------------
      Total |  -.59060168   5.4380851   33200.654         293

mtmarketffi |               Summary of cpavno06
     _q2004 |        Mean   Std. Dev.       Freq.        Obs.
------------+------------------------------------------------
          1 |   3.9159844   5.7048889   8199.8912          57
          2 |   8.3267362   10.726888   6870.4651          67
          3 |   7.9239973   6.5518219   6904.8029          65
          4 |   10.075246   8.0583697   5495.7689          55
          5 |   9.3276752   8.8011771   5729.7262          49
------------+------------------------------------------------
      Total |   7.6157862    8.309044   33200.654         293

mtmarketffi |              Summary of cpavno61_d
     _q2004 |        Mean   Std. Dev.       Freq.        Obs.
------------+------------------------------------------------
          1 |  -1.0689286   5.4534876   8199.8912          57
          2 |  -1.9076861   7.5332914   6870.4651          67
          3 |  -2.4264674   11.534889   6904.8029          65
          4 |  -.30236469   5.2201184   5495.7689          55
          5 |   .24733519   7.2208141   5729.7262          49
------------+------------------------------------------------
      Total |  -1.1707791   7.7714143   33200.654         293

mtmarketffi |               Summary of cpavno61
     _q2004 |        Mean   Std. Dev.       Freq.        Obs.
------------+------------------------------------------------
          1 |   6.6769869   8.7682148   8199.8912          57
          2 |    9.975854   9.8197192   6870.4651          67
          3 |   11.782522   18.372776   6904.8029          65
          4 |   8.9973483    8.417305   5495.7689          55
          5 |   9.3336608   8.9979657   5729.7262          49
------------+------------------------------------------------
      Total |   9.2640338   11.670089   33200.654         293

mtmarketffi |              Summary of cpavno12_d
     _q2004 |        Mean   Std. Dev.       Freq.        Obs.
------------+------------------------------------------------
          1 |  -.73408028   10.454871   8199.8912          57
          2 |  -1.2334953   10.587958   6870.4651          67
          3 |   .14868941   13.665134   6904.8029          65
          4 |   .58913523   5.8888789   5495.7689          55
          5 |   1.9244678   10.418648   5729.7262          49
------------+------------------------------------------------
      Total |   .02400648   10.636483   33200.654         293

mtmarketffi |               Summary of cpavno12
     _q2004 |        Mean   Std. Dev.       Freq.        Obs.
------------+------------------------------------------------
          1 |   15.316878    17.62499   8199.8912          57
          2 |   17.474708   21.377508   6870.4651          67
          3 |   16.597849   18.772919   6904.8029          65
          4 |    11.73033   13.712568   5495.7689          55
          5 |   13.485877   15.474613   5729.7262          49
------------+------------------------------------------------
      Total |    15.12014   17.798841   33200.654         293

mtmarketffi |              Summary of cpavno2p_d
     _q2004 |        Mean   Std. Dev.       Freq.        Obs.
------------+------------------------------------------------
          1 |  -.12620543   7.7932197   8199.8912          57
          2 |   1.4638732   6.9570657   6870.4651          67
          3 |   .81220115   6.9809233   6904.8029          65
          4 |   .30223804   4.8959768   5495.7689          55
          5 |    .7282232   7.6669342   5729.7262          49
------------+------------------------------------------------
      Total |   .61638115    6.992428   33200.654         293

mtmarketffi |               Summary of cpavno2p
     _q2004 |        Mean   Std. Dev.       Freq.        Obs.
------------+------------------------------------------------
          1 |   6.1326445    11.25459   8199.8912          57
          2 |   5.4078814   12.461093   6870.4651          67
          3 |   4.5336158   8.6045375   6904.8029          65
          4 |   2.8283415   5.0827203   5495.7689          55
          5 |   3.0573924   7.9507331   5729.7262          49
------------+------------------------------------------------
      Total |   4.5724199   9.7161018   33200.654         293

. 
. 
. local cattle1_vlist = "cpavno012 cpavn1224"

. foreach var in `cattle1_vlist' {
  2. 
.         tab mtmarketffi_q2004 if ncattle > 0 & fsizesu >= 2 & dropor
> ig == 0 & (system == 2 | system == 3) & cpagecat != 0 & year == 2004
>  & is2004 == 1 & is2009 == 1 [weight = wt], sum(`var'_d)
  3.         tab mtmarketffi_q2004 if ncattle > 0 & fsizesu >= 2 & dro
> porig == 0 & (system == 2 | system == 3) & cpagecat != 0 & year == 2
> 004 & is2004 == 1 & is2009 == 1 [weight = wt], sum(`var')
  4. 
. 
. }

mtmarketffi |             Summary of cpavno012_d
     _q2004 |        Mean   Std. Dev.       Freq.        Obs.
------------+------------------------------------------------
          1 |  -1.0931568   6.3118308   8199.8912          57
          2 |  -3.1591054   11.558886   6870.4651          67
          3 |  -2.8947615   11.500519   6904.8029          65
          4 |  -1.1962164   7.4655688   5495.7689          55
          5 |  -.21795378   12.574468   5729.7262          49
------------+------------------------------------------------
      Total |  -1.7613807    10.06811   33200.654         293

mtmarketffi |              Summary of cpavno012
     _q2004 |        Mean   Std. Dev.       Freq.        Obs.
------------+------------------------------------------------
          1 |   10.592971   12.543144   8199.8912          57
          2 |    18.30259   17.079794   6870.4651          67
          3 |    19.70652   21.170809   6904.8029          65
          4 |   19.072594    15.75362   5495.7689          55
          5 |   18.661336   16.718417   5729.7262          49
------------+------------------------------------------------
      Total |    16.87982   17.064243   33200.654         293

mtmarketffi |             Summary of cpavn1224_d
     _q2004 |        Mean   Std. Dev.       Freq.        Obs.
------------+------------------------------------------------
          1 |  -.86028585   11.911964   8199.8912          57
          2 |   .23037807   11.345891   6870.4651          67
          3 |   .96089049    15.30103   6904.8029          65
          4 |   .89137326   7.7874976   5495.7689          55
          5 |    2.652691   15.344251   5729.7262          49
------------+------------------------------------------------
      Total |   .64038762   12.654697   33200.654         293

mtmarketffi |              Summary of cpavn1224
     _q2004 |        Mean   Std. Dev.       Freq.        Obs.
------------+------------------------------------------------
          1 |   21.449522   24.474163   8199.8912          57
          2 |   22.882589   32.643819   6870.4651          67
          3 |   21.131465   24.643279   6904.8029          65
          4 |   14.558671   17.852184   5495.7689          55
          5 |    16.54327   19.421728   5729.7262          49
------------+------------------------------------------------
      Total |    19.69256   24.778157   33200.654         293

. 
. 
. 
end of do-file

. pwd
D:\pglocal

. doedit NFSPanelCreate09

. log close
       log:  d:\pglocal\data\data_NFSPanelAnalysis\OutData\dychap\Beef
> Analysis.log
  log type:  text
 closed on:  18 Jul 2011, 17:37:39
----------------------------------------------------------------------
