-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/patrickgillespie/Documents/lin_forpatrick/Task 4/Data_Analysis/analysis/logs/resul
> ts/29_May_2012_19_42_01.log
  log type:  text
 opened on:  29 May 2012, 19:42:01

. 
. xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.
> year year#mscode if country!="DAN", fe
--Break--
r(1);

end of do-file
--Break--
r(1);

end of do-file

--Break--
r(1);

. xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.
> year year#mscode if oilseedrapeuaa>0, fe
note: 2007.year omitted because of collinearity
note: 1999b.year#10.mscode omitted because of collinearity
note: 1999b.year#14.mscode omitted because of collinearity
note: 2000.year#2.mscode omitted because of collinearity
note: 2000.year#9.mscode omitted because of collinearity
note: 2001.year#13.mscode omitted because of collinearity
note: 2002.year#6.mscode omitted because of collinearity
note: 2002.year#12.mscode omitted because of collinearity
note: 2003.year#9.mscode omitted because of collinearity
note: 2006.year#4.mscode omitted because of collinearity
note: 2007.year#3.mscode omitted because of collinearity
note: 2007.year#5.mscode omitted because of collinearity
note: 2007.year#7.mscode omitted because of collinearity
note: 2007.year#8.mscode omitted because of collinearity
note: 2007.year#11.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     33248
Group variable: pid                             Number of groups   =      6217

R-sq:  within  = 0.0816                         Obs per group: min =         1
       between = 0.0722                                        avg =       5.3
       overall = 0.0601                                        max =         9

                                                F(116,26915)       =     20.61
corr(u_i, Xb)  = -0.4985                        Prob > F           =    0.0000

------------------------------------------------------------------------------
oilseedrap~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |   27.43483   19.13709     1.43   0.152    -10.07487    64.94453
   sizeclass |   2.587263   .3259589     7.94   0.000     1.948367     3.22616
 setasideuaa |  -.3352784    .009582   -34.99   0.000    -.3540596   -.3164971
   ln_labour |   1.551531   .5151359     3.01   0.003     .5418381    2.561225
      ln_ffi |  -.0448954   .0352935    -1.27   0.203    -.1140725    .0242817
    solvency |   .1405585   .6949419     0.20   0.840    -1.221564    1.502681
   intensity |  -3.610782   3.245538    -1.11   0.266    -9.972206    2.750643
  specialise |   5.724693   1.076441     5.32   0.000     3.614812    7.834573
             |
        year |
       2000  |  -5.554238   2.284648    -2.43   0.015    -10.03227   -1.076209
       2001  |  -5.935679   2.274479    -2.61   0.009    -10.39378   -1.477582
       2002  |  -5.034324   2.237328    -2.25   0.024    -9.419603   -.6490448
       2003  |  -2.104905   2.181478    -0.96   0.335    -6.380715    2.170905
       2004  |  -26.44711   19.05229    -1.39   0.165    -63.79059    10.89637
       2005  |  -28.50394   19.09037    -1.49   0.135    -65.92205    8.914181
       2006  |   -26.4861   19.05264    -1.39   0.164    -63.83026    10.85806
       2007  |  (omitted)
             |
 year#mscode |
    1999  2  |   .9591268   2.397548     0.40   0.689    -3.740192    5.658446
    1999  3  |    31.0473   19.50507     1.59   0.111     -7.18365    69.27825
    1999  4  |   4.592669   2.708933     1.70   0.090    -.7169798    9.902318
    1999  5  |    25.6897   19.15117     1.34   0.180     -11.8476    63.22699
    1999  6  |  -3.855195   14.13729    -0.27   0.785    -31.56501    23.85463
    1999  7  |   31.05811   19.34803     1.61   0.108    -6.865046    68.98126
    1999  8  |   26.38963   19.76529     1.34   0.182    -12.35137    65.13063
    1999  9  |  -5.553468    12.8916    -0.43   0.667    -30.82167    19.71473
    1999 10  |  (omitted)
    1999 11  |   27.51045   20.46349     1.34   0.179    -12.59906    67.61996
    1999 12  |  -6.160991   3.694848    -1.67   0.095    -13.40309    1.081103
    1999 13  |  -5.507832   3.401196    -1.62   0.105    -12.17435    1.158689
    1999 14  |  (omitted)
    2000  2  |  (omitted)
    2000  3  |   34.91642   19.50547     1.79   0.073    -3.315327    73.14817
    2000  4  |   8.429256   2.668062     3.16   0.002     3.199715     13.6588
    2000  5  |   28.61116    19.1418     1.49   0.135     -8.90776    66.13009
    2000  6  |   1.923492   15.32399     0.13   0.900    -28.11232    31.95931
    2000  7  |   33.23275   19.33544     1.72   0.086    -4.665728    71.13122
    2000  8  |   30.61247   19.73911     1.55   0.121    -8.077221    69.30217
    2000  9  |  (omitted)
    2000 10  |   4.831722   2.667249     1.81   0.070    -.3962261    10.05967
    2000 11  |   36.69903     20.402     1.80   0.072    -3.289945    76.68801
    2000 12  |  -.3881213   3.619157    -0.11   0.915    -7.481858    6.705615
    2000 13  |   .2693849   3.440576     0.08   0.938    -6.474323    7.013092
    2000 14  |  -4.838464   6.090987    -0.79   0.427    -16.77712    7.100189
    2001  2  |    1.13583   2.286586     0.50   0.619    -3.345997    5.617657
    2001  3  |   33.86845   19.47841     1.74   0.082     -4.31025    72.04715
    2001  4  |   11.41817    2.51209     4.55   0.000      6.49434    16.34199
    2001  5  |   28.55028   19.12371     1.49   0.135    -8.933179    66.03374
    2001  6  |  -1.076745   17.02101    -0.06   0.950    -34.43882    32.28533
    2001  7  |   33.08032   19.30031     1.71   0.087    -4.749291    70.90992
    2001  8  |   32.71183   19.63915     1.67   0.096    -5.781938     71.2056
    2001  9  |  (empty)  
    2001 10  |   5.402841   2.644161     2.04   0.041     .2201473    10.58553
    2001 11  |   38.73117   20.40942     1.90   0.058    -1.272365     78.7347
    2001 12  |   .5424189   3.493291     0.16   0.877    -6.304613    7.389451
    2001 13  |  (omitted)
    2001 14  |  -14.70764   5.253713    -2.80   0.005    -25.00519   -4.410086
    2002  2  |   3.425961   2.255199     1.52   0.129     -.994347     7.84627
    2002  3  |   31.24361   19.43876     1.61   0.108    -6.857374     69.3446
    2002  4  |   9.456647   2.466911     3.83   0.000     4.621373    14.29192
    2002  5  |   25.76511   19.11056     1.35   0.178    -11.69259    63.22281
    2002  6  |  (omitted)
    2002  7  |   29.31178   19.29655     1.52   0.129    -8.510461    67.13403
    2002  8  |   29.25313    19.5691     1.49   0.135    -9.103332    67.60958
    2002  9  |  (empty)  
    2002 10  |   4.889182    2.62964     1.86   0.063    -.2650501    10.04341
    2002 11  |   35.82004   20.54592     1.74   0.081     -4.45103    76.09111
    2002 12  |  (omitted)
    2002 13  |   1.243967   3.136798     0.40   0.692     -4.90432    7.392254
    2002 14  |  -22.53628   5.242169    -4.30   0.000     -32.8112   -12.26135
    2003  2  |   1.873734   2.207828     0.85   0.396    -2.453724    6.201192
    2003  3  |   30.05716   19.50997     1.54   0.123    -8.183391    68.29772
    2003  4  |   6.287261   2.410771     2.61   0.009     1.562023     11.0125
    2003  5  |   24.50096   19.10331     1.28   0.200    -12.94252    61.94444
    2003  6  |  -2.620026   14.56701    -0.18   0.857    -31.17212    25.93207
    2003  7  |   19.50894    19.3589     1.01   0.314    -18.43553     57.4534
    2003  8  |   27.30095   19.54104     1.40   0.162    -11.00051    65.60242
    2003  9  |  (omitted)
    2003 10  |   2.290796   2.593531     0.88   0.377    -2.792659    7.374251
    2003 11  |    32.7183   20.49362     1.60   0.110    -7.450267    72.88687
    2003 12  |  -.7172374   3.343274    -0.21   0.830    -7.270228    5.835753
    2003 13  |   -1.76535   3.192388    -0.55   0.580    -8.022598    4.491897
    2003 14  |  -17.15889   5.203692    -3.30   0.001    -27.35839   -6.959378
    2004  2  |   .1180404    2.16608     0.05   0.957     -4.12759    4.363671
    2004  3  |   26.29624   19.70716     1.33   0.182    -12.33082     64.9233
    2004  4  |   3.058428   2.352622     1.30   0.194    -1.552835     7.66969
    2004  5  |   20.84051   19.06321     1.09   0.274    -16.52436    58.20539
    2004  6  |  -6.465619   16.42706    -0.39   0.694    -38.66351    25.73227
    2004  7  |    22.8034   19.27714     1.18   0.237    -14.98079     60.5876
    2004  8  |   24.72226   19.44543     1.27   0.204    -13.39178    62.83631
    2004  9  |  -3.672626   18.86392    -0.19   0.846     -40.6469    33.30164
    2004 10  |  -.9683377   2.556109    -0.38   0.705    -5.978444    4.041769
    2004 11  |   27.88533   20.50755     1.36   0.174    -12.31054    68.08121
    2004 12  |    -3.8053   3.266271    -1.17   0.244    -10.20736    2.596762
    2004 13  |  -2.177298    3.09279    -0.70   0.481    -8.239327     3.88473
    2004 14  |  -20.47498   5.178339    -3.95   0.000    -30.62479   -10.32516
    2005  2  |   3.772599   2.192875     1.72   0.085    -.5255494    8.070748
    2005  3  |   25.92608   19.56665     1.33   0.185    -12.42557    64.27772
    2005  4  |   4.981627   2.410158     2.07   0.039      .257592    9.705662
    2005  5  |    25.0969   19.10095     1.31   0.189    -12.34196    62.53576
    2005  6  |  -2.296889    14.6253    -0.16   0.875    -30.96324    26.36946
    2005  7  |    25.8343   19.30553     1.34   0.181    -12.00553    63.67414
    2005  8  |   26.56667   19.55419     1.36   0.174    -11.76056     64.8939
    2005  9  |  -1.498832   19.35646    -0.08   0.938     -39.4385    36.44083
    2005 10  |     1.5625   2.567317     0.61   0.543    -3.469575    6.594574
    2005 11  |   30.56658   22.50442     1.36   0.174    -13.54325    74.67641
    2005 12  |  -.4384031   3.334745    -0.13   0.895    -6.974677    6.097871
    2005 13  |    1.30639   3.131633     0.42   0.677    -4.831774    7.444554
    2005 14  |  -11.28824   5.173996    -2.18   0.029    -21.42954   -1.146937
    2006  2  |   5.981378    2.23312     2.68   0.007     1.604347    10.35841
    2006  3  |   25.52909   19.36963     1.32   0.188    -12.43639    63.49457
    2006  4  |  (omitted)
    2006  5  |   24.41586   19.06339     1.28   0.200    -12.94938     61.7811
    2006  6  |   -5.46662    14.6542    -0.37   0.709    -34.18961    23.25637
    2006  7  |   33.44807   19.25562     1.74   0.082    -4.293942    71.19009
    2006  8  |   27.45339   19.50652     1.41   0.159    -10.78041    65.68719
    2006  9  |  -4.965927   19.19885    -0.26   0.796    -42.59668    32.66483
    2006 10  |   .9520045   2.594866     0.37   0.714    -4.134069    6.038078
    2006 11  |   16.25871   21.50517     0.76   0.450    -25.89254    58.40995
    2006 12  |  -.6279829   3.308142    -0.19   0.849    -7.112114    5.856149
    2006 13  |   .3006488   3.190488     0.09   0.925    -5.952873    6.554171
    2006 14  |  -13.78554   5.242181    -2.63   0.009    -24.06048   -3.510588
    2007  2  |  -29.41623   19.14076    -1.54   0.124    -66.93311    8.100646
    2007  3  |  (omitted)
    2007  4  |  -27.44477   19.13424    -1.43   0.151    -64.94887    10.05933
    2007  5  |  (omitted)
    2007  6  |  -29.96763   23.89307    -1.25   0.210     -76.7993    16.86403
    2007  7  |  (omitted)
    2007  8  |  (omitted)
    2007  9  |  -27.01691   27.01843    -1.00   0.317    -79.97444    25.94062
    2007 10  |  -26.61773   19.19051    -1.39   0.165    -64.23213    10.99666
    2007 11  |  (omitted)
    2007 12  |  -29.72043   19.30668    -1.54   0.124    -67.56253    8.121668
    2007 13  |  -25.54399   19.28659    -1.32   0.185     -63.3467    12.25873
    2007 14  |  -41.07297   19.72602    -2.08   0.037    -79.73699   -2.408948
             |
       _cons |  -10.95104   9.017794    -1.21   0.225    -28.62639    6.724307
-------------+----------------------------------------------------------------
     sigma_u |  58.899105
     sigma_e |  15.539021
         rho |  .93492605   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(6216, 26915) =    31.70         Prob > F = 0.0000

. 
. by pid: egen osr_min = min(oilseedrapeuaa)

. xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.
> year year#mscode if osr_min>0, fe
note: 2006.year omitted because of collinearity
note: 1999b.year#3.mscode omitted because of collinearity
note: 1999b.year#8.mscode omitted because of collinearity
note: 1999b.year#10.mscode omitted because of collinearity
note: 1999b.year#12.mscode omitted because of collinearity
note: 1999b.year#14.mscode omitted because of collinearity
note: 2000.year#5.mscode omitted because of collinearity
note: 2001.year#2.mscode omitted because of collinearity
note: 2001.year#13.mscode omitted because of collinearity
note: 2003.year#7.mscode omitted because of collinearity
note: 2007.year#3.mscode omitted because of collinearity
note: 2007.year#4.mscode omitted because of collinearity
note: 2007.year#11.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     22467
Group variable: pid                             Number of groups   =      3103

R-sq:  within  = 0.0942                         Obs per group: min =         2
       between = 0.1001                                        avg =       7.2
       overall = 0.0694                                        max =         9

                                                F(102,19262)       =     19.64
corr(u_i, Xb)  = -0.4576                        Prob > F           =    0.0000

------------------------------------------------------------------------------
oilseedrap~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |   .3897144   3.585328     0.11   0.913     -6.63784    7.417269
   sizeclass |   3.692042   .4845976     7.62   0.000     2.742188    4.641895
 setasideuaa |   -.362463   .0115007   -31.52   0.000    -.3850053   -.3399207
   ln_labour |   1.965627   .7022785     2.80   0.005     .5890996    3.342154
      ln_ffi |  -.1030463   .0466859    -2.21   0.027    -.1945546   -.0115379
    solvency |   .1765587   1.109585     0.16   0.874    -1.998324    2.351442
   intensity |  -3.880215   4.501347    -0.86   0.389    -12.70325    4.942816
  specialise |   8.398534   1.675474     5.01   0.000      5.11446    11.68261
             |
        year |
       2000  |  -5.683126   3.764618    -1.51   0.131    -13.06211    1.695854
       2001  |   -7.37714   3.592286    -2.05   0.040    -14.41833   -.3359464
       2002  |  -5.610992   3.525404    -1.59   0.111    -12.52109    1.299107
       2003  |   -2.94645   3.545027    -0.83   0.406    -9.895012    4.002111
       2004  |   1.515921   2.830424     0.54   0.592    -4.031956    7.063798
       2005  |  -1.699425   2.749912    -0.62   0.537    -7.089492    3.690642
       2006  |  (omitted)
       2007  |    3.80318   16.01812     0.24   0.812    -27.59374     35.2001
             |
 year#mscode |
    1999  2  |  -1.418876   3.703193    -0.38   0.702    -8.677458    5.839706
    1999  3  |  (omitted)
    1999  4  |   6.150175   15.89451     0.39   0.699    -25.00445     37.3048
    1999  5  |  -2.856701   3.857078    -0.74   0.459    -10.41691    4.703508
    1999  7  |   23.22836   6.508234     3.57   0.000     10.47166    35.98507
    1999  8  |  (omitted)
    1999 10  |  (omitted)
    1999 11  |    20.1098   21.12083     0.95   0.341    -21.28886    61.50846
    1999 12  |  (omitted)
    1999 13  |  -8.576177   6.465695    -1.33   0.185     -21.2495    4.097149
    1999 14  |  (omitted)
    2000  2  |  -2.413576   3.370852    -0.72   0.474     -9.02074    4.193588
    2000  3  |   6.895586   17.82057     0.39   0.699    -28.03429    41.82546
    2000  4  |   13.18236   16.32616     0.81   0.419    -18.81834    45.18306
    2000  5  |  (omitted)
    2000  7  |   24.03541   6.233245     3.86   0.000      11.8177    36.25311
    2000  8  |   4.809113   8.111179     0.59   0.553    -11.08951    20.70773
    2000 10  |   5.113845   4.183099     1.22   0.222    -3.085394    13.31308
    2000 11  |   27.64847   21.45167     1.29   0.197    -14.39868    69.69562
    2000 12  |   7.322147   6.476425     1.13   0.258    -5.372211     20.0165
    2000 13  |  -1.075912   6.314115    -0.17   0.865    -13.45213     11.3003
    2000 14  |  -30.17894   17.82635    -1.69   0.090    -65.12013     4.76226
    2001  2  |  (omitted)
    2001  3  |   9.375478   16.58103     0.57   0.572    -23.12478    41.87574
    2001  4  |   15.92294   16.27593     0.98   0.328     -15.9793    47.82518
    2001  5  |   1.008509   3.358863     0.30   0.764    -5.575156    7.592174
    2001  7  |    25.2403   6.013531     4.20   0.000     13.45325    37.02734
    2001  8  |   5.602816   8.088756     0.69   0.489    -10.25185    21.45748
    2001 10  |   7.068076   4.015361     1.76   0.078     -.802381    14.93853
    2001 11  |   33.05356    21.4218     1.54   0.123    -8.935022    75.04215
    2001 12  |   10.00402   6.343239     1.58   0.115    -2.429278    22.43732
    2001 13  |  (omitted)
    2001 14  |  -45.76791   13.75762    -3.33   0.001    -72.73405   -18.80178
    2002  2  |    1.68208   2.944523     0.57   0.568    -4.089442    7.453602
    2002  3  |    9.27195   17.40895     0.53   0.594     -24.8511      43.395
    2002  4  |   14.48147    16.2578     0.89   0.373    -17.38524    46.34818
    2002  5  |  -2.355312   3.295398    -0.71   0.475     -8.81458    4.103955
    2002  7  |   22.75039   5.703667     3.99   0.000      11.5707    33.93007
    2002  8  |   2.826268   7.575768     0.37   0.709     -12.0229    17.67543
    2002 10  |   5.536343   3.968305     1.40   0.163    -2.241881    13.31457
    2002 11  |   28.97981   22.75405     1.27   0.203     -15.6201    73.57973
    2002 12  |   7.060447   6.277148     1.12   0.261     -5.24331     19.3642
    2002 13  |   1.066076   5.993518     0.18   0.859    -10.68174    12.81389
    2002 14  |  -54.43043   13.72253    -3.97   0.000    -81.32779   -27.53307
    2003  2  |    .638127   2.983408     0.21   0.831    -5.209613    6.485867
    2003  3  |   11.40592   17.44997     0.65   0.513    -22.79755    45.60939
    2003  4  |   11.68141   16.26274     0.72   0.473    -20.19498     43.5578
    2003  5  |  -3.298145   3.314346    -1.00   0.320    -9.794552    3.198263
    2003  7  |  (omitted)
    2003  8  |   1.960646   7.543577     0.26   0.795    -12.82542    16.74671
    2003 10  |   3.246331    3.99491     0.81   0.416    -4.584041     11.0767
    2003 11  |   21.99118   22.75906     0.97   0.334    -22.61856    66.60092
    2003 12  |   8.819918   6.285989     1.40   0.161    -3.501169      21.141
    2003 13  |  -.6572677   6.013852    -0.11   0.913    -12.44494    11.13041
    2003 14  |  -49.02299    13.7197    -3.57   0.000     -75.9148   -22.13117
    2004  2  |  -2.475809   2.942927    -0.84   0.400    -8.244203    3.292586
    2004  3  |  -.4559367   17.39971    -0.03   0.979    -34.56089    33.64901
    2004  4  |   6.538653   16.25801     0.40   0.688    -25.32846    38.40576
    2004  5  |  -8.785635   3.274259    -2.68   0.007    -15.20347   -2.367802
    2004  7  |   4.189167   5.962268     0.70   0.482    -7.497399    15.87573
    2004  8  |   -2.55613    7.60285    -0.34   0.737    -17.45838    12.34612
    2004 10  |   -1.69493   3.941761    -0.43   0.667    -9.421125    6.031264
    2004 11  |   12.98788   21.40371     0.61   0.544    -28.96526    54.94102
    2004 12  |   3.158608    6.25873     0.50   0.614    -9.109049    15.42627
    2004 13  |  -5.537453    5.96019    -0.93   0.353    -17.21994    6.145039
    2004 14  |  -52.42482   13.70643    -3.82   0.000    -79.29061   -25.55902
    2005  2  |   2.431402   2.870849     0.85   0.397    -3.195712    8.058515
    2005  3  |   2.399435   17.38885     0.14   0.890    -31.68422    36.48309
    2005  4  |   7.788896   16.24559     0.48   0.632    -24.05388    39.63167
    2005  5  |  -3.151315   3.212026    -0.98   0.327    -9.447166    3.144535
    2005  7  |   16.23242    5.71431     2.84   0.005     5.031878    27.43297
    2005  8  |   .3397653   7.649651     0.04   0.965    -14.65422    15.33375
    2005 10  |   2.060155   3.877686     0.53   0.595    -5.540448    9.660758
    2005 11  |   12.77878   26.37419     0.48   0.628    -38.91694     64.4745
    2005 12  |   9.397702   6.272609     1.50   0.134    -2.897158    21.69256
    2005 13  |   .3406591   5.984861     0.06   0.955    -11.39019    12.07151
    2005 14  |  -39.51048   13.68485    -2.89   0.004    -66.33398   -12.68699
    2006  2  |   5.792111   3.071265     1.89   0.059    -.2278354    11.81206
    2006  3  |   4.326793   16.01781     0.27   0.787    -27.06951    35.72309
    2006  4  |   3.384149   16.28752     0.21   0.835     -28.5408     35.3091
    2006  5  |  -3.646821   3.385172    -1.08   0.281    -10.28205    2.988412
    2006  7  |   41.95309   6.234708     6.73   0.000     29.73252    54.17366
    2006  8  |   3.250665   7.940301     0.41   0.682    -12.31302    18.81435
    2006 10  |    1.99033   4.025913     0.49   0.621    -5.900811    9.881471
    2006 11  |  -31.74734   26.38933    -1.20   0.229    -83.47273    19.97805
    2006 12  |   7.123425   6.306742     1.13   0.259     -5.23834    19.48519
    2006 13  |   .7269042   6.088623     0.12   0.905    -11.20733    12.66114
    2006 14  |  -42.74341   13.74598    -3.11   0.002    -69.68673   -15.80009
    2007  1  |  (empty)  
    2007  2  |  -9.506132   16.04077    -0.59   0.553    -40.94744    21.93517
    2007  3  |  (omitted)
    2007  4  |  (omitted)
    2007  5  |  -5.297375   16.08273    -0.33   0.742    -36.82092    26.22617
    2007  7  |   18.99196   17.04499     1.11   0.265    -14.41771    52.40163
    2007  8  |  -1.945016   17.17342    -0.11   0.910    -35.60641    31.71638
    2007 10  |  -3.181257   15.72247    -0.20   0.840    -33.99866    27.63615
    2007 11  |  (omitted)
    2007 12  |   1.085489    16.4681     0.07   0.947    -31.19342     33.3644
    2007 13  |  -.6506917   16.90545    -0.04   0.969    -33.78685    32.48546
    2007 14  |  -48.32375   20.50218    -2.36   0.018    -88.50982   -8.137684
             |
       _cons |   -3.09577   7.566112    -0.41   0.682    -17.92601    11.73447
-------------+----------------------------------------------------------------
     sigma_u |  75.987198
     sigma_e |  17.417903
         rho |  .95008039   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(3102, 19262) =    40.89         Prob > F = 0.0000

. help xtreg

. tabstat oilseedrapeuaa if country="DEU" [pweight = farmsrepresented], by(year)
type mismatch
r(109);

. tabstat oilseedrapeuaa if country=="DEU" [pweight = farmsrepresented], by(year)
pweight not allowed
r(101);

. tabstat oilseedrapeuaa if country=="DEU" [weight = farmsrepresented], by(year)
(analytic weights assumed)

Summary for variables: oilseedrapeuaa
     by categories of: year (YEAR)

    year |      mean
---------+----------
    1999 |   14.8012
    2000 |  11.62671
    2001 |  11.63741
    2002 |  14.79346
    2003 |  13.74231
    2004 |  15.53863
    2005 |  16.08667
    2006 |  21.40953
    2007 |  17.23783
---------+----------
   Total |  14.95153
--------------------

. gen dif_osr_engy = oilseedrapeuaa - energycropsuaa
(40449 missing values generated)

. tabstat oilseedrapeuaa dir_osr_engy if energycropsuaa>0, by(year)
variable dir_osr_engy not found
r(111);

. tabstat oilseedrapeuaa dif_osr_engy if energycropsuaa>0, by(year)

Summary statistics: mean
  by categories of: year (YEAR)

    year |  oilsee~a  dif_os~y
---------+--------------------
    1999 |  13.49584         .
    2000 |  11.68898         .
    2001 |  11.17958         .
    2002 |  12.45126         .
    2003 |   12.6797         .
    2004 |  36.62304 -334.7758
    2005 |  54.20594 -404.5473
    2006 |  52.77576 -235.9082
    2007 |  40.25144 -202.9992
---------+--------------------
   Total |  14.58734 -268.2329
------------------------------

. gen delta_engy = energrycropsuaa - L.energycropsuaa
energrycropsuaa not found
r(111);

. gen delta_engy = energycropsuaa - L.energycropsuaa
(51963 missing values generated)

. tabstat delta* if energycropsuaa>0, by(year)

Summary for variables: delta_engy
     by categories of: year (YEAR)

    year |      mean
---------+----------
    1999 |         .
    2000 |         .
    2001 |         .
    2002 |         .
    2003 |         .
    2004 |  14476.86
    2005 |  302.5213
    2006 |  38.22668
    2007 |  121.0834
---------+----------
   Total |  175.4462
--------------------

. gen delta_osr = oilseedrapeuaa - L.oilseedrapeuaa
(14111 missing values generated)

. tabstat delta* if energycropsuaa>0, by(year)

Summary statistics: mean
  by categories of: year (YEAR)

    year |  delta_~y  delta_~r
---------+--------------------
    1999 |         .         .
    2000 |         . -1.994831
    2001 |         . -.0252806
    2002 |         . -.2065489
    2003 |         .  .4709737
    2004 |  14476.86  4.082887
    2005 |  302.5213  8.188051
    2006 |  38.22668  5.481749
    2007 |  121.0834 -2.788472
---------+--------------------
   Total |  175.4462 -.0759905
------------------------------

. tabstat delta* if energycropsuaa>0, by(year) stats(mean)

Summary statistics: mean
  by categories of: year (YEAR)

    year |  delta_~y  delta_~r
---------+--------------------
    1999 |         .         .
    2000 |         . -1.994831
    2001 |         . -.0252806
    2002 |         . -.2065489
    2003 |         .  .4709737
    2004 |  14476.86  4.082887
    2005 |  302.5213  8.188051
    2006 |  38.22668  5.481749
    2007 |  121.0834 -2.788472
---------+--------------------
   Total |  175.4462 -.0759905
------------------------------

. tabstat delta* if [energycropsuaa>0 & country!="OST" & country!="DAN"], by(year) stats(mean)

Summary statistics: mean
  by categories of: year (YEAR)

    year |  delta_~y  delta_~r
---------+--------------------
    1999 |         .         .
    2000 |         . -1.912842
    2001 |         .  .0101581
    2002 |         . -.2451374
    2003 |         .  .4027115
    2004 |         .  3.816765
    2005 |  43.29335  9.074737
    2006 |  25.71346  5.558305
    2007 |  24.87886 -2.947469
---------+--------------------
   Total |  29.37348  -.091651
------------------------------

. tabstat woodlandarea energycropsuaa, by(year) stats(mean)

Summary statistics: mean
  by categories of: year (YEAR)

    year |  woodla~a  energy~a
---------+--------------------
    1999 |  1.374696         0
    2000 |  1.517514         0
    2001 |  1.644445         0
    2002 |  1.587064         0
    2003 |  1.607956         0
    2004 |  1.665601  11.16216
    2005 |  1.848694  28.22533
    2006 |  1.867846  29.13907
    2007 |  1.911979  37.62885
---------+--------------------
   Total |  1.676167  24.47494
------------------------------

. tabstat woodlandarea energycropsuaa if energycropsuaa>0, by(year) stats(mean)

Summary statistics: mean
  by categories of: year (YEAR)

    year |  woodla~a  energy~a
---------+--------------------
    1999 |  1.211719         .
    2000 |  1.359947         .
    2001 |  1.482774         .
    2002 |  1.468188         .
    2003 |  1.487589         .
    2004 |  .9419113  371.3989
    2005 |  2.338604  458.7532
    2006 |  2.142569  288.6839
    2007 |  2.367678  243.2506
---------+--------------------
   Total |  1.465304  314.7719
------------------------------

. tabstat woodlandarea energycropsuaa if [energycropsuaa>0 & country!="OST" & country != "DAN"], by(y
> ear) stats(mean)

Summary statistics: mean
  by categories of: year (YEAR)

    year |  woodla~a  energy~a
---------+--------------------
    1999 |  1.241174         .
    2000 |   1.40111         .
    2001 |  1.538186         .
    2002 |  1.528929         .
    2003 |  1.547463         .
    2004 |  .9278292  23.85577
    2005 |  2.327505  47.93901
    2006 |   2.13587  52.18332
    2007 |  2.332737  50.50828
---------+--------------------
   Total |  1.508585  47.69542
------------------------------

. gen delta_cer = cerealsuaa - L.cerealsuaa
(14111 missing values generated)

. delta_tot = totaluaa - L.totaluaa
unrecognized command:  delta_tot
r(199);

. gen delta_tot = totaluaa - L.totaluaa
(14111 missing values generated)

. gen delta_wood  = woodlandarea - L.woodlandarea
(14111 missing values generated)

. tabstat delta* if [energycropsuaa>0 & country!="OST" & country != "DAN"], by(year) stats(mean)

Summary statistics: mean
  by categories of: year (YEAR)

    year |  delta_~y  delta~sr  delta~er  delta_~t  delta_~d
---------+--------------------------------------------------
    1999 |         .         .         .         .         .
    2000 |         . -1.912842  2.742532 -.1147415  .0156966
    2001 |         .  .0101581  .0863134  .8555365  .0270371
    2002 |         . -.2451374   1.41918  .9002225  .0669423
    2003 |         .  .4027115 -.7761907  .8174163  .0426464
    2004 |         .  3.816765 -.8303309  1.720771  .0355147
    2005 |  43.29335  9.074737 -3.934588  11.63869  .0734644
    2006 |  25.71346  5.558305 -3.598027   -7.3309  .0932053
    2007 |  24.87886 -2.947469  7.340241  4.585429  .2242348
---------+--------------------------------------------------
   Total |  29.37348  -.091651  .7656857   .787603  .0477606
------------------------------------------------------------

. tabstat delta* if [energycropsuaa>0 & country!="OST" & country != "DAN"], by(year) stats(mean, min,
>  max, sd)

Summary statistics: mean, min, max, sd
  by categories of: year (YEAR)

    year |  delta_~y  delta~sr  delta~er  delta_~t  delta_~d
---------+--------------------------------------------------
    1999 |         .         .         .         .         .
         |         .         .         .         .         .
         |         .         .         .         .         .
         |         .         .         .         .         .
---------+--------------------------------------------------
    2000 |         . -1.912842  2.742532 -.1147415  .0156966
         |         .   -322.18   -207.61   -267.02       -20
         |         .  99.00999    341.17     207.6        46
         |         .  11.89728   15.3519  15.62528  .7990697
---------+--------------------------------------------------
    2001 |         .  .0101581  .0863134  .8555365  .0270371
         |         .      -335   -400.49   -299.85    -64.42
         |         .    367.51       296    434.13     55.52
         |         .  10.72782  15.28945  16.18401  1.550074
---------+--------------------------------------------------
    2002 |         . -.2451374   1.41918  .9002225  .0669423
         |         .   -165.91   -180.87   -447.18     -9.63
         |         .    157.66    245.75  567.9401    174.65
         |         .  9.865664  15.25107   17.2813  2.312895
---------+--------------------------------------------------
    2003 |         .  .4027115 -.7761907  .8174163  .0426464
         |         .   -271.58  -1050.24  -1651.16    -32.99
         |         .    258.57    255.54  503.4301     62.21
         |         .  11.71303  22.65304   26.3949  1.378861
---------+--------------------------------------------------
    2004 |         .  3.816765 -.8303309  1.720771  .0355147
         |         .    -62.97   -596.21 -76.40015         0
         |         .    665.08    198.49     98.67  7.720001
         |         .  41.51624  40.56972  13.57142  .4822263
---------+--------------------------------------------------
    2005 |  43.29335  9.074737 -3.934588  11.63869  .0734644
         |    -45.84 -81.15002   -455.75   -431.29    -15.44
         |   1317.46  461.6699    136.74  461.6499     55.96
         |  98.95215  33.53735  38.60032  45.61577  2.558628
---------+--------------------------------------------------
    2006 |  25.71346  5.558305 -3.598027   -7.3309  .0932053
         |   -301.52    -164.5   -359.78   -469.89      -.99
         |    888.84     213.3    193.16     111.2     18.62
         |  67.47388  22.03914  31.85359  42.61304  .8794727
---------+--------------------------------------------------
    2007 |  24.87886 -2.947469  7.340241  4.585429  .2242348
         |   -802.16    -492.2   -223.95 -82.50995     -13.7
         |    932.53    121.15    851.51  517.8799     115.9
         |  86.99795  35.85382  45.80329  29.78131  4.064053
---------+--------------------------------------------------
   Total |  29.37348  -.091651  .7656857   .787603  .0477606
         |   -802.16    -492.2  -1050.24  -1651.16    -64.42
         |   1317.46    665.08    851.51  567.9401    174.65
         |  84.56888   14.3232   20.7029  21.86426   1.76718
------------------------------------------------------------

. tabstat delta* if [energycropsuaa>0 & country!="OST" & country != "DAN"], by(year) stats(mean)

Summary statistics: mean
  by categories of: year (YEAR)

    year |  delta_~y  delta~sr  delta~er  delta_~t  delta_~d
---------+--------------------------------------------------
    1999 |         .         .         .         .         .
    2000 |         . -1.912842  2.742532 -.1147415  .0156966
    2001 |         .  .0101581  .0863134  .8555365  .0270371
    2002 |         . -.2451374   1.41918  .9002225  .0669423
    2003 |         .  .4027115 -.7761907  .8174163  .0426464
    2004 |         .  3.816765 -.8303309  1.720771  .0355147
    2005 |  43.29335  9.074737 -3.934588  11.63869  .0734644
    2006 |  25.71346  5.558305 -3.598027   -7.3309  .0932053
    2007 |  24.87886 -2.947469  7.340241  4.585429  .2242348
---------+--------------------------------------------------
   Total |  29.37348  -.091651  .7656857   .787603  .0477606
------------------------------------------------------------

. tabstat delta* if [energycropsuaa>0 & diesel==1 & country!="OST" & country != "DAN"], by(year) stat
> s(mean)
diesel not found
r(111);

. tabstat delta* if [energycropsuaa>0 & [country="DEU" | country = "FRA" | country=="ITA"| country ==
>  "UKI"]], by(year country) stats(mean)
country="DEU" invalid name
r(198);

. tabstat delta* if [energycropsuaa>0 & [country=="DEU" | country == "FRA" | country=="ITA"| country 
> == "UKI"]], by(year country) stats(mean)
by():  too many variables specified
r(103);

. tabstat delta* if [energycropsuaa>0 & [country=="DEU" | country == "FRA" | country=="ITA"| country 
> == "UKI"]], by(year) stats(mean)

Summary statistics: mean
  by categories of: year (YEAR)

    year |  delta_~y  delta~sr  delta~er  delta_~t  delta_~d
---------+--------------------------------------------------
    1999 |         .         .         .         .         .
    2000 |         . -3.110609  4.494378  .1934556  .0302945
    2001 |         . -.0950635  .4113382  1.126183  .0593648
    2002 |         . -.3051738  2.004769  1.072071   .076104
    2003 |         .  .8611493 -2.105077  .4576838  .0657554
    2004 |         .  3.816765 -.8303309  1.720771  .0355147
    2005 |  43.82163  9.250249 -3.761839  12.06322  .0751533
    2006 |  26.54364  5.698375 -3.884639 -7.927722  .0977361
    2007 |  24.97117 -3.488819  7.853271  4.766427  .2430303
---------+--------------------------------------------------
   Total |  29.96076 -.0321165  .9337931  .9406613  .0715478
------------------------------------------------------------

. tabstat delta* if [energycropsuaa>0 & [country=="DEU" | country == "FRA" | country=="ITA"| country 
> == "UKI"]] [weight = farmsrepresented], by(year) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: year (YEAR)

    year |  delta_~y  delta~sr  delta~er  delta_~t  delta_~d
---------+--------------------------------------------------
    1999 |         .         .         .         .         .
    2000 |         . -2.095935  2.956123  .2729091  .0165286
    2001 |         . -.2137553  .0577022   .640025  .0177755
    2002 |         . -.8116688  1.897038  .8436883  .0469884
    2003 |         .  .9037338 -1.269016  .5002252  .0375009
    2004 |         .   1.90856  .5641435   1.44233  .0095036
    2005 |  25.76542  4.808523  .6118797   8.50606  .0362301
    2006 |  18.82092   4.93829 -1.811092  .1695589  .0305936
    2007 |  19.37302  .9996982  1.737814  2.487192  .1051075
---------+--------------------------------------------------
   Total |  20.55451 -.0122083  .6999754  .8513875  .0346753
------------------------------------------------------------

. gen prop_engy = energycropsuaa/totaluaa
(40449 missing values generated)

. gen delta_eprop = propengy - L.prop_engy
propengy not found
r(111);

. gen delta_eprop = prop_engy - L.prop_engy
(51963 missing values generated)

. tabstat delta* if [energycropsuaa>0 & [country=="DEU" | country == "FRA" | country=="ITA"| country 
> == "UKI"]] [weight = farmsrepresented], by(year) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: year (YEAR)

    year |  delta_~y  delta~sr  delta~er  delta_~t  delta_~d  delta_~p
---------+------------------------------------------------------------
    1999 |         .         .         .         .         .         .
    2000 |         . -2.095935  2.956123  .2729091  .0165286         .
    2001 |         . -.2137553  .0577022   .640025  .0177755         .
    2002 |         . -.8116688  1.897038  .8436883  .0469884         .
    2003 |         .  .9037338 -1.269016  .5002252  .0375009         .
    2004 |         .   1.90856  .5641435   1.44233  .0095036         .
    2005 |  25.76542  4.808523  .6118797   8.50606  .0362301  .1222178
    2006 |  18.82092   4.93829 -1.811092  .1695589  .0305936  .1112944
    2007 |  19.37302  .9996982  1.737814  2.487192  .1051075  .1371143
---------+------------------------------------------------------------
   Total |  20.55451 -.0122083  .6999754  .8513875  .0346753  .1255872
----------------------------------------------------------------------

. e2osr = energycropsuaa/oilseedrapeuaa
unrecognized command:  e2osr
r(199);

. gen e2osr = energycropsuaa/oilseedrapeuaa
(61418 missing values generated)

. gen delta_e2o = e2osr - L.e2osr
(67339 missing values generated)

. tabstat delta* if [energycropsuaa>0 & [country=="DEU" | country == "FRA" | country=="ITA"| country 
> == "UKI"]] [weight = farmsrepresented], by(year) stats(mean)
(analytic weights assumed)

Summary statistics: mean
  by categories of: year (YEAR)

    year |  delta_~y  delta~sr  delta~er  delta_~t  delta_~d  delta_~p  delta~2o
---------+----------------------------------------------------------------------
    1999 |         .         .         .         .         .         .         .
    2000 |         . -2.095935  2.956123  .2729091  .0165286         .         .
    2001 |         . -.2137553  .0577022   .640025  .0177755         .         .
    2002 |         . -.8116688  1.897038  .8436883  .0469884         .         .
    2003 |         .  .9037338 -1.269016  .5002252  .0375009         .         .
    2004 |         .   1.90856  .5641435   1.44233  .0095036         .         .
    2005 |  25.76542  4.808523  .6118797   8.50606  .0362301  .1222178  .6296393
    2006 |  18.82092   4.93829 -1.811092  .1695589  .0305936  .1112944  .5552028
    2007 |  19.37302  .9996982  1.737814  2.487192  .1051075  .1371143  .6746171
---------+----------------------------------------------------------------------
   Total |  20.55451 -.0122083  .6999754  .8513875  .0346753  .1255872  .6250137
--------------------------------------------------------------------------------

. gen adopt = 0
adopt already defined
r(110);

. replace adopt = 0
(62829 real changes made)

. replace adopt = 1 if [min(energycropsuaa) > 0  & year !=2007]
invalid syntax
r(198);

. by pid: egen min_engy = min(energycropsuaa)

. replace adopt = 1 if [min_engy > 0 & year !=2007]
(924 real changes made)

. xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.
> year year#mscode if adopt==1, fe
note: 2006.year omitted because of collinearity
note: 1999b.year#2.mscode omitted because of collinearity
note: 1999b.year#4.mscode omitted because of collinearity
note: 2003.year#7.mscode omitted because of collinearity
note: 2004.year#5.mscode omitted because of collinearity
note: 2005.year#14.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =       924
Group variable: pid                             Number of groups   =       156

R-sq:  within  = 0.2224                         Obs per group: min =         1
       between = 0.2533                                        avg =       5.9
       overall = 0.1418                                        max =         8

                                                F(35,733)          =      5.99
corr(u_i, Xb)  = -0.6477                        Prob > F           =    0.0000

------------------------------------------------------------------------------
oilseedrap~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |   10.26663   15.77515     0.65   0.515    -20.70323    41.23648
   sizeclass |   5.486633   2.518055     2.18   0.030      .543174    10.43009
 setasideuaa |  -.4179877   .0603298    -6.93   0.000    -.5364275    -.299548
   ln_labour |  -1.087609   2.746421    -0.40   0.692    -6.479399    4.304181
      ln_ffi |   .0276687   .2226278     0.12   0.901    -.4093954    .4647328
    solvency |  -8.004609   4.246887    -1.88   0.060    -16.34212    .3329038
   intensity |  -8.594878   18.92523    -0.45   0.650      -45.749    28.55925
  specialise |   13.19311   7.774494     1.70   0.090    -2.069817    28.45604
             |
        year |
       2000  |  -17.32068   18.70378    -0.93   0.355    -54.04004    19.39868
       2001  |  -.0622118   15.78626    -0.00   0.997    -31.05388    30.92946
       2002  |   .4381307    16.3814     0.03   0.979    -31.72193     32.5982
       2003  |  -7.372272   16.91092    -0.44   0.663    -40.57189    25.82734
       2004  |   11.61456   15.78735     0.74   0.462    -19.37925    42.60838
       2005  |   1.669222   9.746223     0.17   0.864    -17.46462    20.80306
       2006  |  (omitted)
             |
 year#mscode |
    1999  2  |  (omitted)
    1999  4  |  (omitted)
    1999  5  |   24.36296   18.88448     1.29   0.197    -12.71115    61.43707
    1999  7  |   -1.87716   25.29078    -0.07   0.941    -51.52816    47.77384
    1999 14  |  (empty)  
    2000  2  |   10.19224   19.16166     0.53   0.595    -27.42604    47.81051
    2000  4  |   23.38484   26.68979     0.88   0.381     -29.0127    75.78238
    2000  5  |   41.73857   18.90016     2.21   0.028     4.633678    78.84347
    2000  7  |   24.87884   25.20576     0.99   0.324    -24.60526    74.36294
    2000 14  |  (empty)  
    2001  2  |  -10.61563   16.48324    -0.64   0.520    -42.97561    21.74436
    2001  4  |   8.402052   24.60789     0.34   0.733    -39.90831    56.71241
    2001  5  |   22.95535   15.94251     1.44   0.150    -8.343066    54.25377
    2001  7  |  -2.536876    22.2231    -0.11   0.909     -46.1654    41.09164
    2001 14  |   -50.2749   21.16963    -2.37   0.018    -91.83524   -8.714565
    2002  2  |  -9.436465   16.98056    -0.56   0.579    -42.77279    23.89986
    2002  4  |  (empty)  
    2002  5  |   20.39244   16.45251     1.24   0.216    -11.90723     52.6921
    2002  7  |   1.722823   23.12118     0.07   0.941    -43.66881    47.11445
    2002 14  |  (empty)  
    2003  2  |    8.81174   17.71477     0.50   0.619    -25.96599    43.58947
    2003  4  |  (empty)  
    2003  5  |   28.52914   16.98106     1.68   0.093    -4.808164    61.86645
    2003  7  |  (omitted)
    2003 14  |  (empty)  
    2004  2  |   -12.7869   19.59226    -0.65   0.514    -51.25053    25.67674
    2004  4  |  (empty)  
    2004  5  |  (omitted)
    2004  7  |  (empty)  
    2004 14  |  (empty)  
    2005  2  |  -5.163059   16.54177    -0.31   0.755    -37.63796    27.31184
    2005  4  |  (empty)  
    2005  5  |   12.58365   15.95558     0.79   0.431    -18.74043    43.90774
    2005  7  |  (empty)  
    2005 14  |  (omitted)
    2006  2  |   18.02388   16.48413     1.09   0.275    -14.33786    50.38562
    2006  4  |  (empty)  
    2006  5  |    16.1942   15.89391     1.02   0.309    -15.00882    47.39722
    2006  7  |  (empty)  
    2006 14  |  (empty)  
             |
       _cons |  -20.30868   34.10011    -0.60   0.552     -87.2542    46.63684
-------------+----------------------------------------------------------------
     sigma_u |  80.241535
     sigma_e |  13.216247
         rho |  .97358849   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(155, 733) =    30.97            Prob > F = 0.0000

. xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.
> year year#mscode if adopt==1, fe vce(robust)
note: 2006.year omitted because of collinearity
note: 1999b.year#2.mscode omitted because of collinearity
note: 1999b.year#4.mscode omitted because of collinearity
note: 2003.year#7.mscode omitted because of collinearity
note: 2004.year#5.mscode omitted because of collinearity
note: 2005.year#14.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =       924
Group variable: pid                             Number of groups   =       156

R-sq:  within  = 0.2224                         Obs per group: min =         1
       between = 0.2533                                        avg =       5.9
       overall = 0.1418                                        max =         8

                                                F(25,155)          =         .
corr(u_i, Xb)  = -0.6477                        Prob > F           =         .

                                  (Std. Err. adjusted for 156 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
oilseedrap~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |   10.26663   4.549199     2.26   0.025     1.280199    19.25306
   sizeclass |   5.486633   1.832966     2.99   0.003     1.865815    9.107451
 setasideuaa |  -.4179877   .2219834    -1.88   0.062    -.8564908    .0205153
   ln_labour |  -1.087609   2.583537    -0.42   0.674    -6.191094    4.015876
      ln_ffi |   .0276687    .501231     0.06   0.956    -.9624564    1.017794
    solvency |  -8.004609   7.599336    -1.05   0.294    -23.01624    7.007021
   intensity |  -8.594878   15.44717    -0.56   0.579    -39.10902    21.91926
  specialise |   13.19311    9.42667     1.40   0.164    -5.428208    31.81444
             |
        year |
       2000  |  -17.32068   1.472411   -11.76   0.000    -20.22926    -14.4121
       2001  |  -.0622118   4.481092    -0.01   0.989    -8.914103    8.789679
       2002  |   .4381307   7.529379     0.06   0.954    -14.43531    15.31157
       2003  |  -7.372272    2.90079    -2.54   0.012    -13.10245   -1.642089
       2004  |   11.61456   4.227881     2.75   0.007      3.26286    19.96626
       2005  |   1.669222   5.471473     0.31   0.761    -9.139056     12.4775
       2006  |  (omitted)
             |
 year#mscode |
    1999  2  |  (omitted)
    1999  4  |  (omitted)
    1999  5  |   24.36296   3.112822     7.83   0.000     18.21393    30.51199
    1999  7  |   -1.87716   4.133514    -0.45   0.650    -10.04245     6.28813
    1999 14  |  (empty)  
    2000  2  |   10.19224   6.062441     1.68   0.095    -1.783434     22.1679
    2000  4  |   23.38484    6.07395     3.85   0.000     11.38644    35.38324
    2000  5  |   41.73857   2.608487    16.00   0.000      36.5858    46.89135
    2000  7  |   24.87884   3.781588     6.58   0.000     17.40874    32.34894
    2000 14  |  (empty)  
    2001  2  |  -10.61563   12.37303    -0.86   0.392    -35.05715     13.8259
    2001  4  |   8.402052   6.614105     1.27   0.206    -4.663366    21.46747
    2001  5  |   22.95535   4.508294     5.09   0.000     14.04972    31.86098
    2001  7  |  -2.536876   5.647062    -0.45   0.654    -13.69201    8.618258
    2001 14  |   -50.2749   9.519333    -5.28   0.000    -69.07927   -31.47053
    2002  2  |  -9.436465   13.17815    -0.72   0.475    -35.46841    16.59548
    2002  4  |  (empty)  
    2002  5  |   20.39244   7.520284     2.71   0.007     5.536963    35.24791
    2002  7  |   1.722823   9.590699     0.18   0.858    -17.22252    20.66817
    2002 14  |  (empty)  
    2003  2  |    8.81174    10.7497     0.82   0.414    -12.42308    30.04656
    2003  4  |  (empty)  
    2003  5  |   28.52914   2.883745     9.89   0.000     22.83263    34.22566
    2003  7  |  (omitted)
    2003 14  |  (empty)  
    2004  2  |   -12.7869   8.891008    -1.44   0.152    -30.35008    4.776288
    2004  4  |  (empty)  
    2004  5  |  (omitted)
    2004  7  |  (empty)  
    2004 14  |  (empty)  
    2005  2  |  -5.163059   10.48626    -0.49   0.623    -25.87749    15.55137
    2005  4  |  (empty)  
    2005  5  |   12.58365   6.561527     1.92   0.057    -.3779015    25.54521
    2005  7  |  (empty)  
    2005 14  |  (omitted)
    2006  2  |   18.02388   17.14224     1.05   0.295    -15.83868    51.88644
    2006  4  |  (empty)  
    2006  5  |    16.1942    4.34972     3.72   0.000     7.601824    24.78659
    2006  7  |  (empty)  
    2006 14  |  (empty)  
             |
       _cons |  -20.30868   27.06891    -0.75   0.454    -73.78026     33.1629
-------------+----------------------------------------------------------------
     sigma_u |  80.241535
     sigma_e |  13.216247
         rho |  .97358849   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. help xtreg

. xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.
> year year#mscode if adopt==1, fe vce(cluster pid)
note: 2006.year omitted because of collinearity
note: 1999b.year#2.mscode omitted because of collinearity
note: 1999b.year#4.mscode omitted because of collinearity
note: 2003.year#7.mscode omitted because of collinearity
note: 2004.year#5.mscode omitted because of collinearity
note: 2005.year#14.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =       924
Group variable: pid                             Number of groups   =       156

R-sq:  within  = 0.2224                         Obs per group: min =         1
       between = 0.2533                                        avg =       5.9
       overall = 0.1418                                        max =         8

                                                F(25,155)          =         .
corr(u_i, Xb)  = -0.6477                        Prob > F           =         .

                                  (Std. Err. adjusted for 156 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
oilseedrap~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |   10.26663   4.549199     2.26   0.025     1.280199    19.25306
   sizeclass |   5.486633   1.832966     2.99   0.003     1.865815    9.107451
 setasideuaa |  -.4179877   .2219834    -1.88   0.062    -.8564908    .0205153
   ln_labour |  -1.087609   2.583537    -0.42   0.674    -6.191094    4.015876
      ln_ffi |   .0276687    .501231     0.06   0.956    -.9624564    1.017794
    solvency |  -8.004609   7.599336    -1.05   0.294    -23.01624    7.007021
   intensity |  -8.594878   15.44717    -0.56   0.579    -39.10902    21.91926
  specialise |   13.19311    9.42667     1.40   0.164    -5.428208    31.81444
             |
        year |
       2000  |  -17.32068   1.472411   -11.76   0.000    -20.22926    -14.4121
       2001  |  -.0622118   4.481092    -0.01   0.989    -8.914103    8.789679
       2002  |   .4381307   7.529379     0.06   0.954    -14.43531    15.31157
       2003  |  -7.372272    2.90079    -2.54   0.012    -13.10245   -1.642089
       2004  |   11.61456   4.227881     2.75   0.007      3.26286    19.96626
       2005  |   1.669222   5.471473     0.31   0.761    -9.139056     12.4775
       2006  |  (omitted)
             |
 year#mscode |
    1999  2  |  (omitted)
    1999  4  |  (omitted)
    1999  5  |   24.36296   3.112822     7.83   0.000     18.21393    30.51199
    1999  7  |   -1.87716   4.133514    -0.45   0.650    -10.04245     6.28813
    1999 14  |  (empty)  
    2000  2  |   10.19224   6.062441     1.68   0.095    -1.783434     22.1679
    2000  4  |   23.38484    6.07395     3.85   0.000     11.38644    35.38324
    2000  5  |   41.73857   2.608487    16.00   0.000      36.5858    46.89135
    2000  7  |   24.87884   3.781588     6.58   0.000     17.40874    32.34894
    2000 14  |  (empty)  
    2001  2  |  -10.61563   12.37303    -0.86   0.392    -35.05715     13.8259
    2001  4  |   8.402052   6.614105     1.27   0.206    -4.663366    21.46747
    2001  5  |   22.95535   4.508294     5.09   0.000     14.04972    31.86098
    2001  7  |  -2.536876   5.647062    -0.45   0.654    -13.69201    8.618258
    2001 14  |   -50.2749   9.519333    -5.28   0.000    -69.07927   -31.47053
    2002  2  |  -9.436465   13.17815    -0.72   0.475    -35.46841    16.59548
    2002  4  |  (empty)  
    2002  5  |   20.39244   7.520284     2.71   0.007     5.536963    35.24791
    2002  7  |   1.722823   9.590699     0.18   0.858    -17.22252    20.66817
    2002 14  |  (empty)  
    2003  2  |    8.81174    10.7497     0.82   0.414    -12.42308    30.04656
    2003  4  |  (empty)  
    2003  5  |   28.52914   2.883745     9.89   0.000     22.83263    34.22566
    2003  7  |  (omitted)
    2003 14  |  (empty)  
    2004  2  |   -12.7869   8.891008    -1.44   0.152    -30.35008    4.776288
    2004  4  |  (empty)  
    2004  5  |  (omitted)
    2004  7  |  (empty)  
    2004 14  |  (empty)  
    2005  2  |  -5.163059   10.48626    -0.49   0.623    -25.87749    15.55137
    2005  4  |  (empty)  
    2005  5  |   12.58365   6.561527     1.92   0.057    -.3779015    25.54521
    2005  7  |  (empty)  
    2005 14  |  (omitted)
    2006  2  |   18.02388   17.14224     1.05   0.295    -15.83868    51.88644
    2006  4  |  (empty)  
    2006  5  |    16.1942    4.34972     3.72   0.000     7.601824    24.78659
    2006  7  |  (empty)  
    2006 14  |  (empty)  
             |
       _cons |  -20.30868   27.06891    -0.75   0.454    -73.78026     33.1629
-------------+----------------------------------------------------------------
     sigma_u |  80.241535
     sigma_e |  13.216247
         rho |  .97358849   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.
> year year#mscode if year!=2007, fe vce(cluster pid)
note: 2006.year omitted because of collinearity
note: 1999b.year#2.mscode omitted because of collinearity
note: 1999b.year#3.mscode omitted because of collinearity
note: 1999b.year#4.mscode omitted because of collinearity
note: 1999b.year#7.mscode omitted because of collinearity
note: 1999b.year#9.mscode omitted because of collinearity
note: 1999b.year#10.mscode omitted because of collinearity
note: 1999b.year#12.mscode omitted because of collinearity
note: 1999b.year#13.mscode omitted because of collinearity
note: 1999b.year#14.mscode omitted because of collinearity
note: 2000.year#6.mscode omitted because of collinearity
note: 2000.year#8.mscode omitted because of collinearity
note: 2006.year#5.mscode omitted because of collinearity
note: 2006.year#11.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     70722
Group variable: pid                             Number of groups   =     10863

R-sq:  within  = 0.0633                         Obs per group: min =         1
       between = 0.2298                                        avg =       6.5
       overall = 0.1467                                        max =         8

                                                F(105,10862)       =     11.26
corr(u_i, Xb)  = -0.5019                        Prob > F           =    0.0000

                                (Std. Err. adjusted for 10863 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
oilseedrap~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |   .2447674   1.199694     0.20   0.838    -2.106853    2.596387
   sizeclass |   .6742916   .0930997     7.24   0.000     .4917992    .8567839
 setasideuaa |  -.2512014   .0683594    -3.67   0.000    -.3851983   -.1172045
   ln_labour |   .4583004   .2502672     1.83   0.067    -.0322691    .9488698
      ln_ffi |   .0328186   .0254858     1.29   0.198    -.0171382    .0827753
    solvency |      .2947   .3428541     0.86   0.390    -.3773565    .9667566
   intensity |  -.7606308   1.064949    -0.71   0.475    -2.848124    1.326863
  specialise |   .3073011   .2665446     1.15   0.249    -.2151749     .829777
             |
        year |
       2000  |  -5.003932   1.057141    -4.73   0.000    -7.076121   -2.931743
       2001  |  -6.176303   1.150453    -5.37   0.000    -8.431401   -3.921205
       2002  |   -4.75892   1.095257    -4.35   0.000    -6.905824   -2.612015
       2003  |  -2.510173   1.091815    -2.30   0.022    -4.650331   -.3700163
       2004  |    -.86511   .8074578    -1.07   0.284    -2.447875    .7176545
       2005  |  -2.666524   .7137815    -3.74   0.000    -4.065666   -1.267382
       2006  |  (omitted)
             |
 year#mscode |
    1999  2  |  (omitted)
    1999  3  |  (omitted)
    1999  4  |  (omitted)
    1999  5  |   .7420106   1.246984     0.60   0.552    -1.702305    3.186326
    1999  6  |  -4.522322   1.069711    -4.23   0.000    -6.619151   -2.425493
    1999  7  |  (omitted)
    1999  8  |  -2.660496   1.415052    -1.88   0.060    -5.434256     .113263
    1999  9  |  (omitted)
    1999 10  |  (omitted)
    1999 11  |   2.917167   1.602321     1.82   0.069     -.223674    6.058007
    1999 12  |  (omitted)
    1999 13  |  (omitted)
    1999 14  |  (omitted)
    2000  2  |   .1345589   1.195394     0.11   0.910    -2.208631    2.477749
    2000  3  |    4.84973   1.062157     4.57   0.000     2.767708    6.931752
    2000  4  |   3.781104   1.094798     3.45   0.001     1.635101    5.927108
    2000  5  |   3.726246   1.073753     3.47   0.001     1.621495    5.830998
    2000  6  |  (omitted)
    2000  7  |   4.026935   1.168324     3.45   0.001     1.736808    6.317063
    2000  8  |  (omitted)
    2000  9  |   4.974815   1.056372     4.71   0.000     2.904134    7.045497
    2000 10  |   4.138959    1.06794     3.88   0.000     2.045601    6.232317
    2000 11  |   8.608024   1.579874     5.45   0.000     5.511183    11.70487
    2000 12  |   4.952951   1.126937     4.40   0.000     2.743949    7.161954
    2000 13  |   3.389832   1.210234     2.80   0.005     1.017551    5.762112
    2000 14  |   2.163299   1.806584     1.20   0.231    -1.377936    5.704534
    2001  2  |   2.014672   1.315293     1.53   0.126    -.5635419    4.592885
    2001  3  |   5.787072   1.157547     5.00   0.000     3.518068    8.056076
    2001  4  |   5.713195   1.181753     4.83   0.000     3.396744    8.029647
    2001  5  |   4.404906   .9088255     4.85   0.000     2.623442    6.186369
    2001  6  |   1.172735   .8343931     1.41   0.160    -.4628278    2.808298
    2001  7  |   5.008397   1.268607     3.95   0.000     2.521696    7.495098
    2001  8  |   1.928116   1.045275     1.84   0.065     -.120814    3.977046
    2001  9  |    5.91457   1.158504     5.11   0.000     3.643691    8.185448
    2001 10  |   5.541126   1.161263     4.77   0.000     3.264839    7.817413
    2001 11  |   9.911481   1.442414     6.87   0.000     7.084087    12.73887
    2001 12  |   6.127027   1.230163     4.98   0.000     3.715682    8.538371
    2001 13  |   4.330037   1.278654     3.39   0.001     1.823642    6.836431
    2001 14  |   1.030631   2.080659     0.50   0.620    -3.047841    5.109102
    2002  2  |   2.670195   1.320776     2.02   0.043     .0812336    5.259157
    2002  3  |   4.433706   1.107437     4.00   0.000     2.262927    6.604486
    2002  4  |    3.51005   1.124145     3.12   0.002     1.306522    5.713578
    2002  5  |    1.09299   .7957962     1.37   0.170    -.4669158    2.652896
    2002  6  |  -.0324509   .8644155    -0.04   0.970    -1.726863    1.661961
    2002  7  |   2.059697   1.255955     1.64   0.101    -.4022048    4.521598
    2002  8  |  -.2422163   1.043815    -0.23   0.817    -2.288284    1.803852
    2002  9  |   4.745523   1.104347     4.30   0.000     2.580801    6.910245
    2002 10  |   4.407767   1.110231     3.97   0.000     2.231512    6.584023
    2002 11  |   7.581906   1.129951     6.71   0.000     5.366996    9.796817
    2002 12  |   4.792294   1.213608     3.95   0.000     2.413401    7.171188
    2002 13  |   5.090881   1.233201     4.13   0.000     2.673583    7.508179
    2002 14  |  -3.668685   2.022293    -1.81   0.070    -7.632749    .2953786
    2003  2  |   1.179376   1.279704     0.92   0.357    -1.329078    3.687829
    2003  3  |   1.793982   1.108981     1.62   0.106    -.3798227    3.967786
    2003  4  |   1.170326   1.119953     1.04   0.296    -1.024986    3.365638
    2003  5  |  -.0155073    .810488    -0.02   0.985    -1.604212    1.573197
    2003  6  |  -1.830678   .9232529    -1.98   0.047    -3.640422   -.0209344
    2003  7  |  -1.724562   1.562152    -1.10   0.270    -4.786664     1.33754
    2003  8  |  -2.239566   1.158664    -1.93   0.053    -4.510758    .0316259
    2003  9  |   2.459864   1.095946     2.24   0.025     .3116099    4.608118
    2003 10  |   2.055067   1.116023     1.84   0.066    -.1325412    4.242676
    2003 11  |   5.606102   1.152326     4.87   0.000     3.347334    7.864871
    2003 12  |   3.850296   1.238379     3.11   0.002     1.422847    6.277745
    2003 13  |   2.112472   1.260181     1.68   0.094    -.3577132    4.582657
    2003 14  |   -.708415   1.981617    -0.36   0.721    -4.592745    3.175915
    2004  2  |  -.1673138   1.307903    -0.13   0.898    -2.731042    2.396414
    2004  3  |  -.1909201   1.115138    -0.17   0.864    -2.376795    1.994954
    2004  4  |  -.5724071    1.13238    -0.51   0.613    -2.792079    1.647265
    2004  5  |   -2.30557   .8459293    -2.73   0.006    -3.963746   -.6473947
    2004  6  |   -4.12628   .9766791    -4.22   0.000    -6.040749   -2.211811
    2004  7  |  -2.401647   1.352515    -1.78   0.076    -5.052823    .2495288
    2004  8  |  -2.660477   1.109298    -2.40   0.016    -4.834904    -.486051
    2004  9  |   .7482394   1.113898     0.67   0.502    -1.435204    2.931683
    2004 10  |   .1066853   1.130311     0.09   0.925    -2.108931    2.322302
    2004 11  |   2.907344   1.170153     2.48   0.013     .6136304    5.201058
    2004 12  |   2.359776   1.311781     1.80   0.072    -.2115536    4.931105
    2004 13  |   2.561942   1.309487     1.96   0.050    -.0048913    5.128775
    2004 14  |  -3.404131   2.031045    -1.68   0.094     -7.38535    .5770871
    2005  2  |   3.058484   1.287844     2.37   0.018     .5340745    5.582893
    2005  3  |   1.650218    1.11876     1.48   0.140    -.5427564    3.843192
    2005  4  |   1.106911   1.136125     0.97   0.330    -1.120102    3.333923
    2005  5  |   1.295494   .7426971     1.74   0.081     -.160328    2.751316
    2005  6  |  -1.713964   .9507043    -1.80   0.071    -3.577518    .1495903
    2005  7  |  -.4624501   1.274863    -0.36   0.717    -2.961414    2.036514
    2005  8  |   -1.95787   1.330972    -1.47   0.141    -4.566818    .6510785
    2005  9  |   2.621903   1.112383     2.36   0.018     .4414285    4.802377
    2005 10  |     2.3338   1.135712     2.05   0.040      .107598    4.560001
    2005 11  |   3.258645   .9343366     3.49   0.000     1.427175    5.090115
    2005 12  |   4.535743   1.261163     3.60   0.000     2.063634    7.007852
    2005 13  |   4.933363   1.337192     3.69   0.000     2.312222    7.554503
    2005 14  |   1.715305    2.03984     0.84   0.400    -2.283153    5.713764
    2006  2  |   3.935506   1.411138     2.79   0.005     1.169418    6.701595
    2006  3  |   -.892633   1.212087    -0.74   0.461    -3.268545    1.483279
    2006  4  |  -1.870635   1.234341    -1.52   0.130    -4.290169    .5488978
    2006  5  |  (omitted)
    2006  6  |  -4.428297   1.126526    -3.93   0.000    -6.636493   -2.220101
    2006  7  |  -1.090654   1.506521    -0.72   0.469    -4.043711    1.862402
    2006  8  |  -1.521211   1.402484    -1.08   0.278    -4.270335    1.227913
    2006  9  |  -.8500798   1.238845    -0.69   0.493    -3.278441    1.578282
    2006 10  |    .657752   1.235438     0.53   0.594    -1.763932    3.079436
    2006 11  |  (omitted)
    2006 12  |   3.336045   1.492119     2.24   0.025     .4112184    6.260871
    2006 13  |   3.101399   1.461369     2.12   0.034     .2368493    5.965948
    2006 14  |  -2.109302   2.162913    -0.98   0.329    -6.349006    2.130402
             |
       _cons |   6.884032   1.972843     3.49   0.000     3.016901    10.75116
-------------+----------------------------------------------------------------
     sigma_u |  44.774228
     sigma_e |  10.204237
         rho |  .95062424   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. tabstat osr_price, by(year)
variable osr_price not found
r(111);

. br osr_price
variable osr_price not found
r(111);

. xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.
> year year#mscode if -[country=="DAN" & year==2007], fe vce(cluster pid)
insufficient observations
r(2001);

. xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.
> year year#mscode if ![country=="DAN" & year==2007], fe vce(cluster pid)
note: 2007.year omitted because of collinearity
note: 1999b.year#2.mscode omitted because of collinearity
note: 1999b.year#8.mscode omitted because of collinearity
note: 1999b.year#11.mscode omitted because of collinearity
note: 1999b.year#12.mscode omitted because of collinearity
note: 1999b.year#13.mscode omitted because of collinearity
note: 2000.year#3.mscode omitted because of collinearity
note: 2000.year#14.mscode omitted because of collinearity
note: 2003.year#7.mscode omitted because of collinearity
note: 2007.year#4.mscode omitted because of collinearity
note: 2007.year#5.mscode omitted because of collinearity
note: 2007.year#6.mscode omitted because of collinearity
note: 2007.year#8.mscode omitted because of collinearity
note: 2007.year#9.mscode omitted because of collinearity
note: 2007.year#10.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     78180
Group variable: pid                             Number of groups   =     10863

R-sq:  within  = 0.0530                         Obs per group: min =         2
       between = 0.2036                                        avg =       7.2
       overall = 0.1288                                        max =         9

                                                F(118,10862)       =     11.24
corr(u_i, Xb)  = -0.4796                        Prob > F           =    0.0000

                                (Std. Err. adjusted for 10863 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
oilseedrap~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |   1.235765   1.343672     0.92   0.358    -1.398078    3.869607
   sizeclass |   .6622646   .0818358     8.09   0.000     .5018514    .8226778
 setasideuaa |   -.224426   .0559921    -4.01   0.000    -.3341808   -.1146713
   ln_labour |    .331826   .2328664     1.42   0.154    -.1246346    .7882865
      ln_ffi |  -.0061424   .0294938    -0.21   0.835    -.0639556    .0516707
    solvency |   .2615914   .3887211     0.67   0.501    -.5003728    1.023556
   intensity |  -1.890409   1.034527    -1.83   0.068     -3.91827    .1374515
  specialise |   .3296519   .2893108     1.14   0.255      -.23745    .8967538
             |
        year |
       2000  |  -4.952084   1.062806    -4.66   0.000    -7.035378   -2.868791
       2001  |  -6.153867    1.15234    -5.34   0.000    -8.412663   -3.895071
       2002  |  -4.931363   1.096185    -4.50   0.000    -7.080086    -2.78264
       2003  |  -2.642328   1.088881    -2.43   0.015    -4.776732   -.5079233
       2004  |  -1.917869   1.738926    -1.10   0.270    -5.326481    1.490743
       2005  |  -3.740917   1.742265    -2.15   0.032    -7.156073   -.3257601
       2006  |  -1.044706    1.80518    -0.58   0.563    -4.583188    2.493777
       2007  |  (omitted)
             |
 year#mscode |
    1999  2  |  (omitted)
    1999  3  |  -4.816392   1.067539    -4.51   0.000    -6.908963   -2.723822
    1999  4  |   4.089086   1.428809     2.86   0.004      1.28836    6.889813
    1999  5  |   .0866692   1.408033     0.06   0.951    -2.673332    2.846671
    1999  6  |   .3208157   1.468488     0.22   0.827    -2.557688     3.19932
    1999  7  |   1.557422   1.552067     1.00   0.316    -1.484912    4.599756
    1999  8  |  (omitted)
    1999  9  |   1.513199   1.364192     1.11   0.267    -1.160866    4.187264
    1999 10  |     1.1771   1.376887     0.85   0.393    -1.521849    3.876049
    1999 11  |  (omitted)
    1999 12  |  (omitted)
    1999 13  |  (omitted)
    1999 14  |  -2.106928    1.80884    -1.16   0.244    -5.652584    1.438729
    2000  2  |   .2552345   1.205277     0.21   0.832    -2.107329    2.617798
    2000  3  |  (omitted)
    2000  4  |   7.846242   1.740857     4.51   0.000     4.433845    11.25864
    2000  5  |    3.00712   1.755081     1.71   0.087    -.4331593    6.447398
    2000  6  |    4.83455   1.818672     2.66   0.008     1.269622    8.399479
    2000  7  |   5.496908   1.342051     4.10   0.000     2.866243    8.127573
    2000  8  |   2.627769   1.423196     1.85   0.065    -.1619556    5.417493
    2000  9  |   6.464972   1.724488     3.75   0.000      3.08466    9.845284
    2000 10  |   5.255725    1.73507     3.03   0.002     1.854671    8.656779
    2000 11  |   5.627514   1.287003     4.37   0.000     3.104753    8.150276
    2000 12  |   4.978902    1.12883     4.41   0.000      2.76619    7.191614
    2000 13  |   3.377306   1.213983     2.78   0.005     .9976777    5.756934
    2000 14  |  (omitted)
    2001  2  |   2.069487   1.324585     1.56   0.118    -.5269413    4.665915
    2001  3  |   .9552895   .7535002     1.27   0.205    -.5217083    2.432287
    2001  4  |   9.776793   1.809632     5.40   0.000     6.229585      13.324
    2001  5  |   3.644122   1.803495     2.02   0.043     .1089419    7.179302
    2001  6  |   5.959152   1.827339     3.26   0.001     2.377234     9.54107
    2001  7  |   6.522289   1.282335     5.09   0.000     4.008679    9.035899
    2001  8  |   4.550483   1.357873     3.35   0.001     1.888805    7.212162
    2001  9  |    7.51859   1.778233     4.23   0.000     4.032928    11.00425
    2001 10  |   6.689745   1.786869     3.74   0.000     3.187157    10.19233
    2001 11  |   6.895142   1.421569     4.85   0.000     4.108608    9.681676
    2001 12  |   6.141053   1.230941     4.99   0.000     3.728185    8.553921
    2001 13  |     4.3521   1.282381     3.39   0.001       1.8384      6.8658
    2001 14  |  -1.396196   1.406876    -0.99   0.321     -4.15393    1.361538
    2002  2  |   2.973994   1.326062     2.24   0.025     .3746693    5.573318
    2002  3  |   -.210668   .7907518    -0.27   0.790    -1.760686     1.33935
    2002  4  |   7.760173   1.759866     4.41   0.000     4.310513    11.20983
    2002  5  |   .5371049   1.767329     0.30   0.761    -2.927182    4.001392
    2002  6  |   4.899893   1.781899     2.75   0.006     1.407045     8.39274
    2002  7  |   3.838785   1.004417     3.82   0.000     1.869945    5.807625
    2002  8  |   2.716468    1.43638     1.89   0.059     -.099099    5.532034
    2002  9  |   6.470847   1.740783     3.72   0.000     3.058594      9.8831
    2002 10  |   5.760446    1.75463     3.28   0.001      2.32105    9.199842
    2002 11  |   4.732347   1.258359     3.76   0.000     2.265734     7.19896
    2002 12  |    4.98967    1.21099     4.12   0.000     2.615909    7.363431
    2002 13  |   5.257853   1.237177     4.25   0.000      2.83276    7.682946
    2002 14  |  -5.921144   1.445007    -4.10   0.000    -8.753621   -3.088666
    2003  2  |   1.303285   1.289145     1.01   0.312    -1.223674    3.830243
    2003  3  |   -2.89704   .8728842    -3.32   0.001    -4.608052   -1.186028
    2003  4  |   5.398601    1.74871     3.09   0.002      1.97081    8.826392
    2003  5  |  -.6248617   1.759986    -0.36   0.723    -4.074755    2.825031
    2003  6  |   3.019989   1.769169     1.71   0.088    -.4479045    6.487883
    2003  7  |  (omitted)
    2003  8  |   .6336323   1.512618     0.42   0.675    -2.331375    3.598639
    2003  9  |   4.187416   1.733947     2.41   0.016      .788563     7.58627
    2003 10  |   3.311271   1.746058     1.90   0.058    -.1113214    6.733863
    2003 11  |   2.684147   1.233601     2.18   0.030     .2660631    5.102231
    2003 12  |   3.984815   1.235318     3.23   0.001     1.563367    6.406263
    2003 13  |   2.223159   1.257311     1.77   0.077    -.2414011    4.687718
    2003 14  |  -3.035466   1.451699    -2.09   0.037    -5.881059   -.1898717
    2004  2  |   .1056934   1.318123     0.08   0.936    -2.478069    2.689456
    2004  3  |  -4.955128   .9224457    -5.37   0.000    -6.763289   -3.146966
    2004  4  |   3.586858   1.767038     2.03   0.042     .1231418    7.050574
    2004  5  |  -2.961303   1.771028    -1.67   0.095     -6.43284    .5102342
    2004  6  |   .6798949    1.79095     0.38   0.704    -2.830695    4.190485
    2004  7  |    -.70937   .7906807    -0.90   0.370    -2.259248    .8405085
    2004  8  |   .1613175   1.442123     0.11   0.911    -2.665507    2.988142
    2004  9  |   2.341874   1.740337     1.35   0.178    -1.069503    5.753251
    2004 10  |    1.31126   1.754622     0.75   0.455     -2.12812    4.750639
    2004 11  |  -.0169239   1.226439    -0.01   0.989    -2.420968    2.387121
    2004 12  |   2.426096   1.306792     1.86   0.063    -.1354546    4.987646
    2004 13  |   2.595453   1.310655     1.98   0.048     .0263309    5.164576
    2004 14  |   -5.74186   1.504032    -3.82   0.000    -8.690037   -2.793683
    2005  2  |   3.423175     1.2929     2.65   0.008     .8888558    5.957494
    2005  3  |  -3.094767    .854363    -3.62   0.000    -4.769474   -1.420059
    2005  4  |   5.236792   1.774064     2.95   0.003     1.759303    8.714282
    2005  5  |   .6217714   1.761533     0.35   0.724    -2.831154    4.074697
    2005  6  |   3.116477   1.803734     1.73   0.084    -.4191705    6.652125
    2005  7  |   1.203162   1.179446     1.02   0.308    -1.108766    3.515091
    2005  8  |   .9345486   1.587655     0.59   0.556    -2.177544    4.046641
    2005  9  |    4.29618    1.74752     2.46   0.014     .8707224    7.721637
    2005 10  |   3.557452   1.752859     2.03   0.042      .121529    6.993375
    2005 11  |   .3904702   1.336852     0.29   0.770    -2.230004    3.010944
    2005 12  |    4.55661   1.259656     3.62   0.000     2.087454    7.025766
    2005 13  |   5.038321   1.340051     3.76   0.000     2.411577    7.665066
    2005 14  |   -.550202   1.429347    -0.38   0.700    -3.351983    2.251579
    2006  2  |   4.263079   1.416368     3.01   0.003     1.486739    7.039419
    2006  3  |  -5.681331   1.037992    -5.47   0.000    -7.715985   -3.646678
    2006  4  |   2.226796   1.847496     1.21   0.228    -1.394633    5.848225
    2006  5  |  -.6775606   1.822913    -0.37   0.710    -4.250803    2.895681
    2006  6  |   .4169954   1.855086     0.22   0.822    -3.219311    4.053301
    2006  7  |   .4855433   1.799637     0.27   0.787    -3.042074     4.01316
    2006  8  |   1.262727   1.635779     0.77   0.440    -1.943699    4.469153
    2006  9  |   .9029627   1.807231     0.50   0.617     -2.63954    4.445466
    2006 10  |   1.846257   1.813605     1.02   0.309    -1.708741    5.401254
    2006 11  |  -2.838013    1.59103    -1.78   0.074    -5.956722    .2806967
    2006 12  |   3.338395   1.487469     2.24   0.025     .4226845    6.254105
    2006 13  |   3.154396    1.45908     2.16   0.031     .2943329    6.014459
    2006 14  |  -4.120252   1.607002    -2.56   0.010     -7.27027    -.970234
    2007  1  |  (empty)  
    2007  2  |  -3.290695    1.64167    -2.00   0.045    -6.508668   -.0727217
    2007  3  |  -6.538774   1.719273    -3.80   0.000    -9.908863   -3.168685
    2007  4  |  (omitted)
    2007  5  |  (omitted)
    2007  6  |  (omitted)
    2007  7  |  -2.399032   2.003036    -1.20   0.231    -6.325348    1.527284
    2007  8  |  (omitted)
    2007  9  |  (omitted)
    2007 10  |  (omitted)
    2007 11  |  -2.149526   1.601563    -1.34   0.180    -5.288883    .9898296
    2007 12  |   .9969713    1.47635     0.68   0.500    -1.896944    3.890887
    2007 13  |   3.028156   1.672865     1.81   0.070    -.2509644    6.307277
    2007 14  |  -5.244308    2.17927    -2.41   0.016    -9.516075    -.972542
             |
       _cons |   8.245751   1.919635     4.30   0.000     4.482916    12.00859
-------------+----------------------------------------------------------------
     sigma_u |  44.159894
     sigma_e |  10.881813
         rho |  .94275403   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg osr_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.year y
> ear#mscode if ![country=="DAN" & year==2007], fe vce(cluster pid)
variable osr_prop not found
r(111);

. xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.yea
> r year#mscode if ![country=="DAN" & year==2007], fe vce(cluster pid)
note: 2007.year omitted because of collinearity
note: 1999b.year#2.mscode omitted because of collinearity
note: 1999b.year#8.mscode omitted because of collinearity
note: 1999b.year#11.mscode omitted because of collinearity
note: 1999b.year#12.mscode omitted because of collinearity
note: 1999b.year#13.mscode omitted because of collinearity
note: 2000.year#3.mscode omitted because of collinearity
note: 2000.year#14.mscode omitted because of collinearity
note: 2003.year#7.mscode omitted because of collinearity
note: 2007.year#4.mscode omitted because of collinearity
note: 2007.year#5.mscode omitted because of collinearity
note: 2007.year#6.mscode omitted because of collinearity
note: 2007.year#8.mscode omitted because of collinearity
note: 2007.year#9.mscode omitted because of collinearity
note: 2007.year#10.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     78180
Group variable: pid                             Number of groups   =     10863

R-sq:  within  = 0.0355                         Obs per group: min =         2
       between = 0.0008                                        avg =       7.2
       overall = 0.0037                                        max =         9

                                                F(118,10862)       =     14.75
corr(u_i, Xb)  = -0.1778                        Prob > F           =    0.0000

                                (Std. Err. adjusted for 10863 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
 osrape_prop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |    .015642   .0177923     0.88   0.379    -.0192342    .0505182
   sizeclass |  -.0019215   .0008726    -2.20   0.028     -.003632   -.0002111
 setasideuaa |  -.0003858   .0000424    -9.11   0.000    -.0004688   -.0003027
   ln_labour |  -.0028814   .0013228    -2.18   0.029    -.0054743   -.0002886
      ln_ffi |   -.000114   .0000975    -1.17   0.242    -.0003051    .0000771
    solvency |  -.0000255   .0021356    -0.01   0.990    -.0042116    .0041606
   intensity |  -.0130828   .0084615    -1.55   0.122    -.0296687    .0035032
  specialise |   .0010501   .0011068     0.95   0.343    -.0011195    .0032197
             |
        year |
       2000  |  -.0342888   .0071139    -4.82   0.000    -.0482334   -.0203442
       2001  |  -.0397395   .0075014    -5.30   0.000    -.0544436   -.0250355
       2002  |  -.0437083   .0067363    -6.49   0.000    -.0569127   -.0305039
       2003  |  -.0316787   .0070444    -4.50   0.000     -.045487   -.0178704
       2004  |  -.0362587   .0190798    -1.90   0.057    -.0736586    .0011412
       2005  |  -.0465461   .0192377    -2.42   0.016    -.0842555   -.0088366
       2006  |  -.0335227    .019264    -1.74   0.082    -.0712837    .0042384
       2007  |  (omitted)
             |
 year#mscode |
    1999  2  |  (omitted)
    1999  3  |  -.0305661   .0073812    -4.14   0.000    -.0450345   -.0160976
    1999  4  |   .0355894   .0181411     1.96   0.050     .0000295    .0711493
    1999  5  |   .0217836   .0179473     1.21   0.225    -.0133963    .0569636
    1999  6  |   .0168799   .0196771     0.86   0.391    -.0216909    .0554506
    1999  7  |   .0089138   .0102011     0.87   0.382    -.0110821    .0289098
    1999  8  |  (omitted)
    1999  9  |   .0159308   .0178872     0.89   0.373    -.0191313     .050993
    1999 10  |   .0313988   .0184297     1.70   0.088    -.0047269    .0675244
    1999 11  |  (omitted)
    1999 12  |  (omitted)
    1999 13  |  (omitted)
    1999 14  |  -.0236357   .0084013    -2.81   0.005    -.0401039   -.0071676
    2000  2  |    .016756   .0073265     2.29   0.022     .0023946    .0311173
    2000  3  |  (omitted)
    2000  4  |   .0571801   .0194618     2.94   0.003     .0190314    .0953287
    2000  5  |   .0418283    .019282     2.17   0.030     .0040321    .0796244
    2000  6  |   .0472475   .0206675     2.29   0.022     .0067353    .0877597
    2000  7  |   .0247605   .0075464     3.28   0.001     .0099683    .0395527
    2000  8  |   .0078287   .0150398     0.52   0.603    -.0216521    .0373095
    2000  9  |   .0502771   .0192474     2.61   0.009     .0125486    .0880055
    2000 10  |   .0466011   .0196664     2.37   0.018     .0080513    .0851508
    2000 11  |   .0374185   .0083887     4.46   0.000     .0209752    .0538618
    2000 12  |   .0316092   .0089748     3.52   0.000      .014017    .0492015
    2000 13  |   .0174751    .008468     2.06   0.039     .0008763    .0340738
    2000 14  |  (omitted)
    2001  2  |   .0221923   .0077398     2.87   0.004     .0070209    .0373638
    2001  3  |   .0004852   .0049764     0.10   0.922    -.0092694    .0102399
    2001  4  |   .0664086   .0196014     3.39   0.001     .0279863    .1048309
    2001  5  |   .0409875   .0194278     2.11   0.035     .0029055    .0790695
    2001  6  |   .0458541   .0196517     2.33   0.020     .0073331    .0843751
    2001  7  |   .0384389   .0077488     4.96   0.000     .0232498     .053628
    2001  8  |   .0177116   .0124312     1.42   0.154    -.0066558    .0420791
    2001  9  |   .0536654   .0193588     2.77   0.006     .0157186    .0916123
    2001 10  |   .0550553   .0197162     2.79   0.005     .0164079    .0937027
    2001 11  |   .0410049   .0097956     4.19   0.000     .0218037    .0602062
    2001 12  |   .0360223   .0099569     3.62   0.000     .0165049    .0555397
    2001 13  |   .0209286   .0087941     2.38   0.017     .0036905    .0381667
    2001 14  |   -.010239    .007338    -1.40   0.163    -.0246228    .0041448
    2002  2  |   .0371985   .0069923     5.32   0.000     .0234923    .0509048
    2002  3  |   .0061648   .0046668     1.32   0.187    -.0029829    .0153126
    2002  4  |   .0576168   .0192504     2.99   0.003     .0198824    .0953512
    2002  5  |   .0290136   .0191174     1.52   0.129      -.00846    .0664871
    2002  6  |   .0510102   .0193489     2.64   0.008     .0130828    .0889377
    2002  7  |   .0114819   .0051938     2.21   0.027     .0013011    .0216627
    2002  8  |   .0126613   .0144649     0.88   0.381    -.0156926    .0410151
    2002  9  |   .0575969   .0190644     3.02   0.003     .0202272    .0949666
    2002 10  |   .0605057   .0195185     3.10   0.002     .0222459    .0987654
    2002 11  |   .0383009   .0084421     4.54   0.000     .0217528     .054849
    2002 12  |   .0371434   .0098895     3.76   0.000     .0177582    .0565286
    2002 13  |   .0403453   .0082195     4.91   0.000     .0242336     .056457
    2002 14  |  -.0158241    .007151    -2.21   0.027    -.0298415   -.0018068
    2003  2  |   .0250198   .0072996     3.43   0.001     .0107112    .0393283
    2003  3  |  -.0115607   .0054517    -2.12   0.034    -.0222469   -.0008744
    2003  4  |   .0434951   .0193692     2.25   0.025      .005528    .0814623
    2003  5  |   .0246274   .0192305     1.28   0.200    -.0130678    .0623227
    2003  6  |   .0411623   .0195626     2.10   0.035      .002816    .0795085
    2003  7  |  (omitted)
    2003  8  |   .0029017     .01664     0.17   0.862    -.0297157    .0355192
    2003  9  |   .0462262   .0191629     2.41   0.016     .0086633     .083789
    2003 10  |   .0443419   .0195574     2.27   0.023     .0060059    .0826779
    2003 11  |    .029763   .0086849     3.43   0.001     .0127391     .046787
    2003 12  |    .036713   .0100512     3.65   0.000     .0170109    .0564152
    2003 13  |   .0219474   .0088673     2.48   0.013     .0045659    .0393289
    2003 14  |  -.0044008   .0076051    -0.58   0.563    -.0193082    .0105067
    2004  2  |   .0164485   .0071778     2.29   0.022     .0023786    .0305183
    2004  3  |  -.0244223    .005491    -4.45   0.000    -.0351857    -.013659
    2004  4  |   .0336414    .019302     1.74   0.081    -.0041941     .071477
    2004  5  |   .0105734   .0191633     0.55   0.581    -.0269901    .0481369
    2004  6  |   .0268556   .0194318     1.38   0.167    -.0112343    .0649455
    2004  7  |  -.0093788   .0064129    -1.46   0.144    -.0219492    .0031916
    2004  8  |   .0163858   .0149097     1.10   0.272    -.0128398    .0456115
    2004  9  |   .0356987   .0190941     1.87   0.062    -.0017293    .0731267
    2004 10  |   .0318678    .019464     1.64   0.102    -.0062851    .0700208
    2004 11  |   .0117453   .0084773     1.39   0.166    -.0048718    .0283624
    2004 12  |   .0324014   .0114042     2.84   0.005      .010047    .0547557
    2004 13  |   .0272297   .0086992     3.13   0.002     .0101777    .0442817
    2004 14  |  -.0202166   .0075246    -2.69   0.007    -.0349662   -.0054669
    2005  2  |   .0284941   .0075698     3.76   0.000     .0136559    .0433323
    2005  3  |  -.0140371   .0055091    -2.55   0.011    -.0248359   -.0032382
    2005  4  |   .0386482   .0194409     1.99   0.047     .0005404     .076756
    2005  5  |   .0295442   .0193102     1.53   0.126    -.0083074    .0673958
    2005  6  |   .0481276   .0210425     2.29   0.022     .0068805    .0893747
    2005  7  |  -.0001195   .0056756    -0.02   0.983    -.0112446    .0110057
    2005  8  |   .0125714   .0157063     0.80   0.423    -.0182158    .0433585
    2005  9  |   .0459717   .0192618     2.39   0.017      .008215    .0837284
    2005 10  |   .0473997    .019509     2.43   0.015     .0091585    .0856409
    2005 11  |   .0144694   .0099285     1.46   0.145    -.0049923    .0339311
    2005 12  |   .0436548   .0110295     3.96   0.000     .0220351    .0652746
    2005 13  |   .0406831   .0091914     4.43   0.000     .0226663    .0586999
    2005 14  |  -.0009283    .007542    -0.12   0.902     -.015712    .0138554
    2006  2  |   .0332392   .0077126     4.31   0.000      .018121    .0483574
    2006  3  |  -.0229322    .005682    -4.04   0.000    -.0340699   -.0117945
    2006  4  |   .0221023    .019453     1.14   0.256    -.0160292    .0602337
    2006  5  |   .0253266   .0193326     1.31   0.190    -.0125689     .063222
    2006  6  |   .0308798   .0197309     1.57   0.118    -.0077963    .0695559
    2006  7  |  -.0059476   .0067239    -0.88   0.376    -.0191278    .0072325
    2006  8  |   .0122142    .014873     0.82   0.412    -.0169396    .0413679
    2006  9  |   .0324455   .0192782     1.68   0.092    -.0053432    .0702343
    2006 10  |   .0497737    .019517     2.55   0.011     .0115168    .0880306
    2006 11  |  -.0018484   .0098246    -0.19   0.851    -.0211065    .0174096
    2006 12  |   .0422991   .0111102     3.81   0.000     .0205211    .0640771
    2006 13  |   .0372974    .009635     3.87   0.000     .0184111    .0561836
    2006 14  |   -.015076   .0079745    -1.89   0.059    -.0307074    .0005555
    2007  1  |  (empty)  
    2007  2  |  -.0196647   .0179556    -1.10   0.273    -.0548609    .0155315
    2007  3  |  -.0543263   .0193206    -2.81   0.005    -.0921981   -.0164544
    2007  4  |  (omitted)
    2007  5  |  (omitted)
    2007  6  |  (omitted)
    2007  7  |  -.0551881   .0198417    -2.78   0.005    -.0940814   -.0162949
    2007  8  |  (omitted)
    2007  9  |  (omitted)
    2007 10  |  (omitted)
    2007 11  |  -.0281686   .0191363    -1.47   0.141    -.0656792     .009342
    2007 12  |  -.0081058   .0194278    -0.42   0.677    -.0461878    .0299763
    2007 13  |   .0019264   .0188931     0.10   0.919    -.0351076    .0389604
    2007 14  |  -.0511547   .0201229    -2.54   0.011    -.0905992   -.0117101
             |
       _cons |   .1186099   .0138683     8.55   0.000     .0914256    .1457943
-------------+----------------------------------------------------------------
     sigma_u |  .09376565
     sigma_e |  .05594731
         rho |  .73745378   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.yea
> r year#mscode if ![country=="DAN" & year==2007], fe vce(robust)
note: 2007.year omitted because of collinearity
note: 1999b.year#2.mscode omitted because of collinearity
note: 1999b.year#8.mscode omitted because of collinearity
note: 1999b.year#11.mscode omitted because of collinearity
note: 1999b.year#12.mscode omitted because of collinearity
note: 1999b.year#13.mscode omitted because of collinearity
note: 2000.year#3.mscode omitted because of collinearity
note: 2000.year#14.mscode omitted because of collinearity
note: 2003.year#7.mscode omitted because of collinearity
note: 2007.year#4.mscode omitted because of collinearity
note: 2007.year#5.mscode omitted because of collinearity
note: 2007.year#6.mscode omitted because of collinearity
note: 2007.year#8.mscode omitted because of collinearity
note: 2007.year#9.mscode omitted because of collinearity
note: 2007.year#10.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     78180
Group variable: pid                             Number of groups   =     10863

R-sq:  within  = 0.0355                         Obs per group: min =         2
       between = 0.0008                                        avg =       7.2
       overall = 0.0037                                        max =         9

                                                F(118,10862)       =     14.75
corr(u_i, Xb)  = -0.1778                        Prob > F           =    0.0000

                                (Std. Err. adjusted for 10863 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
 osrape_prop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |    .015642   .0177923     0.88   0.379    -.0192342    .0505182
   sizeclass |  -.0019215   .0008726    -2.20   0.028     -.003632   -.0002111
 setasideuaa |  -.0003858   .0000424    -9.11   0.000    -.0004688   -.0003027
   ln_labour |  -.0028814   .0013228    -2.18   0.029    -.0054743   -.0002886
      ln_ffi |   -.000114   .0000975    -1.17   0.242    -.0003051    .0000771
    solvency |  -.0000255   .0021356    -0.01   0.990    -.0042116    .0041606
   intensity |  -.0130828   .0084615    -1.55   0.122    -.0296687    .0035032
  specialise |   .0010501   .0011068     0.95   0.343    -.0011195    .0032197
             |
        year |
       2000  |  -.0342888   .0071139    -4.82   0.000    -.0482334   -.0203442
       2001  |  -.0397395   .0075014    -5.30   0.000    -.0544436   -.0250355
       2002  |  -.0437083   .0067363    -6.49   0.000    -.0569127   -.0305039
       2003  |  -.0316787   .0070444    -4.50   0.000     -.045487   -.0178704
       2004  |  -.0362587   .0190798    -1.90   0.057    -.0736586    .0011412
       2005  |  -.0465461   .0192377    -2.42   0.016    -.0842555   -.0088366
       2006  |  -.0335227    .019264    -1.74   0.082    -.0712837    .0042384
       2007  |  (omitted)
             |
 year#mscode |
    1999  2  |  (omitted)
    1999  3  |  -.0305661   .0073812    -4.14   0.000    -.0450345   -.0160976
    1999  4  |   .0355894   .0181411     1.96   0.050     .0000295    .0711493
    1999  5  |   .0217836   .0179473     1.21   0.225    -.0133963    .0569636
    1999  6  |   .0168799   .0196771     0.86   0.391    -.0216909    .0554506
    1999  7  |   .0089138   .0102011     0.87   0.382    -.0110821    .0289098
    1999  8  |  (omitted)
    1999  9  |   .0159308   .0178872     0.89   0.373    -.0191313     .050993
    1999 10  |   .0313988   .0184297     1.70   0.088    -.0047269    .0675244
    1999 11  |  (omitted)
    1999 12  |  (omitted)
    1999 13  |  (omitted)
    1999 14  |  -.0236357   .0084013    -2.81   0.005    -.0401039   -.0071676
    2000  2  |    .016756   .0073265     2.29   0.022     .0023946    .0311173
    2000  3  |  (omitted)
    2000  4  |   .0571801   .0194618     2.94   0.003     .0190314    .0953287
    2000  5  |   .0418283    .019282     2.17   0.030     .0040321    .0796244
    2000  6  |   .0472475   .0206675     2.29   0.022     .0067353    .0877597
    2000  7  |   .0247605   .0075464     3.28   0.001     .0099683    .0395527
    2000  8  |   .0078287   .0150398     0.52   0.603    -.0216521    .0373095
    2000  9  |   .0502771   .0192474     2.61   0.009     .0125486    .0880055
    2000 10  |   .0466011   .0196664     2.37   0.018     .0080513    .0851508
    2000 11  |   .0374185   .0083887     4.46   0.000     .0209752    .0538618
    2000 12  |   .0316092   .0089748     3.52   0.000      .014017    .0492015
    2000 13  |   .0174751    .008468     2.06   0.039     .0008763    .0340738
    2000 14  |  (omitted)
    2001  2  |   .0221923   .0077398     2.87   0.004     .0070209    .0373638
    2001  3  |   .0004852   .0049764     0.10   0.922    -.0092694    .0102399
    2001  4  |   .0664086   .0196014     3.39   0.001     .0279863    .1048309
    2001  5  |   .0409875   .0194278     2.11   0.035     .0029055    .0790695
    2001  6  |   .0458541   .0196517     2.33   0.020     .0073331    .0843751
    2001  7  |   .0384389   .0077488     4.96   0.000     .0232498     .053628
    2001  8  |   .0177116   .0124312     1.42   0.154    -.0066558    .0420791
    2001  9  |   .0536654   .0193588     2.77   0.006     .0157186    .0916123
    2001 10  |   .0550553   .0197162     2.79   0.005     .0164079    .0937027
    2001 11  |   .0410049   .0097956     4.19   0.000     .0218037    .0602062
    2001 12  |   .0360223   .0099569     3.62   0.000     .0165049    .0555397
    2001 13  |   .0209286   .0087941     2.38   0.017     .0036905    .0381667
    2001 14  |   -.010239    .007338    -1.40   0.163    -.0246228    .0041448
    2002  2  |   .0371985   .0069923     5.32   0.000     .0234923    .0509048
    2002  3  |   .0061648   .0046668     1.32   0.187    -.0029829    .0153126
    2002  4  |   .0576168   .0192504     2.99   0.003     .0198824    .0953512
    2002  5  |   .0290136   .0191174     1.52   0.129      -.00846    .0664871
    2002  6  |   .0510102   .0193489     2.64   0.008     .0130828    .0889377
    2002  7  |   .0114819   .0051938     2.21   0.027     .0013011    .0216627
    2002  8  |   .0126613   .0144649     0.88   0.381    -.0156926    .0410151
    2002  9  |   .0575969   .0190644     3.02   0.003     .0202272    .0949666
    2002 10  |   .0605057   .0195185     3.10   0.002     .0222459    .0987654
    2002 11  |   .0383009   .0084421     4.54   0.000     .0217528     .054849
    2002 12  |   .0371434   .0098895     3.76   0.000     .0177582    .0565286
    2002 13  |   .0403453   .0082195     4.91   0.000     .0242336     .056457
    2002 14  |  -.0158241    .007151    -2.21   0.027    -.0298415   -.0018068
    2003  2  |   .0250198   .0072996     3.43   0.001     .0107112    .0393283
    2003  3  |  -.0115607   .0054517    -2.12   0.034    -.0222469   -.0008744
    2003  4  |   .0434951   .0193692     2.25   0.025      .005528    .0814623
    2003  5  |   .0246274   .0192305     1.28   0.200    -.0130678    .0623227
    2003  6  |   .0411623   .0195626     2.10   0.035      .002816    .0795085
    2003  7  |  (omitted)
    2003  8  |   .0029017     .01664     0.17   0.862    -.0297157    .0355192
    2003  9  |   .0462262   .0191629     2.41   0.016     .0086633     .083789
    2003 10  |   .0443419   .0195574     2.27   0.023     .0060059    .0826779
    2003 11  |    .029763   .0086849     3.43   0.001     .0127391     .046787
    2003 12  |    .036713   .0100512     3.65   0.000     .0170109    .0564152
    2003 13  |   .0219474   .0088673     2.48   0.013     .0045659    .0393289
    2003 14  |  -.0044008   .0076051    -0.58   0.563    -.0193082    .0105067
    2004  2  |   .0164485   .0071778     2.29   0.022     .0023786    .0305183
    2004  3  |  -.0244223    .005491    -4.45   0.000    -.0351857    -.013659
    2004  4  |   .0336414    .019302     1.74   0.081    -.0041941     .071477
    2004  5  |   .0105734   .0191633     0.55   0.581    -.0269901    .0481369
    2004  6  |   .0268556   .0194318     1.38   0.167    -.0112343    .0649455
    2004  7  |  -.0093788   .0064129    -1.46   0.144    -.0219492    .0031916
    2004  8  |   .0163858   .0149097     1.10   0.272    -.0128398    .0456115
    2004  9  |   .0356987   .0190941     1.87   0.062    -.0017293    .0731267
    2004 10  |   .0318678    .019464     1.64   0.102    -.0062851    .0700208
    2004 11  |   .0117453   .0084773     1.39   0.166    -.0048718    .0283624
    2004 12  |   .0324014   .0114042     2.84   0.005      .010047    .0547557
    2004 13  |   .0272297   .0086992     3.13   0.002     .0101777    .0442817
    2004 14  |  -.0202166   .0075246    -2.69   0.007    -.0349662   -.0054669
    2005  2  |   .0284941   .0075698     3.76   0.000     .0136559    .0433323
    2005  3  |  -.0140371   .0055091    -2.55   0.011    -.0248359   -.0032382
    2005  4  |   .0386482   .0194409     1.99   0.047     .0005404     .076756
    2005  5  |   .0295442   .0193102     1.53   0.126    -.0083074    .0673958
    2005  6  |   .0481276   .0210425     2.29   0.022     .0068805    .0893747
    2005  7  |  -.0001195   .0056756    -0.02   0.983    -.0112446    .0110057
    2005  8  |   .0125714   .0157063     0.80   0.423    -.0182158    .0433585
    2005  9  |   .0459717   .0192618     2.39   0.017      .008215    .0837284
    2005 10  |   .0473997    .019509     2.43   0.015     .0091585    .0856409
    2005 11  |   .0144694   .0099285     1.46   0.145    -.0049923    .0339311
    2005 12  |   .0436548   .0110295     3.96   0.000     .0220351    .0652746
    2005 13  |   .0406831   .0091914     4.43   0.000     .0226663    .0586999
    2005 14  |  -.0009283    .007542    -0.12   0.902     -.015712    .0138554
    2006  2  |   .0332392   .0077126     4.31   0.000      .018121    .0483574
    2006  3  |  -.0229322    .005682    -4.04   0.000    -.0340699   -.0117945
    2006  4  |   .0221023    .019453     1.14   0.256    -.0160292    .0602337
    2006  5  |   .0253266   .0193326     1.31   0.190    -.0125689     .063222
    2006  6  |   .0308798   .0197309     1.57   0.118    -.0077963    .0695559
    2006  7  |  -.0059476   .0067239    -0.88   0.376    -.0191278    .0072325
    2006  8  |   .0122142    .014873     0.82   0.412    -.0169396    .0413679
    2006  9  |   .0324455   .0192782     1.68   0.092    -.0053432    .0702343
    2006 10  |   .0497737    .019517     2.55   0.011     .0115168    .0880306
    2006 11  |  -.0018484   .0098246    -0.19   0.851    -.0211065    .0174096
    2006 12  |   .0422991   .0111102     3.81   0.000     .0205211    .0640771
    2006 13  |   .0372974    .009635     3.87   0.000     .0184111    .0561836
    2006 14  |   -.015076   .0079745    -1.89   0.059    -.0307074    .0005555
    2007  1  |  (empty)  
    2007  2  |  -.0196647   .0179556    -1.10   0.273    -.0548609    .0155315
    2007  3  |  -.0543263   .0193206    -2.81   0.005    -.0921981   -.0164544
    2007  4  |  (omitted)
    2007  5  |  (omitted)
    2007  6  |  (omitted)
    2007  7  |  -.0551881   .0198417    -2.78   0.005    -.0940814   -.0162949
    2007  8  |  (omitted)
    2007  9  |  (omitted)
    2007 10  |  (omitted)
    2007 11  |  -.0281686   .0191363    -1.47   0.141    -.0656792     .009342
    2007 12  |  -.0081058   .0194278    -0.42   0.677    -.0461878    .0299763
    2007 13  |   .0019264   .0188931     0.10   0.919    -.0351076    .0389604
    2007 14  |  -.0511547   .0201229    -2.54   0.011    -.0905992   -.0117101
             |
       _cons |   .1186099   .0138683     8.55   0.000     .0914256    .1457943
-------------+----------------------------------------------------------------
     sigma_u |  .09376565
     sigma_e |  .05594731
         rho |  .73745378   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.yea
> r year#mscode if ![country=="DAN" & year==2007] & adopter==1, fe vce(robust)
note: 2006.year omitted because of collinearity
note: 1999b.year#9.mscode omitted because of collinearity
note: 1999b.year#10.mscode omitted because of collinearity
note: 1999b.year#12.mscode omitted because of collinearity
note: 1999b.year#13.mscode omitted because of collinearity
note: 2000.year#5.mscode omitted because of collinearity
note: 2000.year#8.mscode omitted because of collinearity
note: 2000.year#14.mscode omitted because of collinearity
note: 2001.year#2.mscode omitted because of collinearity
note: 2007.year#4.mscode omitted because of collinearity
note: 2007.year#7.mscode omitted because of collinearity
note: 2007.year#11.mscode omitted because of collinearity
note: 2007.year#12.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     13614
Group variable: pid                             Number of groups   =      1783

R-sq:  within  = 0.1158                         Obs per group: min =         2
       between = 0.0154                                        avg =       7.6
       overall = 0.0004                                        max =         9

                                                F(87,1782)         =         .
corr(u_i, Xb)  = -0.3596                        Prob > F           =         .

                                 (Std. Err. adjusted for 1783 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
 osrape_prop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |  -.0113792   .0179809    -0.63   0.527     -.046645    .0238866
   sizeclass |   .0008157   .0030163     0.27   0.787    -.0051001    .0067315
 setasideuaa |  -.0005478   .0000881    -6.22   0.000    -.0007206    -.000375
   ln_labour |  -.0051092   .0035435    -1.44   0.150     -.012059    .0018406
      ln_ffi |   .0002994   .0002116     1.41   0.157    -.0001157    .0007145
    solvency |   .0035825    .004226     0.85   0.397    -.0047058    .0118709
   intensity |  -.0123959   .0193796    -0.64   0.522     -.050405    .0256132
  specialise |   .0259168   .0097241     2.67   0.008     .0068449    .0449886
             |
        year |
       2000  |  -.0773497   .0180037    -4.30   0.000    -.1126603   -.0420391
       2001  |  -.0769077   .0175476    -4.38   0.000    -.1113238   -.0424917
       2002  |   -.076586    .017583    -4.36   0.000    -.1110715   -.0421006
       2003  |  -.0515942   .0180616    -2.86   0.004    -.0870184     -.01617
       2004  |  -.0092182   .0085575    -1.08   0.282    -.0260021    .0075656
       2005  |  -.0267345   .0079717    -3.35   0.001    -.0423695   -.0110995
       2006  |  (omitted)
       2007  |   .0331483    .047473     0.70   0.485    -.0599603    .1262569
             |
 year#mscode |
    1999  2  |  -.0601841   .0178958    -3.36   0.001     -.095283   -.0250852
    1999  4  |  -.0441717    .068641    -0.64   0.520     -.178797    .0904536
    1999  5  |  -.0655198   .0181783    -3.60   0.000    -.1011728   -.0298668
    1999  7  |   .1236596   .0713255     1.73   0.083    -.0162307      .26355
    1999  8  |  -.0623957   .0265323    -2.35   0.019    -.1144334    -.010358
    1999  9  |  (omitted)
    1999 10  |  (omitted)
    1999 11  |  -.0019742     .07052    -0.03   0.978    -.1402847    .1363364
    1999 12  |  (omitted)
    1999 13  |  (omitted)
    1999 14  |  -.0308842   .0262048    -1.18   0.239    -.0822795    .0205111
    2000  2  |  -.0008202   .0100169    -0.08   0.935    -.0204663    .0188259
    2000  4  |   .0121943   .0767176     0.16   0.874    -.1382716    .1626601
    2000  5  |  (omitted)
    2000  7  |   .2299929   .0902452     2.55   0.011     .0529954    .4069904
    2000  8  |  (omitted)
    2000  9  |    .077182   .0179985     4.29   0.000     .0418816    .1124823
    2000 10  |    .065631   .0187373     3.50   0.000     .0288815    .1023804
    2000 11  |   .0570072   .0715028     0.80   0.425     -.083231    .1972455
    2000 12  |   .0950291   .0650689     1.46   0.144    -.0325903    .2226485
    2000 13  |   .0686188   .0199098     3.45   0.001     .0295699    .1076677
    2000 14  |  (omitted)
    2001  2  |  (omitted)
    2001  4  |  -.0224583   .0950679    -0.24   0.813    -.2089147     .163998
    2001  5  |  -.0078074    .009877    -0.79   0.429     -.027179    .0115643
    2001  7  |     .09349   .0501119     1.87   0.062    -.0047942    .1917742
    2001  8  |   .0089208   .0125342     0.71   0.477    -.0156624     .033504
    2001  9  |   .0753041   .0176668     4.26   0.000     .0406543     .109954
    2001 10  |   .0671821   .0183724     3.66   0.000     .0311483    .1032158
    2001 11  |   .0170115   .0758164     0.22   0.822     -.131687      .16571
    2001 12  |   .0425671   .0532365     0.80   0.424    -.0618454    .1469795
    2001 13  |   .0610841    .020789     2.94   0.003     .0203108    .1018574
    2001 14  |  -.0295189   .0220918    -1.34   0.182    -.0728475    .0138096
    2002  2  |   .0165195   .0091444     1.81   0.071    -.0014155    .0344544
    2002  4  |  -.0512099   .0872617    -0.59   0.557    -.2223559    .1199362
    2002  5  |  -.0240384    .009466    -2.54   0.011    -.0426041   -.0054728
    2002  7  |   .1137871   .0924156     1.23   0.218    -.0674671    .2950414
    2002  8  |  -.0030586   .0175789    -0.17   0.862     -.037536    .0314189
    2002  9  |   .0754905   .0177398     4.26   0.000     .0406975    .1102835
    2002 10  |   .0609135   .0188477     3.23   0.001     .0239476    .0978793
    2002 11  |   .1430448   .0738744     1.94   0.053    -.0018449    .2879345
    2002 12  |   .0178901   .0460508     0.39   0.698    -.0724292    .1082094
    2002 13  |    .063662   .0210624     3.02   0.003     .0223524    .1049716
    2002 14  |  -.0271821   .0229577    -1.18   0.237    -.0722088    .0178447
    2003  2  |  -.0091508   .0107324    -0.85   0.394    -.0302003    .0118987
    2003  4  |  -.0684599   .0850996    -0.80   0.421    -.2353654    .0984457
    2003  5  |  -.0435869   .0109859    -3.97   0.000    -.0651335   -.0220403
    2003  7  |  -.0355754   .0508394    -0.70   0.484    -.1352865    .0641358
    2003  8  |  -.0383293   .0171691    -2.23   0.026     -.072003   -.0046556
    2003  9  |    .049541   .0182056     2.72   0.007     .0138344    .0852476
    2003 10  |   .0342171   .0192111     1.78   0.075    -.0034615    .0718957
    2003 11  |   .0260593   .0974021     0.27   0.789    -.1649752    .2170937
    2003 12  |   .0398055   .0632712     0.63   0.529     -.084288    .1638991
    2003 13  |   .0402157   .0214945     1.87   0.062    -.0019413    .0823728
    2003 14  |  -.0292472   .0241097    -1.21   0.225    -.0765334    .0180391
    2004  2  |  -.0335382   .0096544    -3.47   0.001    -.0524733   -.0146031
    2004  4  |  -.1067358   .0875804    -1.22   0.223    -.2785069    .0650354
    2004  5  |  -.0742347    .012558    -5.91   0.000    -.0988647   -.0496048
    2004  7  |  -.0450908   .0521475    -0.86   0.387    -.1473676    .0571859
    2004  8  |  -.0530529   .0170564    -3.11   0.002    -.0865056   -.0196003
    2004  9  |   .0201514   .0179837     1.12   0.263    -.0151201    .0554228
    2004 10  |   .0077728   .0193813     0.40   0.688    -.0302397    .0457852
    2004 11  |   .0643125   .0643106     1.00   0.317    -.0618196    .1904446
    2004 12  |   .0280372   .0380126     0.74   0.461    -.0465167    .1025911
    2004 13  |   .0434306   .0202652     2.14   0.032     .0036844    .0831767
    2004 14  |  -.0413135   .0249093    -1.66   0.097    -.0901681    .0075411
    2005  2  |  -.0079383   .0086964    -0.91   0.361    -.0249946     .009118
    2005  4  |  -.0839617   .0876941    -0.96   0.338    -.2559558    .0880323
    2005  5  |  -.0454278   .0120066    -3.78   0.000    -.0689763   -.0218794
    2005  7  |  -.0150489   .0522432    -0.29   0.773    -.1175132    .0874154
    2005  8  |  -.0328012   .0169394    -1.94   0.053    -.0660244     .000422
    2005  9  |   .0379679   .0183082     2.07   0.038     .0020601    .0738756
    2005 10  |   .0240375   .0195966     1.23   0.220    -.0143973    .0624723
    2005 11  |  -.1168366   .0817483    -1.43   0.153    -.2771692    .0434961
    2005 12  |   .0368223   .0339682     1.08   0.279    -.0297994     .103444
    2005 13  |    .080063   .0220935     3.62   0.000     .0367311    .1233948
    2005 14  |  -.0143939   .0230729    -0.62   0.533    -.0596467    .0308589
    2006  2  |  -.0105341   .0087643    -1.20   0.230    -.0277234    .0066553
    2006  4  |  -.0590545   .0835313    -0.71   0.480    -.2228841    .1047751
    2006  5  |  -.0589521   .0108308    -5.44   0.000    -.0801945   -.0377097
    2006  7  |   .0141844   .0522604     0.27   0.786    -.0883138    .1166825
    2006  8  |  -.0316217    .015659    -2.02   0.044    -.0623335   -.0009098
    2006  9  |   .0067302   .0181442     0.37   0.711    -.0288561    .0423164
    2006 10  |   .0122346   .0196826     0.62   0.534    -.0263689    .0508381
    2006 11  |  -.1325441   .0760127    -1.74   0.081    -.2816276    .0165393
    2006 12  |   .0514816   .0511213     1.01   0.314    -.0487824    .1517455
    2006 13  |   .0600714   .0237232     2.53   0.011     .0135433    .1065996
    2006 14  |  -.0283925   .0253917    -1.12   0.264    -.0781932    .0214083
    2007  1  |  (empty)  
    2007  2  |  -.0872828   .0474542    -1.84   0.066    -.1803545    .0057889
    2007  4  |  (omitted)
    2007  5  |  -.0787143   .0475782    -1.65   0.098    -.1720293    .0146007
    2007  7  |  (omitted)
    2007  8  |  -.0523867   .0530883    -0.99   0.324    -.1565085    .0517352
    2007  9  |  -.0255691    .043997    -0.58   0.561    -.1118603    .0607221
    2007 10  |  -.0439528   .0444151    -0.99   0.323    -.1310639    .0431584
    2007 11  |  (omitted)
    2007 12  |  (omitted)
    2007 13  |   .0258941   .0456403     0.57   0.571    -.0636201    .1154083
    2007 14  |  -.1026225   .0519733    -1.97   0.048    -.2045575   -.0006875
             |
       _cons |   .2315567   .0412624     5.61   0.000     .1506289    .3124845
-------------+----------------------------------------------------------------
     sigma_u |  .10097043
     sigma_e |  .05273883
         rho |  .78565844   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.yea
> r year#mscode if ![country=="DAN" & year==2007] & adopter==1, fe vce(cluster pid)
note: 2006.year omitted because of collinearity
note: 1999b.year#9.mscode omitted because of collinearity
note: 1999b.year#10.mscode omitted because of collinearity
note: 1999b.year#12.mscode omitted because of collinearity
note: 1999b.year#13.mscode omitted because of collinearity
note: 2000.year#5.mscode omitted because of collinearity
note: 2000.year#8.mscode omitted because of collinearity
note: 2000.year#14.mscode omitted because of collinearity
note: 2001.year#2.mscode omitted because of collinearity
note: 2007.year#4.mscode omitted because of collinearity
note: 2007.year#7.mscode omitted because of collinearity
note: 2007.year#11.mscode omitted because of collinearity
note: 2007.year#12.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     13614
Group variable: pid                             Number of groups   =      1783

R-sq:  within  = 0.1158                         Obs per group: min =         2
       between = 0.0154                                        avg =       7.6
       overall = 0.0004                                        max =         9

                                                F(87,1782)         =         .
corr(u_i, Xb)  = -0.3596                        Prob > F           =         .

                                 (Std. Err. adjusted for 1783 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
 osrape_prop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |  -.0113792   .0179809    -0.63   0.527     -.046645    .0238866
   sizeclass |   .0008157   .0030163     0.27   0.787    -.0051001    .0067315
 setasideuaa |  -.0005478   .0000881    -6.22   0.000    -.0007206    -.000375
   ln_labour |  -.0051092   .0035435    -1.44   0.150     -.012059    .0018406
      ln_ffi |   .0002994   .0002116     1.41   0.157    -.0001157    .0007145
    solvency |   .0035825    .004226     0.85   0.397    -.0047058    .0118709
   intensity |  -.0123959   .0193796    -0.64   0.522     -.050405    .0256132
  specialise |   .0259168   .0097241     2.67   0.008     .0068449    .0449886
             |
        year |
       2000  |  -.0773497   .0180037    -4.30   0.000    -.1126603   -.0420391
       2001  |  -.0769077   .0175476    -4.38   0.000    -.1113238   -.0424917
       2002  |   -.076586    .017583    -4.36   0.000    -.1110715   -.0421006
       2003  |  -.0515942   .0180616    -2.86   0.004    -.0870184     -.01617
       2004  |  -.0092182   .0085575    -1.08   0.282    -.0260021    .0075656
       2005  |  -.0267345   .0079717    -3.35   0.001    -.0423695   -.0110995
       2006  |  (omitted)
       2007  |   .0331483    .047473     0.70   0.485    -.0599603    .1262569
             |
 year#mscode |
    1999  2  |  -.0601841   .0178958    -3.36   0.001     -.095283   -.0250852
    1999  4  |  -.0441717    .068641    -0.64   0.520     -.178797    .0904536
    1999  5  |  -.0655198   .0181783    -3.60   0.000    -.1011728   -.0298668
    1999  7  |   .1236596   .0713255     1.73   0.083    -.0162307      .26355
    1999  8  |  -.0623957   .0265323    -2.35   0.019    -.1144334    -.010358
    1999  9  |  (omitted)
    1999 10  |  (omitted)
    1999 11  |  -.0019742     .07052    -0.03   0.978    -.1402847    .1363364
    1999 12  |  (omitted)
    1999 13  |  (omitted)
    1999 14  |  -.0308842   .0262048    -1.18   0.239    -.0822795    .0205111
    2000  2  |  -.0008202   .0100169    -0.08   0.935    -.0204663    .0188259
    2000  4  |   .0121943   .0767176     0.16   0.874    -.1382716    .1626601
    2000  5  |  (omitted)
    2000  7  |   .2299929   .0902452     2.55   0.011     .0529954    .4069904
    2000  8  |  (omitted)
    2000  9  |    .077182   .0179985     4.29   0.000     .0418816    .1124823
    2000 10  |    .065631   .0187373     3.50   0.000     .0288815    .1023804
    2000 11  |   .0570072   .0715028     0.80   0.425     -.083231    .1972455
    2000 12  |   .0950291   .0650689     1.46   0.144    -.0325903    .2226485
    2000 13  |   .0686188   .0199098     3.45   0.001     .0295699    .1076677
    2000 14  |  (omitted)
    2001  2  |  (omitted)
    2001  4  |  -.0224583   .0950679    -0.24   0.813    -.2089147     .163998
    2001  5  |  -.0078074    .009877    -0.79   0.429     -.027179    .0115643
    2001  7  |     .09349   .0501119     1.87   0.062    -.0047942    .1917742
    2001  8  |   .0089208   .0125342     0.71   0.477    -.0156624     .033504
    2001  9  |   .0753041   .0176668     4.26   0.000     .0406543     .109954
    2001 10  |   .0671821   .0183724     3.66   0.000     .0311483    .1032158
    2001 11  |   .0170115   .0758164     0.22   0.822     -.131687      .16571
    2001 12  |   .0425671   .0532365     0.80   0.424    -.0618454    .1469795
    2001 13  |   .0610841    .020789     2.94   0.003     .0203108    .1018574
    2001 14  |  -.0295189   .0220918    -1.34   0.182    -.0728475    .0138096
    2002  2  |   .0165195   .0091444     1.81   0.071    -.0014155    .0344544
    2002  4  |  -.0512099   .0872617    -0.59   0.557    -.2223559    .1199362
    2002  5  |  -.0240384    .009466    -2.54   0.011    -.0426041   -.0054728
    2002  7  |   .1137871   .0924156     1.23   0.218    -.0674671    .2950414
    2002  8  |  -.0030586   .0175789    -0.17   0.862     -.037536    .0314189
    2002  9  |   .0754905   .0177398     4.26   0.000     .0406975    .1102835
    2002 10  |   .0609135   .0188477     3.23   0.001     .0239476    .0978793
    2002 11  |   .1430448   .0738744     1.94   0.053    -.0018449    .2879345
    2002 12  |   .0178901   .0460508     0.39   0.698    -.0724292    .1082094
    2002 13  |    .063662   .0210624     3.02   0.003     .0223524    .1049716
    2002 14  |  -.0271821   .0229577    -1.18   0.237    -.0722088    .0178447
    2003  2  |  -.0091508   .0107324    -0.85   0.394    -.0302003    .0118987
    2003  4  |  -.0684599   .0850996    -0.80   0.421    -.2353654    .0984457
    2003  5  |  -.0435869   .0109859    -3.97   0.000    -.0651335   -.0220403
    2003  7  |  -.0355754   .0508394    -0.70   0.484    -.1352865    .0641358
    2003  8  |  -.0383293   .0171691    -2.23   0.026     -.072003   -.0046556
    2003  9  |    .049541   .0182056     2.72   0.007     .0138344    .0852476
    2003 10  |   .0342171   .0192111     1.78   0.075    -.0034615    .0718957
    2003 11  |   .0260593   .0974021     0.27   0.789    -.1649752    .2170937
    2003 12  |   .0398055   .0632712     0.63   0.529     -.084288    .1638991
    2003 13  |   .0402157   .0214945     1.87   0.062    -.0019413    .0823728
    2003 14  |  -.0292472   .0241097    -1.21   0.225    -.0765334    .0180391
    2004  2  |  -.0335382   .0096544    -3.47   0.001    -.0524733   -.0146031
    2004  4  |  -.1067358   .0875804    -1.22   0.223    -.2785069    .0650354
    2004  5  |  -.0742347    .012558    -5.91   0.000    -.0988647   -.0496048
    2004  7  |  -.0450908   .0521475    -0.86   0.387    -.1473676    .0571859
    2004  8  |  -.0530529   .0170564    -3.11   0.002    -.0865056   -.0196003
    2004  9  |   .0201514   .0179837     1.12   0.263    -.0151201    .0554228
    2004 10  |   .0077728   .0193813     0.40   0.688    -.0302397    .0457852
    2004 11  |   .0643125   .0643106     1.00   0.317    -.0618196    .1904446
    2004 12  |   .0280372   .0380126     0.74   0.461    -.0465167    .1025911
    2004 13  |   .0434306   .0202652     2.14   0.032     .0036844    .0831767
    2004 14  |  -.0413135   .0249093    -1.66   0.097    -.0901681    .0075411
    2005  2  |  -.0079383   .0086964    -0.91   0.361    -.0249946     .009118
    2005  4  |  -.0839617   .0876941    -0.96   0.338    -.2559558    .0880323
    2005  5  |  -.0454278   .0120066    -3.78   0.000    -.0689763   -.0218794
    2005  7  |  -.0150489   .0522432    -0.29   0.773    -.1175132    .0874154
    2005  8  |  -.0328012   .0169394    -1.94   0.053    -.0660244     .000422
    2005  9  |   .0379679   .0183082     2.07   0.038     .0020601    .0738756
    2005 10  |   .0240375   .0195966     1.23   0.220    -.0143973    .0624723
    2005 11  |  -.1168366   .0817483    -1.43   0.153    -.2771692    .0434961
    2005 12  |   .0368223   .0339682     1.08   0.279    -.0297994     .103444
    2005 13  |    .080063   .0220935     3.62   0.000     .0367311    .1233948
    2005 14  |  -.0143939   .0230729    -0.62   0.533    -.0596467    .0308589
    2006  2  |  -.0105341   .0087643    -1.20   0.230    -.0277234    .0066553
    2006  4  |  -.0590545   .0835313    -0.71   0.480    -.2228841    .1047751
    2006  5  |  -.0589521   .0108308    -5.44   0.000    -.0801945   -.0377097
    2006  7  |   .0141844   .0522604     0.27   0.786    -.0883138    .1166825
    2006  8  |  -.0316217    .015659    -2.02   0.044    -.0623335   -.0009098
    2006  9  |   .0067302   .0181442     0.37   0.711    -.0288561    .0423164
    2006 10  |   .0122346   .0196826     0.62   0.534    -.0263689    .0508381
    2006 11  |  -.1325441   .0760127    -1.74   0.081    -.2816276    .0165393
    2006 12  |   .0514816   .0511213     1.01   0.314    -.0487824    .1517455
    2006 13  |   .0600714   .0237232     2.53   0.011     .0135433    .1065996
    2006 14  |  -.0283925   .0253917    -1.12   0.264    -.0781932    .0214083
    2007  1  |  (empty)  
    2007  2  |  -.0872828   .0474542    -1.84   0.066    -.1803545    .0057889
    2007  4  |  (omitted)
    2007  5  |  -.0787143   .0475782    -1.65   0.098    -.1720293    .0146007
    2007  7  |  (omitted)
    2007  8  |  -.0523867   .0530883    -0.99   0.324    -.1565085    .0517352
    2007  9  |  -.0255691    .043997    -0.58   0.561    -.1118603    .0607221
    2007 10  |  -.0439528   .0444151    -0.99   0.323    -.1310639    .0431584
    2007 11  |  (omitted)
    2007 12  |  (omitted)
    2007 13  |   .0258941   .0456403     0.57   0.571    -.0636201    .1154083
    2007 14  |  -.1026225   .0519733    -1.97   0.048    -.2045575   -.0006875
             |
       _cons |   .2315567   .0412624     5.61   0.000     .1506289    .3124845
-------------+----------------------------------------------------------------
     sigma_u |  .10097043
     sigma_e |  .05273883
         rho |  .78565844   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. drop if year==2007
(7460 observations deleted)

. xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.yea
> r year#mscode if adopter==1, fe vce(cluster pid)
note: 2004.year omitted because of collinearity
note: 1999b.year#2.mscode omitted because of collinearity
note: 1999b.year#4.mscode omitted because of collinearity
note: 1999b.year#8.mscode omitted because of collinearity
note: 2000.year#9.mscode omitted because of collinearity
note: 2000.year#10.mscode omitted because of collinearity
note: 2000.year#12.mscode omitted because of collinearity
note: 2000.year#14.mscode omitted because of collinearity
note: 2001.year#5.mscode omitted because of collinearity
note: 2004.year#7.mscode omitted because of collinearity
note: 2005.year#11.mscode omitted because of collinearity
note: 2006.year#13.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     12122
Group variable: pid                             Number of groups   =      1783

R-sq:  within  = 0.1195                         Obs per group: min =         1
       between = 0.0129                                        avg =       6.8
       overall = 0.0192                                        max =         8

                                                F(80,1782)         =         .
corr(u_i, Xb)  = -0.2892                        Prob > F           =         .

                                 (Std. Err. adjusted for 1783 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
 osrape_prop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |  -.0208266   .0177869    -1.17   0.242    -.0557119    .0140588
   sizeclass |   .0026805   .0029905     0.90   0.370    -.0031849    .0085458
 setasideuaa |  -.0006336    .000089    -7.12   0.000    -.0008082    -.000459
   ln_labour |  -.0042278   .0037536    -1.13   0.260    -.0115898    .0031342
      ln_ffi |    .000383   .0002147     1.78   0.075     -.000038     .000804
    solvency |   .0011217   .0026584     0.42   0.673    -.0040921    .0063356
   intensity |   .0110221   .0196105     0.56   0.574    -.0274399    .0494841
  specialise |   .0276665   .0114886     2.41   0.016     .0051339     .050199
             |
        year |
       2000  |  -.0780312   .0179824    -4.34   0.000    -.1133001   -.0427623
       2001  |  -.0774532   .0175209    -4.42   0.000    -.1118169   -.0430894
       2002  |  -.0762745   .0175572    -4.34   0.000    -.1107093   -.0418397
       2003  |   -.051424   .0180639    -2.85   0.004    -.0868525   -.0159954
       2004  |  (omitted)
       2005  |  -.0171902   .0078155    -2.20   0.028    -.0325186   -.0018618
       2006  |   .0088396   .0085934     1.03   0.304    -.0080147    .0256938
             |
 year#mscode |
    1999  2  |  (omitted)
    1999  4  |  (omitted)
    1999  5  |   -.058798   .0177609    -3.31   0.001    -.0936324   -.0239636
    1999  7  |   .1641596   .0834243     1.97   0.049     .0005398    .3277795
    1999  8  |  (omitted)
    1999  9  |  -.0778228   .0179773    -4.33   0.000    -.1130817   -.0425639
    1999 10  |  -.0665371   .0187066    -3.56   0.000    -.1032263   -.0298479
    1999 11  |   .1192031   .0371484     3.21   0.001      .046344    .1920622
    1999 12  |  -.0963106   .0653782    -1.47   0.141    -.2245367    .0319155
    1999 13  |  -.0613586   .0238172    -2.58   0.010    -.1080711   -.0146461
    1999 14  |  -.0321144   .0261852    -1.23   0.220    -.0834713    .0192426
    2000  2  |    .059549    .018304     3.25   0.001     .0236495    .0954486
    2000  4  |   .0642639   .0242706     2.65   0.008      .016662    .1118658
    2000  5  |   .0074228   .0099117     0.75   0.454    -.0120169    .0268626
    2000  7  |   .2700748   .0541818     4.98   0.000     .1638082    .3763413
    2000  8  |   .0625092     .02647     2.36   0.018     .0105937    .1144248
    2000  9  |  (omitted)
    2000 10  |  (omitted)
    2000 11  |   .1806515    .029833     6.06   0.000     .1221402    .2391628
    2000 12  |  (omitted)
    2000 13  |   .0082955   .0177331     0.47   0.640    -.0264843    .0430753
    2000 14  |  (omitted)
    2001  2  |   .0605087   .0178586     3.39   0.001     .0254827    .0955347
    2001  4  |   .0301812   .0366347     0.82   0.410    -.0416702    .1020326
    2001  5  |  (omitted)
    2001  7  |   .1346158   .0129473    10.40   0.000     .1092224    .1600092
    2001  8  |   .0713384   .0224529     3.18   0.002     .0273015    .1153753
    2001  9  |  -.0025241   .0099256    -0.25   0.799    -.0219912     .016943
    2001 10  |   .0016529   .0109316     0.15   0.880    -.0197873     .023093
    2001 11  |   .1400052   .0411023     3.41   0.001     .0593915     .220619
    2001 12  |   -.047999   .0297079    -1.62   0.106     -.106265     .010267
    2001 13  |   .0009689    .017653     0.05   0.956    -.0336539    .0355917
    2001 14  |  -.0262929   .0224935    -1.17   0.243    -.0704094    .0178235
    2002  2  |   .0764013   .0178976     4.27   0.000     .0412987    .1115039
    2002  4  |   .0134414   .0365496     0.37   0.713     -.058243    .0851259
    2002  5  |  -.0172235    .009222    -1.87   0.062    -.0353106    .0008636
    2002  7  |   .1554736   .0545166     2.85   0.004     .0485504    .2623967
    2002  8  |   .0618518   .0221905     2.79   0.005     .0183297    .1053738
    2002  9  |  -.0028989   .0094229    -0.31   0.758      -.02138    .0155822
    2002 10  |  -.0059324   .0114964    -0.52   0.606    -.0284802    .0166155
    2002 11  |   .2672448   .0603592     4.43   0.000     .1488626    .3856271
    2002 12  |  -.0743175   .0438237    -1.70   0.090    -.1602687    .0116336
    2002 13  |   .0030389   .0181437     0.17   0.867    -.0325463    .0386241
    2002 14  |  -.0254335   .0236258    -1.08   0.282    -.0717707    .0209037
    2003  2  |   .0511845   .0184006     2.78   0.005     .0150955    .0872735
    2003  4  |  -.0123148   .0343185    -0.36   0.720    -.0796237     .054994
    2003  5  |  -.0365691    .010746    -3.40   0.001    -.0576452    -.015493
    2003  7  |   .0115053   .0208461     0.55   0.581    -.0293801    .0523906
    2003  8  |   .0269799   .0223177     1.21   0.227    -.0167918    .0707515
    2003  9  |  -.0289296   .0109609    -2.64   0.008    -.0504271   -.0074321
    2003 10  |  -.0320457   .0124485    -2.57   0.010    -.0564609   -.0076305
    2003 11  |    .149035    .073584     2.03   0.043     .0047151     .293355
    2003 12  |   -.051993    .063265    -0.82   0.411    -.1760744    .0720884
    2003 13  |  -.0202573   .0200284    -1.01   0.312    -.0595388    .0190243
    2003 14  |  -.0267634   .0245312    -1.09   0.275    -.0748763    .0213495
    2004  2  |   .0266204   .0181498     1.47   0.143    -.0089768    .0622175
    2004  4  |  -.0404066   .0369501    -1.09   0.274    -.1128767    .0320636
    2004  5  |  -.0670959   .0096282    -6.97   0.000    -.0859797    -.048212
    2004  7  |  (omitted)
    2004  8  |   .0122803   .0230216     0.53   0.594    -.0328718    .0574324
    2004  9  |  -.0575533   .0124452    -4.62   0.000    -.0819619   -.0331447
    2004 10  |  -.0583532   .0144274    -4.04   0.000    -.0866496   -.0300569
    2004 11  |   .1866261   .0551301     3.39   0.001     .0784996    .2947526
    2004 12  |  -.0639632   .0598172    -1.07   0.285    -.1812824    .0533561
    2004 13  |  -.0165894   .0172395    -0.96   0.336    -.0504011    .0172223
    2004 14  |  -.0401217   .0259383    -1.55   0.122    -.0909944    .0107509
    2005  2  |   .0515907   .0184871     2.79   0.005     .0153321    .0878493
    2005  4  |  -.0172641    .037556    -0.46   0.646    -.0909225    .0563944
    2005  5  |  -.0383562   .0085678    -4.48   0.000    -.0551603   -.0215521
    2005  7  |   .0315445   .0083178     3.79   0.000     .0152307    .0478582
    2005  8  |   .0331552   .0204358     1.62   0.105    -.0069255    .0732359
    2005  9  |  -.0398936   .0120147    -3.32   0.001     -.063458   -.0163292
    2005 10  |  -.0422817   .0139715    -3.03   0.003    -.0696841   -.0148794
    2005 11  |  (omitted)
    2005 12  |  -.0544757   .0569493    -0.96   0.339    -.1661702    .0572188
    2005 13  |   .0197186   .0176628     1.12   0.264    -.0149233    .0543605
    2005 14  |  -.0132109   .0240425    -0.55   0.583    -.0603654    .0339436
    2006  2  |   .0500227   .0184966     2.70   0.007     .0137454       .0863
    2006  4  |  -.0001537   .0355145    -0.00   0.997    -.0698082    .0695007
    2006  5  |  -.0512801   .0085122    -6.02   0.000     -.067975   -.0345851
    2006  7  |   .0586115    .008696     6.74   0.000     .0415561    .0756669
    2006  8  |   .0353483   .0224087     1.58   0.115    -.0086019    .0792984
    2006  9  |   -.071301   .0106776    -6.68   0.000     -.092243    -.050359
    2006 10  |  -.0533337   .0133745    -3.99   0.000    -.0795651   -.0271022
    2006 11  |  -.0156631   .0653678    -0.24   0.811    -.1438687    .1125425
    2006 12  |  -.0401705   .0500746    -0.80   0.423    -.1383817    .0580406
    2006 13  |  (omitted)
    2006 14  |  -.0259337    .026068    -0.99   0.320    -.0770608    .0251935
             |
       _cons |   .1876276   .0412174     4.55   0.000     .1067882     .268467
-------------+----------------------------------------------------------------
     sigma_u |  .09867784
     sigma_e |  .05006051
         rho |  .79531337   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.
> year year#mscode if adopter==1, fe vce(cluster pid)
note: 2004.year omitted because of collinearity
note: 1999b.year#2.mscode omitted because of collinearity
note: 1999b.year#4.mscode omitted because of collinearity
note: 1999b.year#8.mscode omitted because of collinearity
note: 2000.year#9.mscode omitted because of collinearity
note: 2000.year#10.mscode omitted because of collinearity
note: 2000.year#12.mscode omitted because of collinearity
note: 2000.year#14.mscode omitted because of collinearity
note: 2001.year#5.mscode omitted because of collinearity
note: 2004.year#7.mscode omitted because of collinearity
note: 2005.year#11.mscode omitted because of collinearity
note: 2006.year#13.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     12122
Group variable: pid                             Number of groups   =      1783

R-sq:  within  = 0.1492                         Obs per group: min =         1
       between = 0.1413                                        avg =       6.8
       overall = 0.0936                                        max =         8

                                                F(80,1782)         =         .
corr(u_i, Xb)  = -0.5266                        Prob > F           =         .

                                 (Std. Err. adjusted for 1783 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
oilseedrap~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |   1.119073   3.504277     0.32   0.750    -5.753851    7.991996
   sizeclass |   4.333888   .6470111     6.70   0.000     3.064908    5.602869
 setasideuaa |  -.5722084    .182717    -3.13   0.002    -.9305705   -.2138462
   ln_labour |   2.165517    1.38873     1.56   0.119    -.5581944    4.889228
      ln_ffi |   .1415308    .086408     1.64   0.102    -.0279408    .3110024
    solvency |   .2939563   .7591129     0.39   0.699    -1.194889    1.782802
   intensity |   4.521674   4.858435     0.93   0.352    -5.007155     14.0505
  specialise |   8.518793   3.026087     2.82   0.005     2.583741    14.45385
             |
        year |
       2000  |   -11.1082   2.864888    -3.88   0.000    -16.72709   -5.489306
       2001  |  -12.37808   3.356749    -3.69   0.000    -18.96166     -5.7945
       2002  |  -9.708637   3.351754    -2.90   0.004    -16.28242   -3.134856
       2003  |  -3.895802    3.09987    -1.26   0.209    -9.975564     2.18396
       2004  |  (omitted)
       2005  |  -2.576307   2.060023    -1.25   0.211    -6.616622    1.464007
       2006  |   .8503823   3.239466     0.26   0.793    -5.503169    7.203934
             |
 year#mscode |
    1999  2  |  (omitted)
    1999  4  |  (omitted)
    1999  5  |  -10.65201   3.389715    -3.14   0.002    -17.30024   -4.003774
    1999  7  |    76.1867   24.29489     3.14   0.002     28.53721    123.8362
    1999  8  |  (omitted)
    1999  9  |  -11.03405   2.861224    -3.86   0.000    -16.64576   -5.422342
    1999 10  |  -11.02775   2.888041    -3.82   0.000    -16.69206   -5.363451
    1999 11  |   19.51642   6.583437     2.96   0.003     6.604347    32.42849
    1999 12  |  -9.915318   7.007815    -1.41   0.157    -23.65972    3.829082
    1999 13  |  -6.395237    5.83678    -1.10   0.273    -17.84289    5.052417
    1999 14  |  -.7868917   7.810456    -0.10   0.920    -16.10551    14.53173
    2000  2  |   3.909142   3.115834     1.25   0.210    -2.201932    10.02022
    2000  4  |   9.327801   4.088481     2.28   0.023      1.30908    17.34652
    2000  5  |  -1.146538   2.289018    -0.50   0.617     -5.63598    3.342904
    2000  7  |   69.24537   8.169104     8.48   0.000     53.22334     85.2674
    2000  8  |    10.6521   3.192864     3.34   0.001     4.389946    16.91425
    2000  9  |  (omitted)
    2000 10  |  (omitted)
    2000 11  |   32.52605   7.694028     4.23   0.000     17.43578    47.61632
    2000 12  |  (omitted)
    2000 13  |  -.4685222   4.505431    -0.10   0.917    -9.305007    8.367962
    2000 14  |  (omitted)
    2001  2  |   4.979779   3.786563     1.32   0.189    -2.446792    12.40635
    2001  4  |   7.767865   5.712058     1.36   0.174    -3.435172     18.9709
    2001  5  |  (omitted)
    2001  7  |   56.30588    7.09822     7.93   0.000     42.38417    70.22759
    2001  8  |   12.69755   3.575141     3.55   0.000     5.685643    19.70946
    2001  9  |   .9560656   2.370931     0.40   0.687    -3.694032    5.606163
    2001 10  |   .9092283   2.299089     0.40   0.693    -3.599967    5.418423
    2001 11  |   26.59237   6.607186     4.02   0.000     13.63372    39.55102
    2001 12  |  -1.768585   4.232861    -0.42   0.676    -10.07048    6.533309
    2001 13  |    1.87235   4.033476     0.46   0.643    -6.038491    9.783191
    2001 14  |  -4.035919   5.549592    -0.73   0.467    -14.92031    6.848473
    2002  2  |   5.367639   3.877544     1.38   0.166    -2.237374    12.97265
    2002  4  |   1.932721   5.873477     0.33   0.742    -9.586907    13.45235
    2002  5  |  -4.610072   1.918182    -2.40   0.016    -8.372194   -.8479487
    2002  7  |   43.72584   13.15724     3.32   0.001      17.9206    69.53108
    2002  8  |   8.030785   3.740274     2.15   0.032      .695001    15.36657
    2002  9  |  -.7622588   2.050303    -0.37   0.710    -4.783511    3.258993
    2002 10  |   -1.91176   2.007535    -0.95   0.341     -5.84913     2.02561
    2002 11  |   29.59535   7.006072     4.22   0.000     15.85437    43.33633
    2002 12  |  -6.789769   4.293919    -1.58   0.114    -15.21141    1.631877
    2002 13  |   1.660063   4.000808     0.41   0.678    -6.186706    9.506832
    2002 14  |  -13.47839   5.958293    -2.26   0.024    -25.16437   -1.792413
    2003  2  |   1.992905    3.45826     0.58   0.565    -4.789767    8.775577
    2003  4  |  -2.139383   5.561326    -0.38   0.701    -13.04679    8.768025
    2003  5  |  -9.357612   3.267975    -2.86   0.004    -15.76708   -2.948146
    2003  7  |   24.63673   14.06384     1.75   0.080    -2.946627    52.22009
    2003  8  |   2.749079   3.476662     0.79   0.429    -4.069685    9.567842
    2003  9  |  -7.274155   2.288551    -3.18   0.002    -11.76268   -2.785628
    2003 10  |  -7.536061   2.236635    -3.37   0.001    -11.92276   -3.149357
    2003 11  |   20.60212   5.237302     3.93   0.000     10.33022    30.87402
    2003 12  |  -8.689366   5.844267    -1.49   0.137     -20.1517    2.772972
    2003 13  |  -3.275672   3.860445    -0.85   0.396    -10.84715    4.295804
    2003 14  |  -12.49759   6.349893    -1.97   0.049    -24.95161   -.0435708
    2004  2  |  -1.922345   3.901985    -0.49   0.622    -9.575292    5.730602
    2004  4  |  -8.083108   6.197901    -1.30   0.192    -20.23903    4.072812
    2004  5  |  -14.51316   4.002356    -3.63   0.000    -22.36296    -6.66335
    2004  7  |  (omitted)
    2004  8  |  -1.752491    3.86118    -0.45   0.650    -9.325407    5.820426
    2004  9  |  -12.08161   2.820257    -4.28   0.000    -17.61297   -6.550255
    2004 10  |  -12.90811   2.830984    -4.56   0.000    -18.46051    -7.35571
    2004 11  |   21.37129   7.494486     2.85   0.004     6.672388     36.0702
    2004 12  |   -10.7575   5.282103    -2.04   0.042    -21.11727   -.3977349
    2004 13  |  -4.609642   4.342948    -1.06   0.289    -13.12745    3.908164
    2004 14  |  -11.62905   5.921968    -1.96   0.050    -23.24378    -.014319
    2005  2  |   5.086194   3.545656     1.43   0.152    -1.867888    12.04028
    2005  4  |  -2.719829   6.379693    -0.43   0.670     -15.2323    9.792639
    2005  5  |  -9.275176   2.847619    -3.26   0.001     -14.8602   -3.690151
    2005  7  |    12.3031   3.352675     3.67   0.000     5.727509    18.87869
    2005  8  |   .5721947   3.503577     0.16   0.870    -6.299358    7.443747
    2005  9  |  -8.472622   2.180384    -3.89   0.000      -12.749   -4.196244
    2005 10  |  -9.608938   2.152905    -4.46   0.000    -13.83142   -5.386453
    2005 11  |  (omitted)
    2005 12  |  -4.926648   6.019968    -0.82   0.413    -16.73359    6.880292
    2005 13  |   1.434333   3.909902     0.37   0.714    -6.234143    9.102809
    2005 14  |  -2.201482   6.471653    -0.34   0.734    -14.89431    10.49135
    2006  2  |   6.701903   3.923864     1.71   0.088    -.9939558    14.39776
    2006  4  |  -.0877757   6.294246    -0.01   0.989    -12.43266     12.2571
    2006  5  |  -10.64723    2.05775    -5.17   0.000    -14.68309   -6.611376
    2006  7  |   16.26338   3.765561     4.32   0.000     8.877998    23.64876
    2006  8  |    1.03416   3.925178     0.26   0.792    -6.664277    8.732597
    2006  9  |  -15.78012   2.281129    -6.92   0.000    -20.25409   -11.30615
    2006 10  |  -11.84109   2.173695    -5.45   0.000    -16.10435   -7.577828
    2006 11  |  -13.29308   7.970038    -1.67   0.096    -28.92469    2.338523
    2006 12  |  -5.231549   6.952475    -0.75   0.452    -18.86741    8.404313
    2006 13  |  (omitted)
    2006 14  |  -5.416963   5.858434    -0.92   0.355    -16.90709    6.073161
             |
       _cons |  -12.87073   12.97001    -0.99   0.321    -38.30875     12.5673
-------------+----------------------------------------------------------------
     sigma_u |  82.911998
     sigma_e |  16.728848
         rho |   .9608828   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.
> year year#mscode if adopter==1, fe vce(robust)
note: 2004.year omitted because of collinearity
note: 1999b.year#2.mscode omitted because of collinearity
note: 1999b.year#4.mscode omitted because of collinearity
note: 1999b.year#8.mscode omitted because of collinearity
note: 2000.year#9.mscode omitted because of collinearity
note: 2000.year#10.mscode omitted because of collinearity
note: 2000.year#12.mscode omitted because of collinearity
note: 2000.year#14.mscode omitted because of collinearity
note: 2001.year#5.mscode omitted because of collinearity
note: 2004.year#7.mscode omitted because of collinearity
note: 2005.year#11.mscode omitted because of collinearity
note: 2006.year#13.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     12122
Group variable: pid                             Number of groups   =      1783

R-sq:  within  = 0.1492                         Obs per group: min =         1
       between = 0.1413                                        avg =       6.8
       overall = 0.0936                                        max =         8

                                                F(80,1782)         =         .
corr(u_i, Xb)  = -0.5266                        Prob > F           =         .

                                 (Std. Err. adjusted for 1783 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
oilseedrap~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |   1.119073   3.504277     0.32   0.750    -5.753851    7.991996
   sizeclass |   4.333888   .6470111     6.70   0.000     3.064908    5.602869
 setasideuaa |  -.5722084    .182717    -3.13   0.002    -.9305705   -.2138462
   ln_labour |   2.165517    1.38873     1.56   0.119    -.5581944    4.889228
      ln_ffi |   .1415308    .086408     1.64   0.102    -.0279408    .3110024
    solvency |   .2939563   .7591129     0.39   0.699    -1.194889    1.782802
   intensity |   4.521674   4.858435     0.93   0.352    -5.007155     14.0505
  specialise |   8.518793   3.026087     2.82   0.005     2.583741    14.45385
             |
        year |
       2000  |   -11.1082   2.864888    -3.88   0.000    -16.72709   -5.489306
       2001  |  -12.37808   3.356749    -3.69   0.000    -18.96166     -5.7945
       2002  |  -9.708637   3.351754    -2.90   0.004    -16.28242   -3.134856
       2003  |  -3.895802    3.09987    -1.26   0.209    -9.975564     2.18396
       2004  |  (omitted)
       2005  |  -2.576307   2.060023    -1.25   0.211    -6.616622    1.464007
       2006  |   .8503823   3.239466     0.26   0.793    -5.503169    7.203934
             |
 year#mscode |
    1999  2  |  (omitted)
    1999  4  |  (omitted)
    1999  5  |  -10.65201   3.389715    -3.14   0.002    -17.30024   -4.003774
    1999  7  |    76.1867   24.29489     3.14   0.002     28.53721    123.8362
    1999  8  |  (omitted)
    1999  9  |  -11.03405   2.861224    -3.86   0.000    -16.64576   -5.422342
    1999 10  |  -11.02775   2.888041    -3.82   0.000    -16.69206   -5.363451
    1999 11  |   19.51642   6.583437     2.96   0.003     6.604347    32.42849
    1999 12  |  -9.915318   7.007815    -1.41   0.157    -23.65972    3.829082
    1999 13  |  -6.395237    5.83678    -1.10   0.273    -17.84289    5.052417
    1999 14  |  -.7868917   7.810456    -0.10   0.920    -16.10551    14.53173
    2000  2  |   3.909142   3.115834     1.25   0.210    -2.201932    10.02022
    2000  4  |   9.327801   4.088481     2.28   0.023      1.30908    17.34652
    2000  5  |  -1.146538   2.289018    -0.50   0.617     -5.63598    3.342904
    2000  7  |   69.24537   8.169104     8.48   0.000     53.22334     85.2674
    2000  8  |    10.6521   3.192864     3.34   0.001     4.389946    16.91425
    2000  9  |  (omitted)
    2000 10  |  (omitted)
    2000 11  |   32.52605   7.694028     4.23   0.000     17.43578    47.61632
    2000 12  |  (omitted)
    2000 13  |  -.4685222   4.505431    -0.10   0.917    -9.305007    8.367962
    2000 14  |  (omitted)
    2001  2  |   4.979779   3.786563     1.32   0.189    -2.446792    12.40635
    2001  4  |   7.767865   5.712058     1.36   0.174    -3.435172     18.9709
    2001  5  |  (omitted)
    2001  7  |   56.30588    7.09822     7.93   0.000     42.38417    70.22759
    2001  8  |   12.69755   3.575141     3.55   0.000     5.685643    19.70946
    2001  9  |   .9560656   2.370931     0.40   0.687    -3.694032    5.606163
    2001 10  |   .9092283   2.299089     0.40   0.693    -3.599967    5.418423
    2001 11  |   26.59237   6.607186     4.02   0.000     13.63372    39.55102
    2001 12  |  -1.768585   4.232861    -0.42   0.676    -10.07048    6.533309
    2001 13  |    1.87235   4.033476     0.46   0.643    -6.038491    9.783191
    2001 14  |  -4.035919   5.549592    -0.73   0.467    -14.92031    6.848473
    2002  2  |   5.367639   3.877544     1.38   0.166    -2.237374    12.97265
    2002  4  |   1.932721   5.873477     0.33   0.742    -9.586907    13.45235
    2002  5  |  -4.610072   1.918182    -2.40   0.016    -8.372194   -.8479487
    2002  7  |   43.72584   13.15724     3.32   0.001      17.9206    69.53108
    2002  8  |   8.030785   3.740274     2.15   0.032      .695001    15.36657
    2002  9  |  -.7622588   2.050303    -0.37   0.710    -4.783511    3.258993
    2002 10  |   -1.91176   2.007535    -0.95   0.341     -5.84913     2.02561
    2002 11  |   29.59535   7.006072     4.22   0.000     15.85437    43.33633
    2002 12  |  -6.789769   4.293919    -1.58   0.114    -15.21141    1.631877
    2002 13  |   1.660063   4.000808     0.41   0.678    -6.186706    9.506832
    2002 14  |  -13.47839   5.958293    -2.26   0.024    -25.16437   -1.792413
    2003  2  |   1.992905    3.45826     0.58   0.565    -4.789767    8.775577
    2003  4  |  -2.139383   5.561326    -0.38   0.701    -13.04679    8.768025
    2003  5  |  -9.357612   3.267975    -2.86   0.004    -15.76708   -2.948146
    2003  7  |   24.63673   14.06384     1.75   0.080    -2.946627    52.22009
    2003  8  |   2.749079   3.476662     0.79   0.429    -4.069685    9.567842
    2003  9  |  -7.274155   2.288551    -3.18   0.002    -11.76268   -2.785628
    2003 10  |  -7.536061   2.236635    -3.37   0.001    -11.92276   -3.149357
    2003 11  |   20.60212   5.237302     3.93   0.000     10.33022    30.87402
    2003 12  |  -8.689366   5.844267    -1.49   0.137     -20.1517    2.772972
    2003 13  |  -3.275672   3.860445    -0.85   0.396    -10.84715    4.295804
    2003 14  |  -12.49759   6.349893    -1.97   0.049    -24.95161   -.0435708
    2004  2  |  -1.922345   3.901985    -0.49   0.622    -9.575292    5.730602
    2004  4  |  -8.083108   6.197901    -1.30   0.192    -20.23903    4.072812
    2004  5  |  -14.51316   4.002356    -3.63   0.000    -22.36296    -6.66335
    2004  7  |  (omitted)
    2004  8  |  -1.752491    3.86118    -0.45   0.650    -9.325407    5.820426
    2004  9  |  -12.08161   2.820257    -4.28   0.000    -17.61297   -6.550255
    2004 10  |  -12.90811   2.830984    -4.56   0.000    -18.46051    -7.35571
    2004 11  |   21.37129   7.494486     2.85   0.004     6.672388     36.0702
    2004 12  |   -10.7575   5.282103    -2.04   0.042    -21.11727   -.3977349
    2004 13  |  -4.609642   4.342948    -1.06   0.289    -13.12745    3.908164
    2004 14  |  -11.62905   5.921968    -1.96   0.050    -23.24378    -.014319
    2005  2  |   5.086194   3.545656     1.43   0.152    -1.867888    12.04028
    2005  4  |  -2.719829   6.379693    -0.43   0.670     -15.2323    9.792639
    2005  5  |  -9.275176   2.847619    -3.26   0.001     -14.8602   -3.690151
    2005  7  |    12.3031   3.352675     3.67   0.000     5.727509    18.87869
    2005  8  |   .5721947   3.503577     0.16   0.870    -6.299358    7.443747
    2005  9  |  -8.472622   2.180384    -3.89   0.000      -12.749   -4.196244
    2005 10  |  -9.608938   2.152905    -4.46   0.000    -13.83142   -5.386453
    2005 11  |  (omitted)
    2005 12  |  -4.926648   6.019968    -0.82   0.413    -16.73359    6.880292
    2005 13  |   1.434333   3.909902     0.37   0.714    -6.234143    9.102809
    2005 14  |  -2.201482   6.471653    -0.34   0.734    -14.89431    10.49135
    2006  2  |   6.701903   3.923864     1.71   0.088    -.9939558    14.39776
    2006  4  |  -.0877757   6.294246    -0.01   0.989    -12.43266     12.2571
    2006  5  |  -10.64723    2.05775    -5.17   0.000    -14.68309   -6.611376
    2006  7  |   16.26338   3.765561     4.32   0.000     8.877998    23.64876
    2006  8  |    1.03416   3.925178     0.26   0.792    -6.664277    8.732597
    2006  9  |  -15.78012   2.281129    -6.92   0.000    -20.25409   -11.30615
    2006 10  |  -11.84109   2.173695    -5.45   0.000    -16.10435   -7.577828
    2006 11  |  -13.29308   7.970038    -1.67   0.096    -28.92469    2.338523
    2006 12  |  -5.231549   6.952475    -0.75   0.452    -18.86741    8.404313
    2006 13  |  (omitted)
    2006 14  |  -5.416963   5.858434    -0.92   0.355    -16.90709    6.073161
             |
       _cons |  -12.87073   12.97001    -0.99   0.321    -38.30875     12.5673
-------------+----------------------------------------------------------------
     sigma_u |  82.911998
     sigma_e |  16.728848
         rho |   .9608828   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.
> year year#mscode if adopt==1, fe vce(robust)
note: 2006.year omitted because of collinearity
note: 1999b.year#2.mscode omitted because of collinearity
note: 1999b.year#4.mscode omitted because of collinearity
note: 2003.year#7.mscode omitted because of collinearity
note: 2004.year#5.mscode omitted because of collinearity
note: 2005.year#14.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =       924
Group variable: pid                             Number of groups   =       156

R-sq:  within  = 0.2224                         Obs per group: min =         1
       between = 0.2533                                        avg =       5.9
       overall = 0.1418                                        max =         8

                                                F(25,155)          =         .
corr(u_i, Xb)  = -0.6477                        Prob > F           =         .

                                  (Std. Err. adjusted for 156 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
oilseedrap~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |   10.26663   4.549199     2.26   0.025     1.280199    19.25306
   sizeclass |   5.486633   1.832966     2.99   0.003     1.865815    9.107451
 setasideuaa |  -.4179877   .2219834    -1.88   0.062    -.8564908    .0205153
   ln_labour |  -1.087609   2.583537    -0.42   0.674    -6.191094    4.015876
      ln_ffi |   .0276687    .501231     0.06   0.956    -.9624564    1.017794
    solvency |  -8.004609   7.599336    -1.05   0.294    -23.01624    7.007021
   intensity |  -8.594878   15.44717    -0.56   0.579    -39.10902    21.91926
  specialise |   13.19311    9.42667     1.40   0.164    -5.428208    31.81444
             |
        year |
       2000  |  -17.32068   1.472411   -11.76   0.000    -20.22926    -14.4121
       2001  |  -.0622118   4.481092    -0.01   0.989    -8.914103    8.789679
       2002  |   .4381307   7.529379     0.06   0.954    -14.43531    15.31157
       2003  |  -7.372272    2.90079    -2.54   0.012    -13.10245   -1.642089
       2004  |   11.61456   4.227881     2.75   0.007      3.26286    19.96626
       2005  |   1.669222   5.471473     0.31   0.761    -9.139056     12.4775
       2006  |  (omitted)
             |
 year#mscode |
    1999  2  |  (omitted)
    1999  4  |  (omitted)
    1999  5  |   24.36296   3.112822     7.83   0.000     18.21393    30.51199
    1999  7  |   -1.87716   4.133514    -0.45   0.650    -10.04245     6.28813
    1999 14  |  (empty)  
    2000  2  |   10.19224   6.062441     1.68   0.095    -1.783434     22.1679
    2000  4  |   23.38484    6.07395     3.85   0.000     11.38644    35.38324
    2000  5  |   41.73857   2.608487    16.00   0.000      36.5858    46.89135
    2000  7  |   24.87884   3.781588     6.58   0.000     17.40874    32.34894
    2000 14  |  (empty)  
    2001  2  |  -10.61563   12.37303    -0.86   0.392    -35.05715     13.8259
    2001  4  |   8.402052   6.614105     1.27   0.206    -4.663366    21.46747
    2001  5  |   22.95535   4.508294     5.09   0.000     14.04972    31.86098
    2001  7  |  -2.536876   5.647062    -0.45   0.654    -13.69201    8.618258
    2001 14  |   -50.2749   9.519333    -5.28   0.000    -69.07927   -31.47053
    2002  2  |  -9.436465   13.17815    -0.72   0.475    -35.46841    16.59548
    2002  4  |  (empty)  
    2002  5  |   20.39244   7.520284     2.71   0.007     5.536963    35.24791
    2002  7  |   1.722823   9.590699     0.18   0.858    -17.22252    20.66817
    2002 14  |  (empty)  
    2003  2  |    8.81174    10.7497     0.82   0.414    -12.42308    30.04656
    2003  4  |  (empty)  
    2003  5  |   28.52914   2.883745     9.89   0.000     22.83263    34.22566
    2003  7  |  (omitted)
    2003 14  |  (empty)  
    2004  2  |   -12.7869   8.891008    -1.44   0.152    -30.35008    4.776288
    2004  4  |  (empty)  
    2004  5  |  (omitted)
    2004  7  |  (empty)  
    2004 14  |  (empty)  
    2005  2  |  -5.163059   10.48626    -0.49   0.623    -25.87749    15.55137
    2005  4  |  (empty)  
    2005  5  |   12.58365   6.561527     1.92   0.057    -.3779015    25.54521
    2005  7  |  (empty)  
    2005 14  |  (omitted)
    2006  2  |   18.02388   17.14224     1.05   0.295    -15.83868    51.88644
    2006  4  |  (empty)  
    2006  5  |    16.1942    4.34972     3.72   0.000     7.601824    24.78659
    2006  7  |  (empty)  
    2006 14  |  (empty)  
             |
       _cons |  -20.30868   27.06891    -0.75   0.454    -73.78026     33.1629
-------------+----------------------------------------------------------------
     sigma_u |  80.241535
     sigma_e |  13.216247
         rho |  .97358849   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.yea
> r year#mscode if adopt==1, fe vce(robust)
note: 2006.year omitted because of collinearity
note: 1999b.year#2.mscode omitted because of collinearity
note: 1999b.year#4.mscode omitted because of collinearity
note: 2003.year#7.mscode omitted because of collinearity
note: 2004.year#5.mscode omitted because of collinearity
note: 2005.year#14.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =       924
Group variable: pid                             Number of groups   =       156

R-sq:  within  = 0.2009                         Obs per group: min =         1
       between = 0.0779                                        avg =       5.9
       overall = 0.0701                                        max =         8

                                                F(25,155)          =         .
corr(u_i, Xb)  = -0.4303                        Prob > F           =         .

                                  (Std. Err. adjusted for 156 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
 osrape_prop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |   .0680354   .0237195     2.87   0.005     .0211802    .1148906
   sizeclass |   .0087489   .0096227     0.91   0.365    -.0102597    .0277575
 setasideuaa |   -.000652   .0003037    -2.15   0.033     -.001252    -.000052
   ln_labour |   -.000325   .0090914    -0.04   0.972    -.0182841    .0176341
      ln_ffi |   .0012636   .0013001     0.97   0.333    -.0013046    .0038318
    solvency |   -.008422   .0198071    -0.43   0.671    -.0475487    .0307047
   intensity |  -.0716194   .0731607    -0.98   0.329    -.2161402    .0729013
  specialise |   .0637194   .0366953     1.74   0.084     -.008768    .1362067
             |
        year |
       2000  |  -.1119904   .0029004   -38.61   0.000    -.1177198    -.106261
       2001  |  -.0235098   .0176404    -1.33   0.185    -.0583564    .0113369
       2002  |  -.0146983   .0384862    -0.38   0.703    -.0907234    .0613267
       2003  |  -.0547972    .025438    -2.15   0.033    -.1050472   -.0045473
       2004  |   .0478055   .0237052     2.02   0.045     .0009786    .0946324
       2005  |  -.0266095   .0400796    -0.66   0.508    -.1057822    .0525632
       2006  |  (omitted)
             |
 year#mscode |
    1999  2  |  (omitted)
    1999  4  |  (omitted)
    1999  5  |   .1358825   .0115977    11.72   0.000     .1129726    .1587924
    1999  7  |   .0533952   .0273023     1.96   0.052    -.0005375    .1073279
    1999 14  |  (empty)  
    2000  2  |   .0921128   .0131315     7.01   0.000      .066173    .1180525
    2000  4  |   .0958633   .0204097     4.70   0.000     .0555461    .1361804
    2000  5  |    .249211   .0098918    25.19   0.000      .229671    .2687511
    2000  7  |   .3846855   .0258432    14.89   0.000     .3336351    .4357359
    2000 14  |  (empty)  
    2001  2  |  -.0091534   .0232161    -0.39   0.694    -.0550142    .0367074
    2001  4  |   .0546466   .0269049     2.03   0.044     .0014991    .1077942
    2001  5  |    .148068   .0184506     8.03   0.000      .111621    .1845151
    2001  7  |   .0761778   .0228675     3.33   0.001     .0310057      .12135
    2001 14  |  -.0223102   .0584817    -0.38   0.703    -.1378342    .0932138
    2002  2  |  -.0071273   .0415401    -0.17   0.864    -.0891851    .0749304
    2002  4  |  (empty)  
    2002  5  |   .1218486   .0378162     3.22   0.002     .0471469    .1965503
    2002  7  |   .1779358   .0397867     4.47   0.000     .0993416    .2565299
    2002 14  |  (empty)  
    2003  2  |   .0547044   .0327887     1.67   0.097    -.0100661    .1194748
    2003  4  |  (empty)  
    2003  5  |   .1658638   .0249351     6.65   0.000     .1166074    .2151202
    2003  7  |  (omitted)
    2003 14  |  (empty)  
    2004  2  |  -.0950836   .0196157    -4.85   0.000    -.1338322   -.0563351
    2004  4  |  (empty)  
    2004  5  |  (omitted)
    2004  7  |  (empty)  
    2004 14  |  (empty)  
    2005  2  |  -.0069122    .049943    -0.14   0.890     -.105569    .0917445
    2005  4  |  (empty)  
    2005  5  |   .0858003   .0473365     1.81   0.072    -.0077077    .1793083
    2005  7  |  (empty)  
    2005 14  |  (omitted)
    2006  2  |  -.0230219   .0326195    -0.71   0.481    -.0874579    .0414142
    2006  4  |  (empty)  
    2006  5  |   .0696066   .0239188     2.91   0.004     .0223578    .1168554
    2006  7  |  (empty)  
    2006 14  |  (empty)  
             |
       _cons |  -.0448289   .1109556    -0.40   0.687    -.2640092    .1743515
-------------+----------------------------------------------------------------
     sigma_u |  .10102565
     sigma_e |  .04437673
         rho |  .83825735   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.yea
> r year#mscode if adopt==0, fe vce(robust)
note: 2006.year omitted because of collinearity
note: 1999b.year#2.mscode omitted because of collinearity
note: 1999b.year#3.mscode omitted because of collinearity
note: 1999b.year#4.mscode omitted because of collinearity
note: 1999b.year#7.mscode omitted because of collinearity
note: 1999b.year#9.mscode omitted because of collinearity
note: 1999b.year#10.mscode omitted because of collinearity
note: 1999b.year#12.mscode omitted because of collinearity
note: 1999b.year#13.mscode omitted because of collinearity
note: 1999b.year#14.mscode omitted because of collinearity
note: 2000.year#5.mscode omitted because of collinearity
note: 2000.year#6.mscode omitted because of collinearity
note: 2000.year#8.mscode omitted because of collinearity
note: 2006.year#11.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     69798
Group variable: pid                             Number of groups   =     10707

R-sq:  within  = 0.0377                         Obs per group: min =         1
       between = 0.0404                                        avg =       6.5
       overall = 0.0150                                        max =         8

                                                F(105,10706)       =     14.81
corr(u_i, Xb)  = -0.3415                        Prob > F           =    0.0000

                                (Std. Err. adjusted for 10707 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
 osrape_prop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |  -.0186504   .0074007    -2.52   0.012    -.0331571   -.0041437
   sizeclass |  -.0020934   .0009814    -2.13   0.033    -.0040171   -.0001697
 setasideuaa |  -.0004228   .0000484    -8.74   0.000    -.0005177    -.000328
   ln_labour |  -.0015974   .0014466    -1.10   0.270    -.0044329    .0012381
      ln_ffi |  -.0000346   .0001001    -0.35   0.729    -.0002309    .0001616
    solvency |  -.0004461    .001974    -0.23   0.821    -.0043155    .0034233
   intensity |   .0010315   .0089807     0.11   0.909    -.0165723    .0186354
  specialise |   .0011094   .0011032     1.01   0.315    -.0010531    .0032719
             |
        year |
       2000  |  -.0342017   .0071602    -4.78   0.000    -.0482371   -.0201663
       2001  |  -.0396978   .0075619    -5.25   0.000    -.0545205   -.0248751
       2002  |   -.043428   .0067921    -6.39   0.000    -.0567418   -.0301142
       2003  |  -.0312557   .0071029    -4.40   0.000    -.0451788   -.0173326
       2004  |  -.0023639   .0040641    -0.58   0.561    -.0103302    .0056025
       2005  |  -.0125662   .0043293    -2.90   0.004    -.0210524   -.0040801
       2006  |  (omitted)
             |
 year#mscode |
    1999  2  |  (omitted)
    1999  3  |  (omitted)
    1999  4  |  (omitted)
    1999  5  |  -.0192045   .0073885    -2.60   0.009    -.0336875   -.0047216
    1999  6  |  -.0300869   .0074721    -4.03   0.000    -.0447336   -.0154402
    1999  7  |  (omitted)
    1999  8  |  -.0076433   .0150206    -0.51   0.611    -.0370865    .0217998
    1999  9  |  (omitted)
    1999 10  |  (omitted)
    1999 11  |   .0008359    .009872     0.08   0.933     -.018515    .0201869
    1999 12  |  (omitted)
    1999 13  |  (omitted)
    1999 14  |  (omitted)
    2000  2  |   .0167118    .007372     2.27   0.023     .0022613    .0311623
    2000  3  |   .0303371   .0074228     4.09   0.000     .0157871    .0448871
    2000  4  |   .0220626   .0077056     2.86   0.004     .0069582     .037167
    2000  5  |  (omitted)
    2000  6  |  (omitted)
    2000  7  |   .0150233   .0097475     1.54   0.123    -.0040837    .0341303
    2000  8  |  (omitted)
    2000  9  |   .0341961   .0071625     4.77   0.000     .0201563     .048236
    2000 10  |   .0149303   .0077759     1.92   0.055    -.0003118    .0301724
    2000 11  |   .0383544   .0081518     4.71   0.000     .0223755    .0543334
    2000 12  |   .0311547   .0090174     3.45   0.001      .013479    .0488304
    2000 13  |   .0172226   .0085123     2.02   0.043      .000537    .0339082
    2000 14  |   .0235786   .0084381     2.79   0.005     .0070384    .0401188
    2001  2  |   .0221074   .0077962     2.84   0.005     .0068254    .0373895
    2001  3  |   .0311932   .0078587     3.97   0.000     .0157886    .0465979
    2001  4  |   .0313006   .0080278     3.90   0.000     .0155646    .0470366
    2001  5  |  -.0002083    .004814    -0.04   0.965    -.0096446    .0092281
    2001  6  |  -.0008357   .0081136    -0.10   0.918    -.0167398    .0150684
    2001  7  |   .0302752   .0107391     2.82   0.005     .0092246    .0513258
    2001  8  |   .0114101   .0111945     1.02   0.308    -.0105331    .0333534
    2001  9  |   .0374443   .0077145     4.85   0.000     .0223224    .0525662
    2001 10  |   .0236747   .0083219     2.84   0.004     .0073622    .0399871
    2001 11  |   .0420244   .0083291     5.05   0.000     .0256978    .0583509
    2001 12  |   .0358184    .010061     3.56   0.000      .016097    .0555397
    2001 13  |   .0206236   .0088502     2.33   0.020     .0032756    .0379715
    2001 14  |   .0141736   .0101087     1.40   0.161    -.0056413    .0339885
    2002  2  |   .0373948   .0070439     5.31   0.000     .0235875     .051202
    2002  3  |   .0365488   .0071395     5.12   0.000     .0225541    .0505436
    2002  4  |   .0223133   .0073482     3.04   0.002     .0079096    .0367171
    2002  5  |   -.012244   .0046053    -2.66   0.008    -.0212712   -.0032169
    2002  6  |   .0048117   .0077152     0.62   0.533    -.0103116    .0199349
    2002  7  |   .0023611   .0101781     0.23   0.817      -.01759    .0223121
    2002  8  |   .0058436   .0100516     0.58   0.561    -.0138594    .0255467
    2002  9  |   .0410704   .0069641     5.90   0.000     .0274195    .0547212
    2002 10  |   .0285164   .0079133     3.60   0.000     .0130049    .0440279
    2002 11  |   .0391408   .0063797     6.14   0.000     .0266354    .0516462
    2002 12  |   .0369843   .0100088     3.70   0.000     .0173651    .0566034
    2002 13  |   .0402018   .0082683     4.86   0.000     .0239944    .0564092
    2002 14  |   .0084935   .0094354     0.90   0.368    -.0100016    .0269887
    2003  2  |   .0249674   .0073547     3.39   0.001     .0105509     .039384
    2003  3  |   .0187188   .0075093     2.49   0.013     .0039992    .0334384
    2003  4  |   .0080528   .0076402     1.05   0.292    -.0069234     .023029
    2003  5  |  -.0164901   .0052568    -3.14   0.002    -.0267944   -.0061859
    2003  6  |  -.0049327    .006773    -0.73   0.466    -.0182091    .0083436
    2003  7  |  -.0092568   .0102169    -0.91   0.365    -.0292838    .0107702
    2003  8  |   -.003625   .0108912    -0.33   0.739    -.0249738    .0177238
    2003  9  |   .0295661   .0072668     4.07   0.000     .0153217    .0438104
    2003 10  |   .0128178   .0084787     1.51   0.131     -.003802    .0294375
    2003 11  |   .0307996   .0070423     4.37   0.000     .0169953    .0446039
    2003 12  |    .036239    .010134     3.58   0.000     .0163744    .0561036
    2003 13  |   .0217434   .0089142     2.44   0.015       .00427    .0392168
    2003 14  |   .0198358    .009657     2.05   0.040     .0009063    .0387652
    2004  2  |   .0166415   .0072064     2.31   0.021     .0025157    .0307674
    2004  3  |   .0067577   .0073522     0.92   0.358    -.0076539    .0211693
    2004  4  |  -.0010255   .0074461    -0.14   0.890    -.0156213    .0135703
    2004  5  |  -.0302472   .0052427    -5.77   0.000    -.0405239   -.0199706
    2004  6  |   -.018521   .0079123    -2.34   0.019    -.0340305   -.0030115
    2004  7  |  -.0182696   .0104466    -1.75   0.080    -.0387468    .0022076
    2004  8  |   .0106248   .0114905     0.92   0.355    -.0118988    .0331483
    2004  9  |   .0198923   .0070867     2.81   0.005     .0060011    .0337835
    2004 10  |   .0011628   .0083003     0.14   0.889    -.0151074    .0174329
    2004 11  |   .0132544   .0062023     2.14   0.033     .0010968     .025412
    2004 12  |   .0328954    .011498     2.86   0.004     .0103572    .0554335
    2004 13  |   .0278734   .0087256     3.19   0.001     .0107696    .0449772
    2004 14  |   .0047598    .009609     0.50   0.620    -.0140757    .0235952
    2005  2  |   .0284706   .0075927     3.75   0.000     .0135874    .0433538
    2005  3  |   .0170513   .0077169     2.21   0.027     .0019246    .0321779
    2005  4  |   .0040371   .0078365     0.52   0.606    -.0113238     .019398
    2005  5  |  -.0114401    .005316    -2.15   0.031    -.0218604   -.0010198
    2005  6  |   .0024837   .0099423     0.25   0.803    -.0170051    .0219726
    2005  7  |  -.0088335   .0106282    -0.83   0.406    -.0296668    .0119998
    2005  8  |   .0073659   .0134181     0.55   0.583    -.0189361    .0336679
    2005  9  |   .0300621   .0075005     4.01   0.000     .0153598    .0447644
    2005 10  |   .0164713   .0087639     1.88   0.060    -.0007075    .0336501
    2005 11  |   .0161161   .0066113     2.44   0.015     .0031568    .0290754
    2005 12  |   .0443736   .0110365     4.02   0.000       .02274    .0660072
    2005 13  |   .0412128   .0092179     4.47   0.000     .0231439    .0592816
    2005 14  |   .0238302   .0098376     2.42   0.015     .0045467    .0431136
    2006  2  |   .0336371   .0077472     4.34   0.000     .0184512     .048823
    2006  3  |   .0087908   .0077959     1.13   0.260    -.0064906    .0240722
    2006  4  |  -.0121139   .0079203    -1.53   0.126    -.0276391    .0034114
    2006  5  |  -.0153781    .005508    -2.79   0.005    -.0261747   -.0045815
    2006  6  |  -.0144527   .0076381    -1.89   0.058    -.0294248    .0005194
    2006  7  |  -.0137836   .0108325    -1.27   0.203    -.0350173    .0074501
    2006  8  |   .0075413   .0143772     0.52   0.600    -.0206406    .0357233
    2006  9  |   .0168708   .0076008     2.22   0.026     .0019719    .0317697
    2006 10  |   .0195481   .0089773     2.18   0.029      .001951    .0371452
    2006 11  |  (omitted)
    2006 12  |   .0436409   .0111059     3.93   0.000     .0218713    .0654105
    2006 13  |   .0383557   .0096544     3.97   0.000     .0194313    .0572801
    2006 14  |   .0099134   .0102444     0.97   0.333    -.0101674    .0299943
             |
       _cons |   .1192005   .0121986     9.77   0.000      .095289     .143112
-------------+----------------------------------------------------------------
     sigma_u |  .09737338
     sigma_e |  .05449454
         rho |  .76149707   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. do master_lin

. *************************************************************
. *                                                                                       
. * Patrick R. Gillespie                                  
. * Research Officer                                      
. * Teagasc, REDP                                         
. * Athenry, Co Galway, Ireland                           
. * patrick.gillespie@teagasc.ie                  
. *                                                                                       
. *************************************************************
. * RSF Project DAF RSF 07 505 (GO1390)           
. *                                                                                       
. * A micro level analysis of the Irish   
. * agri-food sector: lessons and                 
. * recommendations from Denmark and      
. * the Netherlands                               
. *                                                                               
. * Task 4
. *
. *************************************************************
. *       How this do file works
. *************************************************************
. * BE SURE TO READ THE FILE README.RTF!!!
. * The data to be used in this analysis is the 
. * FADN data for the years 2004 through 2007.Each 
. * country's data is contained in it's own data 
. * file. Rather than combine them all (would be 
. * a massive file), I'm importing variables as I 
. * need them. Once finished with a variable, I 
. * discard everything until I need it again.
. *
. * This master file calls do files from the 
. * subdirectory called sub_do. Any portion of the 
. * analysis can be omitted by inserting a * in 
. * front of the relevant do command. Output 
. * datasets will be generated by this file and 
. * stored in the subdirectory called output.
. *
. * In order for this do file to run, it must be
. * located in a folder (name is not important)
. * that is itself in the same folder that contains
. * CountryData and CountrySTATAFiles (those names 
. * are important, copy exactly). The datasets in 
. * those folders shouldn't contain any spaces and 
. * should match the list in the global macro "ms" 
. * defined below.
. * 
. * You can easily include or exclude countries
. * to the analysis by altering this macro 
. * (provided the datasets are in the right shape 
. * and are saved as a .dta in CountrySTATAFiles).
. *
. * At the time of writing, the directory 
. * structure in which this file resided was
. * 
. * Task 4
. *  >Data_Analysis
. *   >>CountryData
. *   >>CountrySTATAFiles
. *   >>descriptives
. *    >>>logs
. *    >>>output
. *    >>>sub_do
. *    >>>varname.xls
. *    >>>descriptives.do  <- your viewing this now
. *    >>>README.rtf
. *    >>>blank.dta
. *    >>>energygph.dta
. *************************************************************
. 
. *************************************************************
. *** PRELIMINARIES       *
. *************************
. clear

. clear matrix

. set mem 1500m

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory         1500M    max. data space              1,500.000M
    set matsize         800     max. RHS vars in models          4.950M
                                                            -----------
                                                             1,506.859M

. set matsize 800

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory         1500M    max. data space              1,500.000M
    set matsize         800     max. RHS vars in models          4.950M
                                                            -----------
                                                             1,506.859M

. capture log close
