-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/patrickgillespie/Documents/lin_forpatrick/Task 4/Data_Analysis/analysis/logs/resul
> ts/31_May_2012_15_38_26.log
  log type:  text
 opened on:  31 May 2012, 15:38:26

. STOP!!!
unrecognized command:  STOP
r(199);

end of do-file
r(199);

end of do-file

r(199);

. quietly xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity speciali
> se i.year year#mscode pol_sizeclass pol_setasideuaa pol_ln_labour pol_ln_ffi pol_solvency pol_inten
> sity pol_specialise i.year #mscode, vce(robust)
# invalid name
r(198);

. 
. *|

. *v

. test _b[pol_sizeclass]=0, notest
last estimates not found
r(301);

. test _b[pol_setasideuaa]=0, notest
last estimates not found
r(301);

. test _b[pol_ln_labour]=0, notest
last estimates not found
r(301);

. test _b[pol_ln_ffi]=0, notest
last estimates not found
r(301);

. test _b[pol_solvency]=0, notest
last estimates not found
r(301);

. test _b[pol_intensity]=0, notest
last estimates not found
r(301);

. test _b[pol_specialise]=0, notest
last estimates not found
r(301);

. 
. test _b[policy]=0, accum
last estimates not found
r(301);

. quietly xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity speciali
> se i.year year#mscode pol_sizeclass pol_setasideuaa pol_ln_labour pol_ln_ffi pol_solvency pol_inten
> sity pol_specialise i.year year#mscode, vce(robust)

. 
. *|

. *v

. test _b[pol_sizeclass]=0, notest

 ( 1)  pol_sizeclass = 0

. test _b[pol_setasideuaa]=0, notest

 ( 1)  pol_setasideuaa = 0

. test _b[pol_ln_labour]=0, notest

 ( 1)  pol_ln_labour = 0

. test _b[pol_ln_ffi]=0, notest

 ( 1)  pol_ln_ffi = 0

. test _b[pol_solvency]=0, notest

 ( 1)  pol_solvency = 0

. test _b[pol_intensity]=0, notest

 ( 1)  pol_intensity = 0

. test _b[pol_specialise]=0, notest

 ( 1)  pol_specialise = 0

. 
. test _b[policy]=0, accum

 ( 1)  pol_specialise = 0
 ( 2)  policy = 0

           chi2(  2) =   10.34
         Prob > chi2 =    0.0057

. quietly xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity speciali
> se i.year year#mscode pol_sizeclass pol_setasideuaa pol_ln_labour pol_ln_ffi pol_solvency pol_inten
> sity pol_specialise i.year year#mscode, vce(robust)

. 
. *|

. *v

. test _b[pol_sizeclass]=0, notest

 ( 1)  pol_sizeclass = 0

. test _b[pol_setasideuaa]=0, accum notest

 ( 1)  pol_sizeclass = 0
 ( 2)  pol_setasideuaa = 0

. test _b[pol_ln_labour]=0, accum notest

 ( 1)  pol_sizeclass = 0
 ( 2)  pol_setasideuaa = 0
 ( 3)  pol_ln_labour = 0

. test _b[pol_ln_ffi]=0, accum notest

 ( 1)  pol_sizeclass = 0
 ( 2)  pol_setasideuaa = 0
 ( 3)  pol_ln_labour = 0
 ( 4)  pol_ln_ffi = 0

. test _b[pol_solvency]=0, accum notest

 ( 1)  pol_sizeclass = 0
 ( 2)  pol_setasideuaa = 0
 ( 3)  pol_ln_labour = 0
 ( 4)  pol_ln_ffi = 0
 ( 5)  pol_solvency = 0

. test _b[pol_intensity]=0, accum notest

 ( 1)  pol_sizeclass = 0
 ( 2)  pol_setasideuaa = 0
 ( 3)  pol_ln_labour = 0
 ( 4)  pol_ln_ffi = 0
 ( 5)  pol_solvency = 0
 ( 6)  pol_intensity = 0

. test _b[pol_specialise]=0, accum notest

 ( 1)  pol_sizeclass = 0
 ( 2)  pol_setasideuaa = 0
 ( 3)  pol_ln_labour = 0
 ( 4)  pol_ln_ffi = 0
 ( 5)  pol_solvency = 0
 ( 6)  pol_intensity = 0
 ( 7)  pol_specialise = 0

. 
. test _b[policy]=0, accum

 ( 1)  pol_sizeclass = 0
 ( 2)  pol_setasideuaa = 0
 ( 3)  pol_ln_labour = 0
 ( 4)  pol_ln_ffi = 0
 ( 5)  pol_solvency = 0
 ( 6)  pol_intensity = 0
 ( 7)  pol_specialise = 0
 ( 8)  policy = 0

           chi2(  8) =   33.29
         Prob > chi2 =    0.0001

. quietly xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity speciali
> se i.year year#mscode pol_sizeclass pol_setasideuaa pol_ln_labour pol_ln_ffi pol_solvency pol_inten
> sity pol_specialise i.year year#mscode, fe vce(robust)

. 
. *|

. *v

. test _b[pol_sizeclass]=0, notest

 ( 1)  pol_sizeclass = 0

. test _b[pol_setasideuaa]=0, accum notest

 ( 1)  pol_sizeclass = 0
 ( 2)  pol_setasideuaa = 0

. test _b[pol_ln_labour]=0, accum notest

 ( 1)  pol_sizeclass = 0
 ( 2)  pol_setasideuaa = 0
 ( 3)  pol_ln_labour = 0

. test _b[pol_ln_ffi]=0, accum notest

 ( 1)  pol_sizeclass = 0
 ( 2)  pol_setasideuaa = 0
 ( 3)  pol_ln_labour = 0
 ( 4)  pol_ln_ffi = 0

. test _b[pol_solvency]=0, accum notest

 ( 1)  pol_sizeclass = 0
 ( 2)  pol_setasideuaa = 0
 ( 3)  pol_ln_labour = 0
 ( 4)  pol_ln_ffi = 0
 ( 5)  pol_solvency = 0

. test _b[pol_intensity]=0, accum notest

 ( 1)  pol_sizeclass = 0
 ( 2)  pol_setasideuaa = 0
 ( 3)  pol_ln_labour = 0
 ( 4)  pol_ln_ffi = 0
 ( 5)  pol_solvency = 0
 ( 6)  pol_intensity = 0

. test _b[pol_specialise]=0, accum notest

 ( 1)  pol_sizeclass = 0
 ( 2)  pol_setasideuaa = 0
 ( 3)  pol_ln_labour = 0
 ( 4)  pol_ln_ffi = 0
 ( 5)  pol_solvency = 0
 ( 6)  pol_intensity = 0
 ( 7)  pol_specialise = 0

. 
. test _b[policy]=0, accum

 ( 1)  pol_sizeclass = 0
 ( 2)  pol_setasideuaa = 0
 ( 3)  pol_ln_labour = 0
 ( 4)  pol_ln_ffi = 0
 ( 5)  pol_solvency = 0
 ( 6)  pol_intensity = 0
 ( 7)  pol_specialise = 0
 ( 8)  policy = 0

       F(  8, 10862) =    5.12
            Prob > F =    0.0000

. 
. 
. test _b[policy]=0

 ( 1)  policy = 0

       F(  1, 10862) =   10.67
            Prob > F =    0.0011

. quietly xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity speciali
> se i.year year#mscode, fe vce(robust)

. test _b[policy] = 0

 ( 1)  policy = 0

       F(  1, 10862) =    5.80
            Prob > F =    0.0160

. xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.yea
> r year#mscode, fe vce(robust)
note: 2006.year omitted because of collinearity
note: 1999b.year#2.mscode omitted because of collinearity
note: 1999b.year#3.mscode omitted because of collinearity
note: 1999b.year#4.mscode omitted because of collinearity
note: 1999b.year#7.mscode omitted because of collinearity
note: 1999b.year#9.mscode omitted because of collinearity
note: 1999b.year#10.mscode omitted because of collinearity
note: 1999b.year#12.mscode omitted because of collinearity
note: 1999b.year#13.mscode omitted because of collinearity
note: 1999b.year#14.mscode omitted because of collinearity
note: 2000.year#6.mscode omitted because of collinearity
note: 2000.year#8.mscode omitted because of collinearity
note: 2006.year#5.mscode omitted because of collinearity
note: 2006.year#11.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     70722
Group variable: pid                             Number of groups   =     10863

R-sq:  within  = 0.0382                         Obs per group: min =         1
       between = 0.0235                                        avg =       6.5
       overall = 0.0049                                        max =         8

                                                F(105,10862)       =     15.27
corr(u_i, Xb)  = -0.2571                        Prob > F           =    0.0000

                                (Std. Err. adjusted for 10863 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
 osrape_prop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |  -.0177549   .0073716    -2.41   0.016    -.0322046   -.0033052
   sizeclass |  -.0020479    .000979    -2.09   0.036    -.0039669   -.0001289
 setasideuaa |  -.0004272   .0000481    -8.88   0.000    -.0005214   -.0003329
   ln_labour |  -.0015939   .0014363    -1.11   0.267    -.0044093    .0012216
      ln_ffi |  -.0000275   .0000998    -0.28   0.783    -.0002231    .0001682
    solvency |  -.0004735   .0019623    -0.24   0.809    -.0043199    .0033729
   intensity |   .0001659   .0089217     0.02   0.985    -.0173222    .0176541
  specialise |    .001142   .0011336     1.01   0.314      -.00108     .003364
             |
        year |
       2000  |   -.034516   .0071187    -4.85   0.000      -.04847    -.020562
       2001  |  -.0398286   .0075076    -5.31   0.000    -.0545449   -.0251124
       2002  |  -.0432702    .006746    -6.41   0.000    -.0564937   -.0300467
       2003  |  -.0312941   .0070543    -4.44   0.000    -.0451218   -.0174664
       2004  |  -.0027019   .0040446    -0.67   0.504      -.01063    .0052263
       2005  |  -.0128883   .0042957    -3.00   0.003    -.0213088   -.0044679
       2006  |  (omitted)
             |
 year#mscode |
    1999  2  |  (omitted)
    1999  3  |  (omitted)
    1999  4  |  (omitted)
    1999  5  |  -.0038156   .0077111    -0.49   0.621    -.0189308    .0112996
    1999  6  |  -.0303853   .0074319    -4.09   0.000    -.0449532   -.0158175
    1999  7  |  (omitted)
    1999  8  |  -.0079656       .015    -0.53   0.595    -.0373684    .0214372
    1999  9  |  (omitted)
    1999 10  |  (omitted)
    1999 11  |   .0017266   .0098507     0.18   0.861    -.0175825    .0210357
    1999 12  |  (omitted)
    1999 13  |  (omitted)
    1999 14  |  (omitted)
    2000  2  |   .0169339    .007328     2.31   0.021     .0025696    .0312982
    2000  3  |   .0306495   .0073827     4.15   0.000      .016178     .045121
    2000  4  |   .0223677   .0076662     2.92   0.004     .0073405    .0373949
    2000  5  |   .0164075   .0055211     2.97   0.003     .0055851    .0272299
    2000  6  |  (omitted)
    2000  7  |   .0160164   .0097278     1.65   0.100    -.0030519    .0350848
    2000  8  |  (omitted)
    2000  9  |    .034505   .0071209     4.85   0.000     .0205467    .0484632
    2000 10  |   .0152464   .0077376     1.97   0.049     .0000793    .0304136
    2000 11  |   .0395549   .0081805     4.84   0.000     .0235195    .0555902
    2000 12  |   .0314502   .0089841     3.50   0.000     .0138397    .0490606
    2000 13  |   .0175165   .0084771     2.07   0.039     .0008999    .0341332
    2000 14  |   .0238985   .0084032     2.84   0.004     .0074267    .0403703
    2001  2  |   .0221257   .0077403     2.86   0.004     .0069532    .0372982
    2001  3  |   .0313224   .0078065     4.01   0.000     .0160203    .0466245
    2001  4  |   .0314639    .007976     3.94   0.000     .0158294    .0470983
    2001  5  |   .0156498    .005223     3.00   0.003     .0054118    .0258878
    2001  6  |  -.0010155   .0081114    -0.13   0.900    -.0169154    .0148844
    2001  7  |   .0304796   .0106861     2.85   0.004     .0095328    .0514264
    2001  8  |   .0112183   .0111937     1.00   0.316    -.0107234      .03316
    2001  9  |   .0375708   .0076614     4.90   0.000      .022553    .0525886
    2001 10  |   .0237976   .0082726     2.88   0.004     .0075818    .0400133
    2001 11  |   .0430574   .0083236     5.17   0.000     .0267416    .0593732
    2001 12  |   .0359359   .0100208     3.59   0.000     .0162933    .0555785
    2001 13  |   .0207352   .0088039     2.36   0.019     .0034779    .0379925
    2001 14  |   .0142525   .0100663     1.42   0.157    -.0054792    .0339842
    2002  2  |   .0370755   .0069956     5.30   0.000     .0233628    .0507882
    2002  3  |   .0363846   .0070957     5.13   0.000     .0224758    .0502934
    2002  4  |   .0221673   .0073052     3.03   0.002     .0078478    .0364868
    2002  5  |   .0033263   .0044655     0.74   0.456     -.005427    .0120796
    2002  6  |   .0043374   .0077106     0.56   0.574    -.0107768    .0194516
    2002  7  |   .0025155   .0101367     0.25   0.804    -.0173543    .0223852
    2002  8  |   .0053619   .0100453     0.53   0.594    -.0143288    .0250526
    2002  9  |   .0409355    .006919     5.92   0.000     .0273729     .054498
    2002 10  |   .0283587   .0078738     3.60   0.000     .0129246    .0437927
    2002 11  |   .0398955   .0063869     6.25   0.000      .027376    .0524149
    2002 12  |   .0368088   .0099779     3.69   0.000     .0172502    .0563673
    2002 13  |   .0400218   .0082307     4.86   0.000     .0238882    .0561553
    2002 14  |   .0083482   .0094017     0.89   0.375    -.0100808    .0267772
    2003  2  |   .0250429   .0073049     3.43   0.001     .0107239    .0393619
    2003  3  |   .0187512   .0074633     2.51   0.012     .0041217    .0333807
    2003  4  |   .0080972   .0075946     1.07   0.286    -.0067896     .022984
    2003  5  |  -.0009323   .0046878    -0.20   0.842    -.0101212    .0082566
    2003  6  |  -.0052006    .006762    -0.77   0.442    -.0184554    .0080543
    2003  7  |  -.0095388   .0101703    -0.94   0.348    -.0294745    .0103968
    2003  8  |  -.0039032   .0108838    -0.36   0.720    -.0252375    .0174311
    2003  9  |   .0296086    .007219     4.10   0.000      .015458    .0437592
    2003 10  |   .0128424   .0084381     1.52   0.128    -.0036979    .0293827
    2003 11  |   .0317576   .0070461     4.51   0.000     .0179459    .0455694
    2003 12  |   .0362646   .0101001     3.59   0.000     .0164666    .0560626
    2003 13  |   .0217555   .0088758     2.45   0.014     .0043572    .0391537
    2003 14  |   .0198828   .0096204     2.07   0.039     .0010252    .0387405
    2004  2  |   .0162069   .0071811     2.26   0.024     .0021306    .0302832
    2004  3  |   .0061866    .007331     0.84   0.399    -.0081834    .0205566
    2004  4  |  -.0015732    .007425    -0.21   0.832    -.0161275    .0129812
    2004  5  |  -.0148167   .0043406    -3.41   0.001    -.0233252   -.0063083
    2004  6  |  -.0193978   .0079483    -2.44   0.015     -.034978   -.0038176
    2004  7  |  -.0186613    .010422    -1.79   0.073    -.0390903    .0017677
    2004  8  |   .0097379   .0115136     0.85   0.398    -.0128308    .0323067
    2004  9  |   .0193652   .0070648     2.74   0.006     .0055169    .0332135
    2004 10  |   .0005929    .008281     0.07   0.943    -.0156394    .0168252
    2004 11  |   .0136067   .0061895     2.20   0.028     .0014741    .0257393
    2004 12  |   .0323207   .0114845     2.81   0.005     .0098089    .0548325
    2004 13  |   .0272923   .0087082     3.13   0.002     .0102227    .0443619
    2004 14  |   .0042053   .0095923     0.44   0.661    -.0145972    .0230079
    2005  2  |   .0281649    .007574     3.72   0.000     .0133185    .0430113
    2005  3  |   .0164655   .0077012     2.14   0.033     .0013697    .0315613
    2005  4  |   .0034828   .0078206     0.45   0.656    -.0118471    .0188126
    2005  5  |   .0041054   .0045208     0.91   0.364    -.0047562     .012967
    2005  6  |   .0016118   .0099798     0.16   0.872    -.0179504     .021174
    2005  7  |  -.0092357   .0106075    -0.87   0.384    -.0300283     .011557
    2005  8  |   .0064591   .0134471     0.48   0.631    -.0198996    .0328179
    2005  9  |   .0294983    .007485     3.94   0.000     .0148264    .0441702
    2005 10  |    .015889   .0087492     1.82   0.069    -.0012609    .0330389
    2005 11  |   .0164321   .0065882     2.49   0.013     .0035181    .0293461
    2005 12  |   .0437921   .0110251     3.97   0.000     .0221809    .0654034
    2005 13  |   .0406204   .0092047     4.41   0.000     .0225774    .0586634
    2005 14  |   .0233236   .0098242     2.37   0.018     .0040665    .0425808
    2006  2  |   .0330451   .0077151     4.28   0.000      .017922    .0481682
    2006  3  |   .0078888   .0077678     1.02   0.310    -.0073374     .023115
    2006  4  |  -.0129957   .0078928    -1.65   0.100    -.0284671    .0024758
    2006  5  |  (omitted)
    2006  6  |  -.0156482    .007667    -2.04   0.041    -.0306768   -.0006195
    2006  7  |  -.0144987   .0108036    -1.34   0.180    -.0356758    .0066783
    2006  8  |   .0063012   .0143908     0.44   0.661    -.0219074    .0345098
    2006  9  |   .0159651   .0075725     2.11   0.035     .0011217    .0308086
    2006 10  |   .0186459   .0089523     2.08   0.037     .0010978     .036194
    2006 11  |  (omitted)
    2006 12  |   .0427314   .0110851     3.85   0.000     .0210025    .0644603
    2006 13  |   .0374305   .0096322     3.89   0.000     .0185497    .0563113
    2006 14  |   .0090094   .0102223     0.88   0.378    -.0110283     .029047
             |
       _cons |   .1170543   .0120871     9.68   0.000     .0933614    .1407472
-------------+----------------------------------------------------------------
     sigma_u |  .09609468
     sigma_e |  .05439757
         rho |  .75731756   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity specialise i.
> year year#mscode, fe vce(robust)
note: 2006.year omitted because of collinearity
note: 1999b.year#2.mscode omitted because of collinearity
note: 1999b.year#3.mscode omitted because of collinearity
note: 1999b.year#4.mscode omitted because of collinearity
note: 1999b.year#7.mscode omitted because of collinearity
note: 1999b.year#9.mscode omitted because of collinearity
note: 1999b.year#10.mscode omitted because of collinearity
note: 1999b.year#12.mscode omitted because of collinearity
note: 1999b.year#13.mscode omitted because of collinearity
note: 1999b.year#14.mscode omitted because of collinearity
note: 2000.year#6.mscode omitted because of collinearity
note: 2000.year#8.mscode omitted because of collinearity
note: 2006.year#5.mscode omitted because of collinearity
note: 2006.year#11.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     70722
Group variable: pid                             Number of groups   =     10863

R-sq:  within  = 0.0633                         Obs per group: min =         1
       between = 0.2298                                        avg =       6.5
       overall = 0.1467                                        max =         8

                                                F(105,10862)       =     11.26
corr(u_i, Xb)  = -0.5019                        Prob > F           =    0.0000

                                (Std. Err. adjusted for 10863 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
oilseedrap~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |   .2447674   1.199694     0.20   0.838    -2.106853    2.596387
   sizeclass |   .6742916   .0930997     7.24   0.000     .4917992    .8567839
 setasideuaa |  -.2512014   .0683594    -3.67   0.000    -.3851983   -.1172045
   ln_labour |   .4583004   .2502672     1.83   0.067    -.0322691    .9488698
      ln_ffi |   .0328186   .0254858     1.29   0.198    -.0171382    .0827753
    solvency |      .2947   .3428541     0.86   0.390    -.3773565    .9667566
   intensity |  -.7606308   1.064949    -0.71   0.475    -2.848124    1.326863
  specialise |   .3073011   .2665446     1.15   0.249    -.2151749     .829777
             |
        year |
       2000  |  -5.003932   1.057141    -4.73   0.000    -7.076121   -2.931743
       2001  |  -6.176303   1.150453    -5.37   0.000    -8.431401   -3.921205
       2002  |   -4.75892   1.095257    -4.35   0.000    -6.905824   -2.612015
       2003  |  -2.510173   1.091815    -2.30   0.022    -4.650331   -.3700163
       2004  |    -.86511   .8074578    -1.07   0.284    -2.447875    .7176545
       2005  |  -2.666524   .7137815    -3.74   0.000    -4.065666   -1.267382
       2006  |  (omitted)
             |
 year#mscode |
    1999  2  |  (omitted)
    1999  3  |  (omitted)
    1999  4  |  (omitted)
    1999  5  |   .7420106   1.246984     0.60   0.552    -1.702305    3.186326
    1999  6  |  -4.522322   1.069711    -4.23   0.000    -6.619151   -2.425493
    1999  7  |  (omitted)
    1999  8  |  -2.660496   1.415052    -1.88   0.060    -5.434256     .113263
    1999  9  |  (omitted)
    1999 10  |  (omitted)
    1999 11  |   2.917167   1.602321     1.82   0.069     -.223674    6.058007
    1999 12  |  (omitted)
    1999 13  |  (omitted)
    1999 14  |  (omitted)
    2000  2  |   .1345589   1.195394     0.11   0.910    -2.208631    2.477749
    2000  3  |    4.84973   1.062157     4.57   0.000     2.767708    6.931752
    2000  4  |   3.781104   1.094798     3.45   0.001     1.635101    5.927108
    2000  5  |   3.726246   1.073753     3.47   0.001     1.621495    5.830998
    2000  6  |  (omitted)
    2000  7  |   4.026935   1.168324     3.45   0.001     1.736808    6.317063
    2000  8  |  (omitted)
    2000  9  |   4.974815   1.056372     4.71   0.000     2.904134    7.045497
    2000 10  |   4.138959    1.06794     3.88   0.000     2.045601    6.232317
    2000 11  |   8.608024   1.579874     5.45   0.000     5.511183    11.70487
    2000 12  |   4.952951   1.126937     4.40   0.000     2.743949    7.161954
    2000 13  |   3.389832   1.210234     2.80   0.005     1.017551    5.762112
    2000 14  |   2.163299   1.806584     1.20   0.231    -1.377936    5.704534
    2001  2  |   2.014672   1.315293     1.53   0.126    -.5635419    4.592885
    2001  3  |   5.787072   1.157547     5.00   0.000     3.518068    8.056076
    2001  4  |   5.713195   1.181753     4.83   0.000     3.396744    8.029647
    2001  5  |   4.404906   .9088255     4.85   0.000     2.623442    6.186369
    2001  6  |   1.172735   .8343931     1.41   0.160    -.4628278    2.808298
    2001  7  |   5.008397   1.268607     3.95   0.000     2.521696    7.495098
    2001  8  |   1.928116   1.045275     1.84   0.065     -.120814    3.977046
    2001  9  |    5.91457   1.158504     5.11   0.000     3.643691    8.185448
    2001 10  |   5.541126   1.161263     4.77   0.000     3.264839    7.817413
    2001 11  |   9.911481   1.442414     6.87   0.000     7.084087    12.73887
    2001 12  |   6.127027   1.230163     4.98   0.000     3.715682    8.538371
    2001 13  |   4.330037   1.278654     3.39   0.001     1.823642    6.836431
    2001 14  |   1.030631   2.080659     0.50   0.620    -3.047841    5.109102
    2002  2  |   2.670195   1.320776     2.02   0.043     .0812336    5.259157
    2002  3  |   4.433706   1.107437     4.00   0.000     2.262927    6.604486
    2002  4  |    3.51005   1.124145     3.12   0.002     1.306522    5.713578
    2002  5  |    1.09299   .7957962     1.37   0.170    -.4669158    2.652896
    2002  6  |  -.0324509   .8644155    -0.04   0.970    -1.726863    1.661961
    2002  7  |   2.059697   1.255955     1.64   0.101    -.4022048    4.521598
    2002  8  |  -.2422163   1.043815    -0.23   0.817    -2.288284    1.803852
    2002  9  |   4.745523   1.104347     4.30   0.000     2.580801    6.910245
    2002 10  |   4.407767   1.110231     3.97   0.000     2.231512    6.584023
    2002 11  |   7.581906   1.129951     6.71   0.000     5.366996    9.796817
    2002 12  |   4.792294   1.213608     3.95   0.000     2.413401    7.171188
    2002 13  |   5.090881   1.233201     4.13   0.000     2.673583    7.508179
    2002 14  |  -3.668685   2.022293    -1.81   0.070    -7.632749    .2953786
    2003  2  |   1.179376   1.279704     0.92   0.357    -1.329078    3.687829
    2003  3  |   1.793982   1.108981     1.62   0.106    -.3798227    3.967786
    2003  4  |   1.170326   1.119953     1.04   0.296    -1.024986    3.365638
    2003  5  |  -.0155073    .810488    -0.02   0.985    -1.604212    1.573197
    2003  6  |  -1.830678   .9232529    -1.98   0.047    -3.640422   -.0209344
    2003  7  |  -1.724562   1.562152    -1.10   0.270    -4.786664     1.33754
    2003  8  |  -2.239566   1.158664    -1.93   0.053    -4.510758    .0316259
    2003  9  |   2.459864   1.095946     2.24   0.025     .3116099    4.608118
    2003 10  |   2.055067   1.116023     1.84   0.066    -.1325412    4.242676
    2003 11  |   5.606102   1.152326     4.87   0.000     3.347334    7.864871
    2003 12  |   3.850296   1.238379     3.11   0.002     1.422847    6.277745
    2003 13  |   2.112472   1.260181     1.68   0.094    -.3577132    4.582657
    2003 14  |   -.708415   1.981617    -0.36   0.721    -4.592745    3.175915
    2004  2  |  -.1673138   1.307903    -0.13   0.898    -2.731042    2.396414
    2004  3  |  -.1909201   1.115138    -0.17   0.864    -2.376795    1.994954
    2004  4  |  -.5724071    1.13238    -0.51   0.613    -2.792079    1.647265
    2004  5  |   -2.30557   .8459293    -2.73   0.006    -3.963746   -.6473947
    2004  6  |   -4.12628   .9766791    -4.22   0.000    -6.040749   -2.211811
    2004  7  |  -2.401647   1.352515    -1.78   0.076    -5.052823    .2495288
    2004  8  |  -2.660477   1.109298    -2.40   0.016    -4.834904    -.486051
    2004  9  |   .7482394   1.113898     0.67   0.502    -1.435204    2.931683
    2004 10  |   .1066853   1.130311     0.09   0.925    -2.108931    2.322302
    2004 11  |   2.907344   1.170153     2.48   0.013     .6136304    5.201058
    2004 12  |   2.359776   1.311781     1.80   0.072    -.2115536    4.931105
    2004 13  |   2.561942   1.309487     1.96   0.050    -.0048913    5.128775
    2004 14  |  -3.404131   2.031045    -1.68   0.094     -7.38535    .5770871
    2005  2  |   3.058484   1.287844     2.37   0.018     .5340745    5.582893
    2005  3  |   1.650218    1.11876     1.48   0.140    -.5427564    3.843192
    2005  4  |   1.106911   1.136125     0.97   0.330    -1.120102    3.333923
    2005  5  |   1.295494   .7426971     1.74   0.081     -.160328    2.751316
    2005  6  |  -1.713964   .9507043    -1.80   0.071    -3.577518    .1495903
    2005  7  |  -.4624501   1.274863    -0.36   0.717    -2.961414    2.036514
    2005  8  |   -1.95787   1.330972    -1.47   0.141    -4.566818    .6510785
    2005  9  |   2.621903   1.112383     2.36   0.018     .4414285    4.802377
    2005 10  |     2.3338   1.135712     2.05   0.040      .107598    4.560001
    2005 11  |   3.258645   .9343366     3.49   0.000     1.427175    5.090115
    2005 12  |   4.535743   1.261163     3.60   0.000     2.063634    7.007852
    2005 13  |   4.933363   1.337192     3.69   0.000     2.312222    7.554503
    2005 14  |   1.715305    2.03984     0.84   0.400    -2.283153    5.713764
    2006  2  |   3.935506   1.411138     2.79   0.005     1.169418    6.701595
    2006  3  |   -.892633   1.212087    -0.74   0.461    -3.268545    1.483279
    2006  4  |  -1.870635   1.234341    -1.52   0.130    -4.290169    .5488978
    2006  5  |  (omitted)
    2006  6  |  -4.428297   1.126526    -3.93   0.000    -6.636493   -2.220101
    2006  7  |  -1.090654   1.506521    -0.72   0.469    -4.043711    1.862402
    2006  8  |  -1.521211   1.402484    -1.08   0.278    -4.270335    1.227913
    2006  9  |  -.8500798   1.238845    -0.69   0.493    -3.278441    1.578282
    2006 10  |    .657752   1.235438     0.53   0.594    -1.763932    3.079436
    2006 11  |  (omitted)
    2006 12  |   3.336045   1.492119     2.24   0.025     .4112184    6.260871
    2006 13  |   3.101399   1.461369     2.12   0.034     .2368493    5.965948
    2006 14  |  -2.109302   2.162913    -0.98   0.329    -6.349006    2.130402
             |
       _cons |   6.884032   1.972843     3.49   0.000     3.016901    10.75116
-------------+----------------------------------------------------------------
     sigma_u |  44.774228
     sigma_e |  10.204237
         rho |  .95062424   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. gen ffi_tmp = familyfarmincome //Correct for negative and 0 FFI to facilitate taking log
ffi_tmp already defined
r(110);

. 
. replace ffi_tmp = 0 if familyfarmincome<0 
(8840 real changes made)

. 
. replace ffi_tmp = ffi_tmp + 1
(70736 real changes made)

. 
. gen ffi_prop = ffi_tmp/mean(ffi)
unknown function mean()
r(133);

. 
. help function

. egen ffi_prop = ffi_tmp/mean(ffi)
unknown egen function ffi_tmp/mean()
r(133);

. egen ffi_prop = ffi_tmp/(mean(ffi))
unknown egen function ffi_tmp/()
r(133);

. egen ffi_prop = 10/2
unknown egen function 10/2()
r(133);

. help egen

. egen ffi_prop = 10 / 2
unknown egen function 10()
r(133);

. di 10/2
5

. egen ffi_tmp_mn = mean(ffi_tmp)

. gen ffi_prop = ffi_tmp/ffi_tmp_mn

. oilseedrapeuaa policy sizeclass setasideuaa ln_labour ffi_prop solvency intensity specialise i.year
>  year#mscode, fe vce(cluster pid)
unrecognized command:  oilseedrapeuaa
r(199);

. xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ffi_prop solvency intensity specialise 
> i.year year#mscode, fe vce(cluster pid)
note: 2006.year omitted because of collinearity
note: 1999b.year#2.mscode omitted because of collinearity
note: 1999b.year#3.mscode omitted because of collinearity
note: 1999b.year#4.mscode omitted because of collinearity
note: 1999b.year#7.mscode omitted because of collinearity
note: 1999b.year#9.mscode omitted because of collinearity
note: 1999b.year#10.mscode omitted because of collinearity
note: 1999b.year#12.mscode omitted because of collinearity
note: 1999b.year#13.mscode omitted because of collinearity
note: 1999b.year#14.mscode omitted because of collinearity
note: 2000.year#6.mscode omitted because of collinearity
note: 2000.year#8.mscode omitted because of collinearity
note: 2006.year#5.mscode omitted because of collinearity
note: 2006.year#11.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     70722
Group variable: pid                             Number of groups   =     10863

R-sq:  within  = 0.0657                         Obs per group: min =         1
       between = 0.1928                                        avg =       6.5
       overall = 0.1179                                        max =         8

                                                F(105,10862)       =     11.23
corr(u_i, Xb)  = -0.4653                        Prob > F           =    0.0000

                                (Std. Err. adjusted for 10863 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
oilseedrap~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |   .0172019   1.220091     0.01   0.989    -2.374399    2.408803
   sizeclass |   .6218415   .0983575     6.32   0.000     .4290429    .8146401
 setasideuaa |  -.2509826   .0685562    -3.66   0.000    -.3853653      -.1166
   ln_labour |   .4564043   .2504248     1.82   0.068     -.034474    .9472826
    ffi_prop |   .5203562   .2757055     1.89   0.059    -.0200768    1.060789
    solvency |   .4486448   .3596798     1.25   0.212    -.2563933    1.153683
   intensity |  -.5722353   1.064083    -0.54   0.591    -2.658032    1.513561
  specialise |   .3476926   .3037003     1.14   0.252    -.2476154    .9430005
             |
        year |
       2000  |  -5.362886   1.085679    -4.94   0.000    -7.491015   -3.234757
       2001  |  -6.555896   1.178182    -5.56   0.000    -8.865348   -4.246444
       2002  |   -4.67843   1.112179    -4.21   0.000    -6.858505   -2.498356
       2003  |  -2.487375   1.104352    -2.25   0.024    -4.652105   -.3226436
       2004  |  -.7273836   .8116299    -0.90   0.370    -2.318326    .8635591
       2005  |  -2.510427   .7217363    -3.48   0.001    -3.925162   -1.095693
       2006  |  (omitted)
             |
 year#mscode |
    1999  2  |  (omitted)
    1999  3  |  (omitted)
    1999  4  |  (omitted)
    1999  5  |   .5916177   1.264678     0.47   0.640    -1.887381    3.070616
    1999  6  |  -4.757067    1.09008    -4.36   0.000    -6.893823   -2.620311
    1999  7  |  (omitted)
    1999  8  |  -2.928182   1.427819    -2.05   0.040    -5.726967   -.1293962
    1999  9  |  (omitted)
    1999 10  |  (omitted)
    1999 11  |   2.755628    1.60883     1.71   0.087    -.3979716    5.909228
    1999 12  |  (omitted)
    1999 13  |  (omitted)
    1999 14  |  (omitted)
    2000  2  |   .5267697   1.201134     0.44   0.661    -1.827672    2.881211
    2000  3  |   5.201262   1.089338     4.77   0.000      3.06596    7.336563
    2000  4  |   4.059912   1.113544     3.65   0.000     1.877163     6.24266
    2000  5  |   3.956027   1.090393     3.63   0.000     1.818658    6.093396
    2000  6  |  (omitted)
    2000  7  |   4.378417   1.196045     3.66   0.000     2.033951    6.722883
    2000  8  |  (omitted)
    2000  9  |   5.293384   1.080376     4.90   0.000      3.17565    7.411117
    2000 10  |   4.480284   1.094903     4.09   0.000     2.334073    6.626494
    2000 11  |   8.822638   1.582284     5.58   0.000     5.721072     11.9242
    2000 12  |   5.214773   1.143259     4.56   0.000     2.973777    7.455768
    2000 13  |   3.700385   1.229598     3.01   0.003     1.290149    6.110621
    2000 14  |   2.498976   1.837995     1.36   0.174    -1.103828    6.101781
    2001  2  |   2.413678   1.340996     1.80   0.072    -.2149174    5.042274
    2001  3  |    6.15954   1.184016     5.20   0.000     3.838653    8.480426
    2001  4  |   6.070818   1.206465     5.03   0.000     3.705927    8.435709
    2001  5  |   4.694538   .9303279     5.05   0.000     2.870925     6.51815
    2001  6  |    1.21278   .8387389     1.45   0.148    -.4313016    2.856861
    2001  7  |   5.368636   1.293338     4.15   0.000     2.833457    7.903816
    2001  8  |    1.75604   1.072581     1.64   0.102    -.3464134    3.858494
    2001  9  |    5.67695   1.187019     4.78   0.000     3.350176    8.003724
    2001 10  |   5.821155   1.180592     4.93   0.000      3.50698    8.135331
    2001 11  |   10.09365   1.447414     6.97   0.000     7.256453    12.93084
    2001 12  |   6.441558   1.248602     5.16   0.000      3.99407    8.889045
    2001 13  |   4.619144   1.298931     3.56   0.000     2.073002    7.165287
    2001 14  |   1.405945   2.102205     0.67   0.504    -2.714761    5.526651
    2002  2  |   2.843478   1.329517     2.14   0.032     .2373815    5.449575
    2002  3  |   4.344886   1.124412     3.86   0.000     2.140834    6.548939
    2002  4  |   3.389427   1.142434     2.97   0.003     1.150048    5.628806
    2002  5  |   .9003211   .8038779     1.12   0.263    -.6754263    2.476068
    2002  6  |  -.4187736   .9135326    -0.46   0.647    -2.209464    1.371917
    2002  7  |   2.015623     1.2723     1.58   0.113    -.4783174    4.509563
    2002  8  |   -.669502   1.099615    -0.61   0.543    -2.824947    1.485943
    2002  9  |   4.484369   1.137894     3.94   0.000      2.25389    6.714848
    2002 10  |   4.299979   1.127918     3.81   0.000     2.089053    6.510905
    2002 11  |   7.214451   1.134244     6.36   0.000     4.991125    9.437776
    2002 12  |   4.647365   1.235564     3.76   0.000     2.225433    7.069296
    2002 13  |   4.929249   1.252868     3.93   0.000     2.473399    7.385098
    2002 14  |  -3.839824   2.031878    -1.89   0.059    -7.822675    .1430265
    2003  2  |   1.314837   1.289452     1.02   0.308    -1.212724    3.842398
    2003  3  |   1.763998   1.121223     1.57   0.116    -.4338045      3.9618
    2003  4  |   1.076256   1.135031     0.95   0.343    -1.148612    3.301123
    2003  5  |  -.1975883   .8179651    -0.24   0.809    -1.800949    1.405773
    2003  6  |  -2.221352   .9596229    -2.31   0.021    -4.102388   -.3403156
    2003  7  |  -1.683784   1.552257    -1.08   0.278    -4.726491    1.358923
    2003  8  |  -2.620967   1.184081    -2.21   0.027    -4.941983    -.299952
    2003  9  |   1.841118   1.182895     1.56   0.120    -.4775712    4.159808
    2003 10  |   2.016167   1.128158     1.79   0.074    -.1952286    4.227563
    2003 11  |   5.436543   1.153104     4.71   0.000     3.176249    7.696837
    2003 12  |   3.785876   1.252669     3.02   0.003     1.330416    6.241336
    2003 13  |   2.010569   1.274899     1.58   0.115     -.488465    4.509603
    2003 14  |  -1.145026   2.003152    -0.57   0.568    -5.071569    2.781518
    2004  2  |  -.1052975   1.315403    -0.08   0.936    -2.683728    2.473133
    2004  3  |  -.0924196   1.125394    -0.08   0.935    -2.298397    2.113558
    2004  4  |  -.5758028   1.142515    -0.50   0.614     -2.81534    1.663734
    2004  5  |  -2.337284   .8472502    -2.76   0.006    -3.998049   -.6765194
    2004  6  |  -4.448849    1.00154    -4.44   0.000    -6.412051   -2.485647
    2004  7  |    -2.4094   1.353989    -1.78   0.075    -5.063466    .2446657
    2004  8  |   -3.03093   1.149288    -2.64   0.008    -5.283745   -.7781152
    2004  9  |   .8278221   1.127645     0.73   0.463    -1.382569    3.038213
    2004 10  |   .1817205    1.14014     0.16   0.873    -2.053162    2.416603
    2004 11  |   2.792466   1.155785     2.42   0.016     .5269162    5.058015
    2004 12  |   2.430779   1.320076     1.84   0.066    -.1568119    5.018369
    2004 13  |    2.58767   1.318693     1.96   0.050     .0027904    5.172549
    2004 14  |  -3.257786   2.039144    -1.60   0.110    -7.254881    .7393081
    2005  2  |     3.2405   1.297026     2.50   0.012     .6980928    5.782908
    2005  3  |    1.71806    1.12994     1.52   0.128    -.4968281    3.932949
    2005  4  |   1.186547   1.146599     1.03   0.301    -1.060997     3.43409
    2005  5  |   1.293659   .7455858     1.74   0.083    -.1678248    2.755143
    2005  6  |  -2.049492   .9836437    -2.08   0.037    -3.977613   -.1213713
    2005  7  |   -.552694   1.285197    -0.43   0.667    -3.071914    1.966526
    2005  8  |  -2.257461   1.347577    -1.68   0.094    -4.898958    .3840363
    2005  9  |   2.305219   1.152514     2.00   0.046     .0460817    4.564356
    2005 10  |   2.426425     1.1469     2.12   0.034     .1782914    4.674558
    2005 11  |   3.261853   .9344757     3.49   0.000     1.430111    5.093596
    2005 12  |   4.585997   1.271198     3.61   0.000     2.094216    7.077777
    2005 13  |   4.940386   1.346943     3.67   0.000     2.300133     7.58064
    2005 14  |   1.687834     2.0504     0.82   0.410    -2.331325    5.706992
    2006  2  |   4.157459   1.427507     2.91   0.004     1.359284    6.955634
    2006  3  |  -.6838267   1.231685    -0.56   0.579    -3.098154    1.730501
    2006  4  |  -1.711211   1.251988    -1.37   0.172    -4.165336    .7429139
    2006  5  |  (omitted)
    2006  6  |  -4.715793   1.152461    -4.09   0.000    -6.974827   -2.456758
    2006  7  |  -.8391716   1.554957    -0.54   0.589    -3.887172    2.208828
    2006  8  |  -1.886062   1.406057    -1.34   0.180     -4.64219    .8700665
    2006  9  |  -1.430791   1.331716    -1.07   0.283    -4.041198    1.179616
    2006 10  |   .8371515   1.254002     0.67   0.504    -1.620921    3.295224
    2006 11  |  (omitted)
    2006 12  |    3.52139   1.505298     2.34   0.019     .5707303     6.47205
    2006 13  |   3.248299   1.476687     2.20   0.028     .3537223    6.142875
    2006 14  |  -2.260743   2.179563    -1.04   0.300    -6.533084    2.011597
             |
       _cons |   7.032924    1.98631     3.54   0.000     3.139395    10.92645
-------------+----------------------------------------------------------------
     sigma_u |  44.539752
     sigma_e |  10.191185
         rho |  .95025015   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. xtreg osrape_prop policy sizeclass setasideuaa ln_labour ffi_prop solvency intensity specialise i.y
> ear year#mscode, fe vce(cluster pid)
note: 2006.year omitted because of collinearity
note: 1999b.year#2.mscode omitted because of collinearity
note: 1999b.year#3.mscode omitted because of collinearity
note: 1999b.year#4.mscode omitted because of collinearity
note: 1999b.year#7.mscode omitted because of collinearity
note: 1999b.year#9.mscode omitted because of collinearity
note: 1999b.year#10.mscode omitted because of collinearity
note: 1999b.year#12.mscode omitted because of collinearity
note: 1999b.year#13.mscode omitted because of collinearity
note: 1999b.year#14.mscode omitted because of collinearity
note: 2000.year#6.mscode omitted because of collinearity
note: 2000.year#8.mscode omitted because of collinearity
note: 2006.year#5.mscode omitted because of collinearity
note: 2006.year#11.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     70722
Group variable: pid                             Number of groups   =     10863

R-sq:  within  = 0.0382                         Obs per group: min =         1
       between = 0.0234                                        avg =       6.5
       overall = 0.0048                                        max =         8

                                                F(105,10862)       =     15.27
corr(u_i, Xb)  = -0.2567                        Prob > F           =    0.0000

                                (Std. Err. adjusted for 10863 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
 osrape_prop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |  -.0177774   .0073739    -2.41   0.016    -.0322316   -.0033231
   sizeclass |  -.0020655   .0009815    -2.10   0.035    -.0039894   -.0001416
 setasideuaa |  -.0004271   .0000481    -8.88   0.000    -.0005213   -.0003328
   ln_labour |  -.0015976   .0014363    -1.11   0.266    -.0044131    .0012178
    ffi_prop |   .0000524   .0001941     0.27   0.787     -.000328    .0004328
    solvency |  -.0004173   .0019581    -0.21   0.831    -.0042556     .003421
   intensity |   .0003132   .0089276     0.04   0.972    -.0171865    .0178129
  specialise |   .0011516    .001145     1.01   0.315    -.0010929     .003396
             |
        year |
       2000  |  -.0346226   .0071332    -4.85   0.000    -.0486049   -.0206402
       2001  |  -.0399231   .0075162    -5.31   0.000    -.0546563   -.0251899
       2002  |  -.0431933    .006733    -6.42   0.000    -.0563912   -.0299955
       2003  |  -.0312678   .0070514    -4.43   0.000    -.0450898   -.0174459
       2004  |  -.0026895   .0040455    -0.66   0.506    -.0106194    .0052403
       2005  |  -.0128631   .0042967    -2.99   0.003    -.0212854   -.0044407
       2006  |  (omitted)
             |
 year#mscode |
    1999  2  |  (omitted)
    1999  3  |  (omitted)
    1999  4  |  (omitted)
    1999  5  |  -.0038321    .007714    -0.50   0.619     -.018953    .0112889
    1999  6  |  -.0304663    .007443    -4.09   0.000    -.0450559   -.0158768
    1999  7  |  (omitted)
    1999  8  |  -.0080376   .0150086    -0.54   0.592    -.0374572     .021382
    1999  9  |  (omitted)
    1999 10  |  (omitted)
    1999 11  |   .0017574   .0098431     0.18   0.858    -.0175369    .0210517
    1999 12  |  (omitted)
    1999 13  |  (omitted)
    1999 14  |  (omitted)
    2000  2  |   .0170372   .0073441     2.32   0.020     .0026414     .031433
    2000  3  |   .0307462    .007397     4.16   0.000     .0162467    .0452458
    2000  4  |   .0224531   .0076731     2.93   0.003     .0074124    .0374939
    2000  5  |    .016505   .0055222     2.99   0.003     .0056805    .0273296
    2000  6  |  (omitted)
    2000  7  |   .0161339   .0097395     1.66   0.098    -.0029573     .035225
    2000  8  |  (omitted)
    2000  9  |   .0345857   .0071325     4.85   0.000     .0206046    .0485667
    2000 10  |   .0153513   .0077497     1.98   0.048     .0001604    .0305422
    2000 11  |   .0396742   .0081782     4.85   0.000     .0236436    .0557049
    2000 12  |   .0315009   .0089907     3.50   0.000     .0138774    .0491243
    2000 13  |   .0175827   .0084848     2.07   0.038      .000951    .0342144
    2000 14  |   .0240057   .0084183     2.85   0.004     .0075044    .0405071
    2001  2  |   .0222157   .0077492     2.87   0.004     .0070259    .0374056
    2001  3  |   .0314059    .007814     4.02   0.000      .016089    .0467229
    2001  4  |   .0315503   .0079789     3.95   0.000     .0159102    .0471905
    2001  5  |   .0157546   .0052164     3.02   0.003     .0055295    .0259797
    2001  6  |   -.001021   .0081128    -0.13   0.900    -.0169237    .0148817
    2001  7  |   .0305732   .0106887     2.86   0.004     .0096215    .0515249
    2001  8  |   .0111882   .0111968     1.00   0.318    -.0107596    .0331361
    2001  9  |   .0375222   .0076602     4.90   0.000     .0225067    .0525376
    2001 10  |   .0238736   .0082792     2.88   0.004     .0076448    .0401024
    2001 11  |   .0431689   .0083128     5.19   0.000     .0268744    .0594634
    2001 12  |   .0359793   .0100246     3.59   0.000     .0163293    .0556293
    2001 13  |   .0207746   .0088082     2.36   0.018      .003509    .0380403
    2001 14  |   .0143347   .0100736     1.42   0.155    -.0054114    .0340808
    2002  2  |   .0370685   .0069918     5.30   0.000     .0233633    .0507737
    2002  3  |   .0363041   .0070816     5.13   0.000     .0224229    .0501852
    2002  4  |    .022089   .0073003     3.03   0.002      .007779     .036399
    2002  5  |   .0032483   .0044621     0.73   0.467    -.0054983     .011995
    2002  6  |   .0041728   .0077098     0.54   0.588    -.0109399    .0192855
    2002  7  |   .0024333   .0101254     0.24   0.810    -.0174143    .0222809
    2002  8  |   .0051862   .0100454     0.52   0.606    -.0145047    .0248771
    2002  9  |   .0408214   .0069054     5.91   0.000     .0272855    .0543572
    2002 10  |   .0282778   .0078613     3.60   0.000     .0128682    .0436875
    2002 11  |   .0398431   .0063858     6.24   0.000     .0273258    .0523605
    2002 12  |   .0366731   .0099701     3.68   0.000     .0171298    .0562164
    2002 13  |   .0399183   .0082145     4.86   0.000     .0238165    .0560202
    2002 14  |    .008218   .0093783     0.88   0.381    -.0101652    .0266013
    2003  2  |   .0250634   .0073078     3.43   0.001     .0107388    .0393881
    2003  3  |   .0187276   .0074622     2.51   0.012     .0041004    .0333549
    2003  4  |   .0080538   .0075917     1.06   0.289    -.0068272    .0229349
    2003  5  |  -.0009656   .0046871    -0.21   0.837    -.0101532     .008222
    2003  6  |  -.0053204   .0067624    -0.79   0.431    -.0185759    .0079352
    2003  7  |  -.0095437   .0101705    -0.94   0.348    -.0294798    .0103923
    2003  8  |  -.0040348    .010891    -0.37   0.711    -.0253831    .0173135
    2003  9  |   .0294599   .0072078     4.09   0.000     .0153312    .0435885
    2003 10  |   .0128218   .0084365     1.52   0.129    -.0037154    .0293589
    2003 11  |    .031754   .0070453     4.51   0.000      .017944    .0455641
    2003 12  |   .0361992   .0100953     3.59   0.000     .0164106    .0559879
    2003 13  |   .0216984   .0088671     2.45   0.014     .0043173    .0390795
    2003 14  |   .0197384   .0096035     2.06   0.040     .0009138    .0385629
    2004  2  |   .0162021   .0071804     2.26   0.024     .0021272    .0302771
    2004  3  |   .0062003   .0073332     0.85   0.398    -.0081741    .0205747
    2004  4  |  -.0015825   .0074256    -0.21   0.831    -.0161381    .0129731
    2004  5  |  -.0148058   .0043418    -3.41   0.001    -.0233164   -.0062951
    2004  6  |  -.0194857   .0079508    -2.45   0.014    -.0350708   -.0039006
    2004  7  |  -.0186531   .0104235    -1.79   0.074    -.0390851    .0017789
    2004  8  |   .0096382   .0115114     0.84   0.402    -.0129262    .0322026
    2004  9  |   .0193797   .0070677     2.74   0.006     .0055256    .0332337
    2004 10  |   .0006079   .0082838     0.07   0.942    -.0156299    .0168456
    2004 11  |   .0136367   .0061838     2.21   0.027     .0015155     .025758
    2004 12  |   .0323087   .0114848     2.81   0.005     .0097964    .0548209
    2004 13  |   .0272893   .0087089     3.13   0.002     .0102182    .0443604
    2004 14  |   .0041997   .0095885     0.44   0.661    -.0145955    .0229949
    2005  2  |   .0281812    .007573     3.72   0.000     .0133368    .0430257
    2005  3  |   .0164668   .0077009     2.14   0.033     .0013717    .0315619
    2005  4  |   .0035001   .0078222     0.45   0.655    -.0118328    .0188329
    2005  5  |   .0041171   .0045223     0.91   0.363    -.0047473    .0129816
    2005  6  |   .0015157   .0099788     0.15   0.879    -.0180445    .0210759
    2005  7  |  -.0092558   .0106072    -0.87   0.383    -.0300478    .0115362
    2005  8  |   .0063519   .0134488     0.47   0.637    -.0200102    .0327141
    2005  9  |   .0293894   .0074704     3.93   0.000     .0147461    .0440327
    2005 10  |   .0159029   .0087507     1.82   0.069    -.0012501    .0330559
    2005 11  |   .0164815   .0065904     2.50   0.012     .0035632    .0293999
    2005 12  |   .0437739   .0110233     3.97   0.000     .0221663    .0653815
    2005 13  |   .0405919   .0091985     4.41   0.000     .0225611    .0586227
    2005 14  |   .0232756   .0098158     2.37   0.018     .0040348    .0425163
    2006  2  |   .0330662    .007717     4.28   0.000     .0179395    .0481929
    2006  3  |   .0079204    .007772     1.02   0.308     -.007314    .0231549
    2006  4  |  -.0129761    .007895    -1.64   0.100    -.0284517    .0024996
    2006  5  |  (omitted)
    2006  6  |  -.0157485   .0076684    -2.05   0.040    -.0307798   -.0007171
    2006  7  |  -.0144614   .0108064    -1.34   0.181    -.0356439    .0067211
    2006  8  |   .0061888    .014389     0.43   0.667    -.0220162    .0343938
    2006  9  |   .0158225   .0075642     2.09   0.036     .0009953    .0306497
    2006 10  |   .0186675   .0089556     2.08   0.037     .0011129    .0362221
    2006 11  |  (omitted)
    2006 12  |   .0427469   .0110867     3.86   0.000     .0210151    .0644788
    2006 13  |   .0374393   .0096339     3.89   0.000     .0185551    .0563235
    2006 14  |   .0089341   .0102163     0.87   0.382    -.0110916    .0289599
             |
       _cons |   .1169013   .0120499     9.70   0.000     .0932814    .1405213
-------------+----------------------------------------------------------------
     sigma_u |  .09608612
     sigma_e |  .05439759
         rho |  .75728469   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. egen osr_mn = mean(oilseedrapeuaa)

. gen osr_prop = oilseedrape/osr_mn
oilseedrape ambiguous abbreviation
r(111);

. 
. gen osr_prop = oilseedrapeuaa/osr_mn

. xtreg osr_prop policy sizeclass setasideuaa ln_labour ffi_prop solvency intensity specialise i.year
>  year#mscode, fe vce(cluster pid)
note: 2006.year omitted because of collinearity
note: 1999b.year#2.mscode omitted because of collinearity
note: 1999b.year#3.mscode omitted because of collinearity
note: 1999b.year#4.mscode omitted because of collinearity
note: 1999b.year#7.mscode omitted because of collinearity
note: 1999b.year#9.mscode omitted because of collinearity
note: 1999b.year#10.mscode omitted because of collinearity
note: 1999b.year#12.mscode omitted because of collinearity
note: 1999b.year#13.mscode omitted because of collinearity
note: 1999b.year#14.mscode omitted because of collinearity
note: 2000.year#6.mscode omitted because of collinearity
note: 2000.year#8.mscode omitted because of collinearity
note: 2006.year#5.mscode omitted because of collinearity
note: 2006.year#11.mscode omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     70722
Group variable: pid                             Number of groups   =     10863

R-sq:  within  = 0.0657                         Obs per group: min =         1
       between = 0.1928                                        avg =       6.5
       overall = 0.1179                                        max =         8

                                                F(105,10862)       =     11.23
corr(u_i, Xb)  = -0.4653                        Prob > F           =    0.0000

                                (Std. Err. adjusted for 10863 clusters in pid)
------------------------------------------------------------------------------
             |               Robust
    osr_prop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      policy |   .0013319    .094472     0.01   0.989    -.1838504    .1865143
   sizeclass |   .0481494   .0076158     6.32   0.000     .0332209    .0630778
 setasideuaa |  -.0194337   .0053083    -3.66   0.000    -.0298389   -.0090284
   ln_labour |   .0353395   .0193905     1.82   0.068    -.0026693    .0733484
    ffi_prop |   .0402913    .021348     1.89   0.059    -.0015546    .0821372
    solvency |   .0347387   .0278501     1.25   0.212    -.0198526      .08933
   intensity |  -.0443083   .0823923    -0.54   0.591    -.2058122    .1171955
  specialise |   .0269219   .0235156     1.14   0.252    -.0191729    .0730168
             |
        year |
       2000  |  -.4152499   .0840645    -4.94   0.000    -.5800316   -.2504682
       2001  |   -.507625    .091227    -5.56   0.000    -.6864466   -.3288034
       2002  |  -.3622523   .0861164    -4.21   0.000    -.5310561   -.1934484
       2003  |  -.1925982   .0855103    -2.25   0.024    -.3602139   -.0249824
       2004  |  -.0563215   .0628447    -0.90   0.370    -.1795087    .0668656
       2005  |  -.1943831   .0558843    -3.48   0.001    -.3039265   -.0848398
       2006  |  (omitted)
             |
 year#mscode |
    1999  2  |  (omitted)
    1999  3  |  (omitted)
    1999  4  |  (omitted)
    1999  5  |   .0458091   .0979244     0.47   0.640    -.1461405    .2377587
    1999  6  |  -.3683411   .0844052    -4.36   0.000    -.5337908   -.2028914
    1999  7  |  (omitted)
    1999  8  |    -.22673   .1105564    -2.05   0.040    -.4434408   -.0100192
    1999  9  |  (omitted)
    1999 10  |  (omitted)
    1999 11  |   .2133691   .1245722     1.71   0.087    -.0308151    .4575533
    1999 12  |  (omitted)
    1999 13  |  (omitted)
    1999 14  |  (omitted)
    2000  2  |   .0407879   .0930042     0.44   0.661    -.1415172    .2230931
    2000  3  |   .4027353   .0843478     4.77   0.000     .2373982    .5680723
    2000  4  |   .3143602    .086222     3.65   0.000     .1453493    .4833711
    2000  5  |   .3063164   .0844294     3.63   0.000     .1408192    .4718135
    2000  6  |  (omitted)
    2000  7  |   .3390222   .0926101     3.66   0.000     .1574895    .5205549
    2000  8  |  (omitted)
    2000  9  |   .4098683   .0836538     4.90   0.000     .2458916     .573845
    2000 10  |   .3469097   .0847787     4.09   0.000      .180728    .5130914
    2000 11  |   .6831395   .1225167     5.58   0.000     .4429843    .9232947
    2000 12  |   .4037814   .0885229     4.56   0.000     .2302605    .5773024
    2000 13  |   .2865219   .0952081     3.01   0.003     .0998966    .4731472
    2000 14  |   .1934965   .1423165     1.36   0.174    -.0854698    .4724627
    2001  2  |   .1868919   .1038337     1.80   0.072    -.0166411    .3904248
    2001  3  |    .476935   .0916787     5.20   0.000     .2972281     .656642
    2001  4  |   .4700653   .0934169     5.03   0.000      .286951    .6531795
    2001  5  |   .3634995   .0720356     5.05   0.000     .2222966    .5047023
    2001  6  |   .0939059   .0649438     1.45   0.148    -.0333958    .2212076
    2001  7  |   .4156951   .1001436     4.15   0.000     .2193954    .6119948
    2001  8  |   .1359707   .0830502     1.64   0.102    -.0268229    .2987643
    2001  9  |   .4395679   .0919113     4.78   0.000     .2594051    .6197308
    2001 10  |   .4507338   .0914136     4.93   0.000     .2715465    .6299211
    2001 11  |   .7815542   .1120737     6.97   0.000     .5618693    1.001239
    2001 12  |   .4987718   .0966796     5.16   0.000     .3092621    .6882815
    2001 13  |   .3576617   .1005766     3.56   0.000     .1605132    .5548103
    2001 14  |   .1088628   .1627744     0.67   0.504    -.2102047    .4279303
    2002  2  |   .2201714   .1029449     2.14   0.032     .0183805    .4219622
    2002  3  |   .3364259   .0870635     3.86   0.000     .1657654    .5070863
    2002  4  |   .2624443    .088459     2.97   0.003     .0890485    .4358401
    2002  5  |   .0697121   .0622445     1.12   0.263    -.0522985    .1917227
    2002  6  |  -.0324258   .0707351    -0.46   0.647    -.1710795    .1062279
    2002  7  |   .1560703   .0985146     1.58   0.113    -.0370363    .3491768
    2002  8  |  -.0518397   .0851435    -0.61   0.543    -.2187365     .115057
    2002  9  |   .3472261   .0881074     3.94   0.000     .1745194    .5199327
    2002 10  |   .3329487   .0873351     3.81   0.000      .161756    .5041413
    2002 11  |   .5586171   .0878249     6.36   0.000     .3864643    .7307698
    2002 12  |   .3598468   .0956701     3.76   0.000      .172316    .5473777
    2002 13  |   .3816732   .0970099     3.93   0.000     .1915161    .5718303
    2002 14  |  -.2973187   .1573289    -1.89   0.059    -.6057121    .0110746
    2003  2  |   .1018082   .0998426     1.02   0.308    -.0939016     .297518
    2003  3  |   .1365869   .0868167     1.57   0.116    -.0335896    .3067633
    2003  4  |   .0833348   .0878858     0.95   0.343    -.0889374     .255607
    2003  5  |  -.0152993   .0633353    -0.24   0.809     -.139448    .1088494
    2003  6  |  -.1719999   .0743039    -2.31   0.021    -.3176491   -.0263507
    2003  7  |  -.1303759   .1201917    -1.08   0.278    -.3659736    .1052218
    2003  8  |  -.2029423   .0916838    -2.21   0.027    -.3826592   -.0232254
    2003  9  |   .1425584   .0915919     1.56   0.120    -.0369785    .3220952
    2003 10  |   .1561124   .0873536     1.79   0.074    -.0151166    .3273415
    2003 11  |   .4209531   .0892852     4.71   0.000     .2459379    .5959684
    2003 12  |   .2931415   .0969945     3.02   0.003     .1030145    .4832685
    2003 13  |    .155679   .0987158     1.58   0.115     -.037822    .3491799
    2003 14  |  -.0886597   .1551047    -0.57   0.568    -.3926931    .2153737
    2004  2  |  -.0081532   .1018521    -0.08   0.936    -.2078019    .1914954
    2004  3  |  -.0071561   .0871396    -0.08   0.935    -.1779656    .1636534
    2004  4  |  -.0445846   .0884652    -0.50   0.614    -.2179926    .1288234
    2004  5  |  -.1809766   .0656028    -2.76   0.006    -.3095701   -.0523831
    2004  6  |  -.3444757   .0775496    -4.44   0.000     -.496487   -.1924644
    2004  7  |  -.1865606   .1048398    -1.78   0.075    -.3920657    .0189445
    2004  8  |  -.2346858   .0889898    -2.64   0.008     -.409122   -.0602497
    2004  9  |   .0640985   .0873139     0.73   0.463    -.1070527    .2352497
    2004 10  |   .0140707   .0882814     0.16   0.873     -.158977    .1871183
    2004 11  |   .2162215   .0894928     2.42   0.016     .0407993    .3916437
    2004 12  |   .1882159   .1022139     1.84   0.066     -.012142    .3885738
    2004 13  |   .2003641   .1021068     1.96   0.050     .0002161    .4005121
    2004 14  |  -.2522514   .1578915    -1.60   0.110    -.5617476    .0572448
    2005  2  |   .2509129   .1004291     2.50   0.012     .0540535    .4477723
    2005  3  |   .1330299   .0874916     1.52   0.128    -.0384695    .3045294
    2005  4  |   .0918747   .0887815     1.03   0.301    -.0821533    .2659026
    2005  5  |   .1001684   .0577309     1.74   0.083    -.0129947    .2133316
    2005  6  |  -.1586928   .0761638    -2.08   0.037    -.3079878   -.0093978
    2005  7  |  -.0427953   .0995132    -0.43   0.667    -.2378592    .1522687
    2005  8  |  -.1747959   .1043433    -1.68   0.094    -.3793278     .029736
    2005  9  |   .1784938   .0892395     2.00   0.046     .0035681    .3534195
    2005 10  |   .1878788   .0888048     2.12   0.034     .0138052    .3619524
    2005 11  |   .2525663   .0723567     3.49   0.000     .1107339    .3943987
    2005 12  |   .3550951   .0984293     3.61   0.000     .1621558    .5480344
    2005 13  |   .3825356   .1042942     3.67   0.000        .1781    .5869712
    2005 14  |   .1306895   .1587631     0.82   0.410    -.1805152    .4418941
    2006  2  |   .3219133   .1105323     2.91   0.004     .1052498    .5385768
    2006  3  |  -.0529489   .0953697    -0.56   0.579     -.239891    .1339932
    2006  4  |  -.1324996   .0969418    -1.37   0.172    -.3225232    .0575241
    2006  5  |  (omitted)
    2006  6  |  -.3651453   .0892354    -4.09   0.000     -.540063   -.1902275
    2006  7  |  -.0649773   .1204008    -0.54   0.589    -.3009849    .1710303
    2006  8  |  -.1460383   .1088714    -1.34   0.180    -.3594461    .0673695
    2006  9  |  -.1107866   .1031152    -1.07   0.283    -.3129112     .091338
    2006 10  |   .0648209   .0970977     0.67   0.504    -.1255084    .2551502
    2006 11  |  (omitted)
    2006 12  |   .2726623   .1165557     2.34   0.019     .0441918    .5011328
    2006 13  |   .2515167   .1143403     2.20   0.028     .0273888    .4756447
    2006 14  |    -.17505   .1687642    -1.04   0.300    -.5058587    .1557586
             |
       _cons |   .5445614   .1538006     3.54   0.000     .2430843    .8460386
-------------+----------------------------------------------------------------
     sigma_u |  3.4487264
     sigma_e |  .78910656
         rho |  .95025015   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. set more off

. quietly xtreg osr_prop policy sizeclass setasideuaa ln_labour ffi_prop solvency intensity specialis
> e i.year year#mscode, fe vce(cluster pid)

. help estimates

. estimates table policy
estimation result policy not found
r(111);

. estimates table _b[policy}
invalid something: unmatched open parenthesis or bracket

r(198);

. estimates table _b[policy]
estimation result _b[policy] not found
r(111);

. help estimates table

. estimates store osr_prop

. estimates table osr_prop, b()

---------------------------
    Variable |  osr_prop   
-------------+-------------
      policy |  .00133195  
   sizeclass |  .04814938  
 setasideuaa | -.01943366  
   ln_labour |  .03533952  
    ffi_prop |  .04029134  
    solvency |   .0347387  
   intensity | -.04430835  
  specialise |  .02692194  
             |
        year |
       2000  |  -.4152499  
       2001  | -.50762501  
       2002  | -.36225226  
       2003  | -.19259816  
       2004  | -.05632153  
       2005  | -.19438313  
       2006  |  (omitted)  
             |
 year#mscode |
    1999  2  |  (omitted)  
    1999  3  |  (omitted)  
    1999  4  |  (omitted)  
    1999  5  |  .04580914  
    1999  6  | -.36834112  
    1999  7  |  (omitted)  
    1999  8  | -.22672999  
    1999  9  |  (omitted)  
    1999 10  |  (omitted)  
    1999 11  |  .21336913  
    1999 12  |  (omitted)  
    1999 13  |  (omitted)  
    1999 14  |  (omitted)  
             |
 year#mscode |
    2000  2  |  .04078795  
    2000  3  |  .40273526  
    2000  4  |  .31436018  
    2000  5  |  .30631635  
    2000  6  |  (omitted)  
    2000  7  |  .33902215  
    2000  8  |  (omitted)  
    2000  9  |  .40986829  
    2000 10  |  .34690971  
    2000 11  |  .68313949  
    2000 12  |  .40378142  
    2000 13  |  .28652193  
    2000 14  |  .19349648  
             |
 year#mscode |
    2001  2  |  .18689186  
    2001  3  |  .47693502  
    2001  4  |  .47006525  
    2001  5  |  .36349948  
    2001  6  |  .09390589  
    2001  7  |  .41569513  
    2001  8  |  .13597072  
    2001  9  |  .43956794  
    2001 10  |   .4507338  
    2001 11  |  .78155419  
    2001 12  |  .49877175  
    2001 13  |  .35766173  
    2001 14  |  .10886279  
             |
 year#mscode |
    2002  2  |  .22017138  
    2002  3  |  .33642587  
    2002  4  |  .26244432  
    2002  5  |  .06971213  
    2002  6  | -.03242577  
    2002  7  |  .15607029  
    2002  8  | -.05183974  
    2002  9  |  .34722607  
    2002 10  |  .33294867  
    2002 11  |  .55861708  
    2002 12  |  .35984684  
    2002 13  |   .3816732  
    2002 14  | -.29731874  
             |
 year#mscode |
    2003  2  |  .10180823  
    2003  3  |  .13658687  
    2003  4  |  .08333479  
    2003  5  | -.01529932  
    2003  6  | -.17199992  
    2003  7  | -.13037591  
    2003  8  |  -.2029423  
    2003  9  |  .14255835  
    2003 10  |  .15611242  
    2003 11  |  .42095315  
    2003 12  |  .29314152  
    2003 13  |  .15567897  
    2003 14  | -.08865971  
             |
 year#mscode |
    2004  2  | -.00815322  
    2004  3  | -.00715608  
    2004  4  | -.04458459  
    2004  5  | -.18097663  
    2004  6  | -.34447571  
    2004  7  | -.18656056  
    2004  8  | -.23468584  
    2004  9  |  .06409852  
    2004 10  |  .01407067  
    2004 11  |  .21622147  
    2004 12  |  .18821591  
    2004 13  |  .20036406  
    2004 14  | -.25225138  
             |
 year#mscode |
    2005  2  |  .25091292  
    2005  3  |  .13302994  
    2005  4  |  .09187466  
    2005  5  |  .10016843  
    2005  6  | -.15869281  
    2005  7  | -.04279526  
    2005  8  | -.17479587  
    2005  9  |  .17849379  
    2005 10  |   .1878788  
    2005 11  |  .25256629  
    2005 12  |  .35509511  
    2005 13  |   .3825356  
    2005 14  |  .13068947  
             |
 year#mscode |
    2006  2  |  .32191329  
    2006  3  |  -.0529489  
    2006  4  | -.13249957  
    2006  5  |  (omitted)  
    2006  6  | -.36514526  
    2006  7  | -.06497731  
    2006  8  | -.14603831  
    2006  9  |  -.1107866  
    2006 10  |   .0648209  
    2006 11  |  (omitted)  
    2006 12  |  .27266229  
    2006 13  |  .25151674  
    2006 14  | -.17505003  
             |
       _cons |  .54456142  
---------------------------

. estimates table osr_prop, b(!i.year)
invalid display format !i.year
r(120);

. estimates table osr_prop, b(policy)

--------------------------
    Variable | osr_prop   
-------------+------------
      policy | 0.00133195  
   sizeclass | 0.04814938  
 setasideuaa | 0-.01943366  
   ln_labour | 0.03533952  
    ffi_prop | 0.04029134  
    solvency | 0.0347387  
   intensity | 0-.04430835  
  specialise | 0.02692194  
             |
        year |
       2000  | 0-.4152499  
       2001  | 0-.50762501  
       2002  | 0-.36225226  
       2003  | 0-.19259816  
       2004  | 0-.05632153  
       2005  | 0-.19438313  
       2006  | (omitted)  
             |
 year#mscode |
    1999  2  | (omitted)  
    1999  3  | (omitted)  
    1999  4  | (omitted)  
    1999  5  | 0.04580914  
    1999  6  | 0-.36834112  
    1999  7  | (omitted)  
    1999  8  | 0-.22672999  
    1999  9  | (omitted)  
    1999 10  | (omitted)  
    1999 11  | 0.21336913  
    1999 12  | (omitted)  
    1999 13  | (omitted)  
    1999 14  | (omitted)  
             |
 year#mscode |
    2000  2  | 0.04078795  
    2000  3  | 0.40273526  
    2000  4  | 0.31436018  
    2000  5  | 0.30631635  
    2000  6  | (omitted)  
    2000  7  | 0.33902215  
    2000  8  | (omitted)  
    2000  9  | 0.40986829  
    2000 10  | 0.34690971  
    2000 11  | 0.68313949  
    2000 12  | 0.40378142  
    2000 13  | 0.28652193  
    2000 14  | 0.19349648  
             |
 year#mscode |
    2001  2  | 0.18689186  
    2001  3  | 0.47693502  
    2001  4  | 0.47006525  
    2001  5  | 0.36349948  
    2001  6  | 0.09390589  
    2001  7  | 0.41569513  
    2001  8  | 0.13597072  
    2001  9  | 0.43956794  
    2001 10  | 0.4507338  
    2001 11  | 0.78155419  
    2001 12  | 0.49877175  
    2001 13  | 0.35766173  
    2001 14  | 0.10886279  
             |
 year#mscode |
    2002  2  | 0.22017138  
    2002  3  | 0.33642587  
    2002  4  | 0.26244432  
    2002  5  | 0.06971213  
    2002  6  | 0-.03242577  
    2002  7  | 0.15607029  
    2002  8  | 0-.05183974  
    2002  9  | 0.34722607  
    2002 10  | 0.33294867  
    2002 11  | 0.55861708  
    2002 12  | 0.35984684  
    2002 13  | 0.3816732  
    2002 14  | 0-.29731874  
             |
 year#mscode |
    2003  2  | 0.10180823  
    2003  3  | 0.13658687  
    2003  4  | 0.08333479  
    2003  5  | 0-.01529932  
    2003  6  | 0-.17199992  
    2003  7  | 0-.13037591  
    2003  8  | 0-.2029423  
    2003  9  | 0.14255835  
    2003 10  | 0.15611242  
    2003 11  | 0.42095315  
    2003 12  | 0.29314152  
    2003 13  | 0.15567897  
    2003 14  | 0-.08865971  
             |
 year#mscode |
    2004  2  | 0-.00815322  
    2004  3  | 0-.00715608  
    2004  4  | 0-.04458459  
    2004  5  | 0-.18097663  
    2004  6  | 0-.34447571  
    2004  7  | 0-.18656056  
    2004  8  | 0-.23468584  
    2004  9  | 0.06409852  
    2004 10  | 0.01407067  
    2004 11  | 0.21622147  
    2004 12  | 0.18821591  
    2004 13  | 0.20036406  
    2004 14  | 0-.25225138  
             |
 year#mscode |
    2005  2  | 0.25091292  
    2005  3  | 0.13302994  
    2005  4  | 0.09187466  
    2005  5  | 0.10016843  
    2005  6  | 0-.15869281  
    2005  7  | 0-.04279526  
    2005  8  | 0-.17479587  
    2005  9  | 0.17849379  
    2005 10  | 0.1878788  
    2005 11  | 0.25256629  
    2005 12  | 0.35509511  
    2005 13  | 0.3825356  
    2005 14  | 0.13068947  
             |
 year#mscode |
    2006  2  | 0.32191329  
    2006  3  | 0-.0529489  
    2006  4  | 0-.13249957  
    2006  5  | (omitted)  
    2006  6  | 0-.36514526  
    2006  7  | 0-.06497731  
    2006  8  | 0-.14603831  
    2006  9  | 0-.1107866  
    2006 10  | 0.0648209  
    2006 11  | (omitted)  
    2006 12  | 0.27266229  
    2006 13  | 0.25151674  
    2006 14  | 0-.17505003  
             |
       _cons | 0.54456142  
--------------------------

. help estimates table

. estimates table osr_prop, keep(policy)

---------------------------
    Variable |  osr_prop   
-------------+-------------
      policy |  .00133195  
---------------------------

. estimates table osr_prop, keep(![i.year| year#mscode)
coefficient ![i.year| does not occur in any of the models
r(198);

. estimates table osr_prop, drop(1999:2006)
coefficient 1999:2006 does not occur in any of the models
r(198);

. estimates table osr_prop, drop(1999-2006)
coefficient 1999-2006 does not occur in any of the models
r(198);

. estimates table osr_prop, drop(19* 20*)
coefficient 19* does not occur in any of the models
r(198);

. help estimates table

. estimates table osr_prop, drop(1999)
coefficient 1999 does not occur in any of the models
r(198);

. estimates table osr_prop, drop(*year)
coefficient *year does not occur in any of the models
r(198);

. estimates table osr_prop, drop(year)
coefficient year does not occur in any of the models
r(198);

. estimates table osr_prop, drop(i.year)
coefficient i.year does not occur in any of the models
r(198);

. estimates table osr_prop, drop(2000)
coefficient 2000 does not occur in any of the models
r(198);

. estimates table osr_prop, drop(year2000)
coefficient year2000 does not occur in any of the models
r(198);

. estimates table osr_prop, keep(policy-_cons)
coefficient policy-_cons does not occur in any of the models
r(198);

. estimates table osr_prop, keep(policy - _cons)
coefficient - does not occur in any of the models
r(198);

. estimates table osr_prop, keep(policy _cons)

---------------------------
    Variable |  osr_prop   
-------------+-------------
      policy |  .00133195  
       _cons |  .54456142  
---------------------------

. estimates table osr_prop, keep(policy sizeclass setasideuaa ln_labour ffi_prop solvency intensity s
> pecialise _cons)

---------------------------
    Variable |  osr_prop   
-------------+-------------
      policy |  .00133195  
   sizeclass |  .04814938  
 setasideuaa | -.01943366  
   ln_labour |  .03533952  
    ffi_prop |  .04029134  
    solvency |   .0347387  
   intensity | -.04430835  
  specialise |  .02692194  
       _cons |  .54456142  
---------------------------

. estimates table osr_prop, keep(policy sizeclass setasideuaa ln_labour ffi_prop solvency intensity s
> pecialise _cons) stats(b, se, p)

---------------------------
    Variable |  osr_prop   
-------------+-------------
      policy |  .00133195  
   sizeclass |  .04814938  
 setasideuaa | -.01943366  
   ln_labour |  .03533952  
    ffi_prop |  .04029134  
    solvency |   .0347387  
   intensity | -.04430835  
  specialise |  .02692194  
       _cons |  .54456142  
-------------+-------------
           b |             
          se |             
           p |             
---------------------------

. help estimates table

. estimates table osr_prop, keep(policy sizeclass setasideuaa ln_labour ffi_prop solvency intensity s
> pecialise _cons) b se p stars
option stars not allowed
r(198);

. estimates table osr_prop, keep(policy sizeclass setasideuaa ln_labour ffi_prop solvency intensity s
> pecialise _cons) b se p

---------------------------
    Variable |  osr_prop   
-------------+-------------
      policy |  .00133195  
             |    .094472  
             |     0.9888  
   sizeclass |  .04814938  
             |  .00761585  
             |     0.0000  
 setasideuaa | -.01943366  
             |  .00530833  
             |     0.0003  
   ln_labour |  .03533952  
             |  .01939047  
             |     0.0684  
    ffi_prop |  .04029134  
             |  .02134796  
             |     0.0591  
    solvency |   .0347387  
             |  .02785012  
             |     0.2123  
   intensity | -.04430835  
             |  .08239225  
             |     0.5907  
  specialise |  .02692194  
             |   .0235156  
             |     0.2523  
       _cons |  .54456142  
             |  .15380055  
             |     0.0004  
---------------------------
             legend: b/se/p

. help estimates table

. estimates table osr_prop, keep(policy sizeclass setasideuaa ln_labour ffi_prop solvency intensity s
> pecialise _cons) b se p style(columns)

+---------------------------+
|     Variable |  osr_prop  |
|--------------+------------|
|       policy |  .00133195 |
|              |    .094472 |
|              |     0.9888 |
|    sizeclass |  .04814938 |
|              |  .00761585 |
|              |     0.0000 |
|  setasideuaa | -.01943366 |
|              |  .00530833 |
|              |     0.0003 |
|    ln_labour |  .03533952 |
|              |  .01939047 |
|              |     0.0684 |
|     ffi_prop |  .04029134 |
|              |  .02134796 |
|              |     0.0591 |
|     solvency |   .0347387 |
|              |  .02785012 |
|              |     0.2123 |
|    intensity | -.04430835 |
|              |  .08239225 |
|              |     0.5907 |
|   specialise |  .02692194 |
|              |   .0235156 |
|              |     0.2523 |
|        _cons |  .54456142 |
|              |  .15380055 |
|              |     0.0004 |
+---------------------------+
               legend: b/se/p

. do master_line
file master_line.do not found
r(601);

. do master_lin

. *************************************************************
. *                                                                                       
. * Patrick R. Gillespie                                  
. * Research Officer                                      
. * Teagasc, REDP                                         
. * Athenry, Co Galway, Ireland                           
. * patrick.gillespie@teagasc.ie                  
. *                                                                                       
. *************************************************************
. * RSF Project DAF RSF 07 505 (GO1390)           
. *                                                                                       
. * A micro level analysis of the Irish   
. * agri-food sector: lessons and                 
. * recommendations from Denmark and      
. * the Netherlands                               
. *                                                                               
. * Task 4
. *
. *************************************************************
. *       How this do file works
. *************************************************************
. * BE SURE TO READ THE FILE README.RTF!!!
. * The data to be used in this analysis is the 
. * FADN data for the years 2004 through 2007.Each 
. * country's data is contained in it's own data 
. * file. Rather than combine them all (would be 
. * a massive file), I'm importing variables as I 
. * need them. Once finished with a variable, I 
. * discard everything until I need it again.
. *
. * This master file calls do files from the 
. * subdirectory called sub_do. Any portion of the 
. * analysis can be omitted by inserting a * in 
. * front of the relevant do command. Output 
. * datasets will be generated by this file and 
. * stored in the subdirectory called output.
. *
. * In order for this do file to run, it must be
. * located in a folder (name is not important)
. * that is itself in the same folder that contains
. * CountryData and CountrySTATAFiles (those names 
. * are important, copy exactly). The datasets in 
. * those folders shouldn't contain any spaces and 
. * should match the list in the global macro "ms" 
. * defined below.
. * 
. * You can easily include or exclude countries
. * to the analysis by altering this macro 
. * (provided the datasets are in the right shape 
. * and are saved as a .dta in CountrySTATAFiles).
. *
. * At the time of writing, the directory 
. * structure in which this file resided was
. * 
. * Task 4
. *  >Data_Analysis
. *   >>CountryData
. *   >>CountrySTATAFiles
. *   >>descriptives
. *    >>>logs
. *    >>>output
. *    >>>sub_do
. *    >>>varname.xls
. *    >>>descriptives.do  <- your viewing this now
. *    >>>README.rtf
. *    >>>blank.dta
. *    >>>energygph.dta
. *************************************************************
. 
. *************************************************************
. *** PRELIMINARIES       *
. *************************
. clear

. clear matrix

. set mem 1500m

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory         1500M    max. data space              1,500.000M
    set matsize         800     max. RHS vars in models          4.950M
                                                            -----------
                                                             1,506.859M

. set matsize 800

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory         1500M    max. data space              1,500.000M
    set matsize         800     max. RHS vars in models          4.950M
                                                            -----------
                                                             1,506.859M

. capture log close
