-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/patrickgillespie/Documents/lin_forpatrick/Task 4/Data_Analysis/analysis/logs/resul
> ts/7_Jun_2012_20_09_24.log
  log type:  text
 opened on:   7 Jun 2012, 20:09:24

. 
. 
. ***************************
. * Full panel (w/ and w/o rape, adopter and non-adopter)
. ***************************
. quietly xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity speci
> alise i.year year#mscode, fe vce(robust)

. estimates store fulluaa

. 
. quietly xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity speciali
> se i.year year#mscode, fe vce(robust)

. estimates store fullprop

. 
. ****************************
. * Panel restriction 1 (w/ rape only, adopter and non-adopter)
. ****************************
. quietly xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity speci
> alise i.year year#mscode if oilseedrapeuaa>0, fe vce(robust)

. estimates store res1uaa

. 
. quietly xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity speciali
> se i.year year#mscode if oilseedrapeuaa>0, fe vce(robust)

. estimates store res1prop

. 
. *****************************
. * Panel restriction 2 (w/ and w/o rape, adopters only)
. *****************************
. quietly xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity speci
> alise i.year year#mscode if adopt==1, fe vce(robust)

. estimates store res2uaa

. 
. quietly xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity speciali
> se i.year year#mscode if adopt==1, fe vce(robust)

. estimates store res2prop

. *****************************
. 
. outreg2 policy [*] using "model", word stat(coef se) replace seeout 
Hit Enter to continue. 
model.rtf
dir : seeout

. 
. !!!STOP!!!

. 
. 
. 
. xtreg osrape_prop policy pol_osrprop adopt sizeclass setasideuaa ln_labour ln_ffi solvency intensit
> y i.year year#mscode, vce(robust)
variable pol_osrprop not found
r(111);

end of do-file
r(111);

end of do-file

r(111);

. estimates drop *

. quietly xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity speci
> alise i.year year#mscode if adopt==1, fe vce(robust)

. 
. estimates store resuaa

. 
. 
. quietly xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity speciali
> se i.year year#mscode if adopt==1, fe vce(robust)

. estimates store resprop

. quietly xtreg oilseedrapeuaa policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity speci
> alise i.year year#mscode, fe vce(robust)

. estimates store fulluaa

. 
. 
. 
. quietly xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity speciali
> se i.year year#mscode, fe vce(robust)

. 
. estimates store fullprop

. outreg2 policy [*] using "output/docs/model", word stat(coef se) replace
output/docs/model.rtf
dir : seeout

. seeout using "output/docs/model.txt"
Hit Enter to continue. 

. 
. ********************************************************

. 
. *** CHOW TESTS

. ********************************************************

. 
. 
. 
. * Break across time

. 
. quietly xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity speciali
> se i.year year#mscode pol_sizeclass pol_setasideuaa pol_ln_labour pol_ln_ffi pol_solvency pol_inten
> sity pol_specialise i.year #mscode, vce(robust)
# invalid name
r(198);

. 
. 
. test _b[pol_sizeclass]=0, notest
[pol_sizeclass] not found
r(111);

. 
. test _b[pol_setasideuaa]=0, notest
[pol_setasideuaa] not found
r(111);

. 
. test _b[pol_ln_labour]=0, notest
[pol_ln_labour] not found
r(111);

. 
. test _b[pol_ln_ffi]=0, notest
[pol_ln_ffi] not found
r(111);

. 
. test _b[pol_solvency]=0, notest
[pol_solvency] not found
r(111);

. 
. test _b[pol_intensity]=0, notest
[pol_intensity] not found
r(111);

. 
. test _b[pol_specialise]=0, notest
[pol_specialise] not found
r(111);

. 
. test _b[policy]=0, accum

 ( 1)  policy = 0

       F(  1, 10430) =    0.77
            Prob > F =    0.3802

. 
. 
. outreg2 policy pol_adop adopt using "output/docs/Chow_time", addstat(Chi-squared statistic, r(chi2)
> , Prob > chi2, r(p)) word nocons
invalid syntax
r(198);

. 
. 
. * Break across adoption status

. 
. quietly xtreg osrape_prop policy adopt sizeclass setasideuaa ln_labour ln_ffi solvency intensity sp
> ecialise i.year year#mscode pol_adop, vce(robust)

. 
. 
. test _b[pol_adop]=0, notest

 ( 1)  pol_adop = 0

. 
. test _b[adopt]=0, accum

 ( 1)  pol_adop = 0
 ( 2)  adopt = 0

           chi2(  2) =   80.64
         Prob > chi2 =    0.0000

. 
. 
. outreg2 policy pol_adop adopt using "output/docs/Chow_adopt", addstat(Chi-squared statistic, r(chi2
> ), Prob > chi2, r(p)) word nocons
output/docs/Chow_adopt.rtf
dir : seeout

. 
. ********************************************************

. 
. seeout using "output/docs/Chow_adopt.txt"
Hit Enter to continue. quietly xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solven
> cy intensity specialise i.year year#mscode pol_sizeclass pol_setasideuaa pol_ln_labour pol_ln_ffi p
> ol_solvency pol_intensity pol_specialise i.year #mscode, vce(robust)

. 
. 
. test _b[pol_sizeclass]=0, notest
[pol_sizeclass] not found
r(111);

. 
. test _b[pol_setasideuaa]=0, notest
[pol_setasideuaa] not found
r(111);

. 
. test _b[pol_ln_labour]=0, notest
[pol_ln_labour] not found
r(111);

. 
. test _b[pol_ln_ffi]=0, notest
[pol_ln_ffi] not found
r(111);

. 
. test _b[pol_solvency]=0, notest
[pol_solvency] not found
r(111);

. 
. test _b[pol_intensity]=0, notest
[pol_intensity] not found
r(111);

. 
. test _b[pol_specialise]=0, notest
[pol_specialise] not found
r(111);

. 
. test _b[policy]=0, accum

 ( 1)  pol_adop = 0
 ( 2)  adopt = 0
 ( 3)  policy = 0

           chi2(  3) =   80.73
         Prob > chi2 =    0.0000

. 
. 
. outreg2 policy using "output/docs/Chow_time", addstat(Chi-squared statistic, r(chi2), Prob > chi2, 
> r(p)) word nocons
output/docs/Chow_time.rtf
dir : seeout

. seeout using "output/docs/Chow_time.txt"
Hit Enter to continue. 

.  quietly xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity special
> ise i.year year#mscode pol_sizeclass pol_setasideuaa pol_ln_labour pol_ln_ffi pol_solvency pol_inte
> nsity pol_specialise i.year #mscode, vce(robust)
# invalid name
r(198);

. 
. 
. quietly xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity speciali
> se i.year year#mscode pol_sizeclass pol_setasideuaa pol_ln_labour pol_ln_ffi pol_solvency pol_inten
> sity pol_specialise i.year #mscode, vce(robust)
# invalid name
r(198);

. quietly xtreg osrape_prop policy sizeclass setasideuaa ln_labour ln_ffi solvency intensity speciali
> se i.year year#mscode pol_sizeclass pol_setasideuaa pol_ln_labour pol_ln_ffi pol_solvency pol_inten
> sity pol_specialise, vce(robust)

. test _b[pol_sizeclass]=0, notest

 ( 1)  pol_sizeclass = 0

. 
. test _b[pol_setasideuaa]=0, notest

 ( 1)  pol_setasideuaa = 0

. 
. test _b[pol_ln_labour]=0, notest

 ( 1)  pol_ln_labour = 0

. 
. test _b[pol_ln_ffi]=0, notest

 ( 1)  pol_ln_ffi = 0

. 
. test _b[pol_solvency]=0, notest

 ( 1)  pol_solvency = 0

. 
. test _b[pol_intensity]=0, notest

 ( 1)  pol_intensity = 0

. 
. test _b[pol_specialise]=0, notest

 ( 1)  pol_specialise = 0

. 
. test _b[policy]=0, accum

 ( 1)  pol_specialise = 0
 ( 2)  policy = 0

           chi2(  2) =    1.17
         Prob > chi2 =    0.5584

. 
. 
. outreg2 policy pol_sizeclass pol_setasideuaa pol_ln_labour pol_ln_ffi pol_solvency pol_intensity po
> l_specialise using "output/docs/Chow_time", addstat(Chi-squared statistic, r(chi2), Prob > chi2, r(
> p)) word nocons
output/docs/Chow_time.rtf
dir : seeout

. 
. seeout using "output/docs/Chow_time.txt"
Hit Enter to continue. outreg2 policy sizeclass pol_sizeclass setasideuaa pol_setasideuaa ln_labour p
> ol_ln_labour ln_ffi pol_ln_ffi solvency pol_solvency intensity pol_intensity specialise pol_special
> ise using "output/docs/Chow_time", addstat(Chi-squared statistic, r(chi2), Prob > chi2, r(p)) word 
> nocons

. outreg2 policy sizeclass pol_sizeclass setasideuaa pol_setasideuaa ln_labour pol_ln_labour ln_ffi p
> ol_ln_ffi solvency pol_solvency intensity pol_intensity specialise pol_specialise using "output/doc
> s/Chow_time", addstat(Chi-squared statistic, r(chi2), Prob > chi2, r(p)) word nocons
invalid syntax
r(198);

. do master_lin

. ********************************************************
. ********************************************************
. * Patrick R. Gillespie                          
. * Research Officer                              
. * Teagasc, REDP                                 
. * Athenry, Co Galway, Ireland                   
. * patrick.gillespie@teagasc.ie  
. *                                                                                       
. ********************************************************
. * RSF Project DAF RSF 07 505 (GO1390)           
. *                                                                                       
. * A micro level analysis of the Irish   
. * agri-food sector: lessons and                 
. * recommendations from Denmark and      
. * the Netherlands                               
. *                                                                               
. * Task 4
. *
. ********************************************************
. 
. 
. 
. ********************************************************
. *** PRELIMINARIES       
. ********************************************************
. * BE SURE TO READ THE FILE README.RTF!!!
. clear

. clear matrix

. set mem 1500m

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory         1500M    max. data space              1,500.000M
    set matsize         800     max. RHS vars in models          4.950M
                                                            -----------
                                                             1,506.859M

. set matsize 800

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory         1500M    max. data space              1,500.000M
    set matsize         800     max. RHS vars in models          4.950M
                                                            -----------
                                                             1,506.859M

. capture log close
