-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/patrickgillespie/Documents/lin_forpatrick/Task 4/Data_Analysis/analysis/logs/resul
> ts/8_May_2012_13_26_59.log
  log type:  text
 opened on:   8 May 2012, 13:26:59

. 
. xtreg osrape_prop energydum sizeclass setasideuaa ln_labour specialise i.year, fe
note: 2007.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     78186
Group variable: pid                             Number of groups   =     10863

R-sq:  within  = 0.0148                         Obs per group: min =         2
       between = 0.0415                                        avg =       7.2
       overall = 0.0143                                        max =         9

                                                F(12,67311)        =     84.05
corr(u_i, Xb)  = -0.2614                        Prob > F           =    0.0000

------------------------------------------------------------------------------
 osrape_prop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   energydum |  -.0110057   .0009866   -11.15   0.000    -.0129395   -.0090719
   sizeclass |  -.0023709   .0004965    -4.78   0.000     -.003344   -.0013978
 setasideuaa |  -.0003962   .0000266   -14.89   0.000    -.0004483    -.000344
   ln_labour |  -.0017242   .0009779    -1.76   0.078    -.0036408    .0001925
  specialise |   .0016606    .000814     2.04   0.041      .000065    .0032561
             |
        year |
       2000  |  -.0135221   .0009533   -14.18   0.000    -.0153906   -.0116536
       2001  |  -.0148597   .0009284   -16.01   0.000    -.0166794     -.01304
       2002  |  -.0202793   .0009206   -22.03   0.000    -.0220837   -.0184748
       2003  |  -.0180806   .0009289   -19.46   0.000    -.0199012     -.01626
       2004  |  -.0064514   .0008903    -7.25   0.000    -.0081963   -.0047064
       2005  |   -.004854   .0008861    -5.48   0.000    -.0065908   -.0031173
       2006  |   .0025352   .0009068     2.80   0.005     .0007579    .0043124
       2007  |  (omitted)
             |
       _cons |   .1189199   .0080661    14.74   0.000     .1031103    .1347296
-------------+----------------------------------------------------------------
     sigma_u |  .09466687
     sigma_e |  .05650491
         rho |  .73731761   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(10862, 67311) =    17.64        Prob > F = 0.0000

. 
. xtreg oilseedrapeuaa energydum sizeclass setasideuaa ln_labour specialise i.year, fe
note: 2007.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     78186
Group variable: pid                             Number of groups   =     10863

R-sq:  within  = 0.0362                         Obs per group: min =         2
       between = 0.2418                                        avg =       7.2
       overall = 0.1587                                        max =         9

                                                F(12,67311)        =    210.83
corr(u_i, Xb)  = -0.5013                        Prob > F           =    0.0000

------------------------------------------------------------------------------
oilseedrap~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   energydum |  -.7955293   .1915394    -4.15   0.000    -1.170946   -.4201122
   sizeclass |   .5880818   .0963844     6.10   0.000     .3991684    .7769952
 setasideuaa |   -.222829   .0051643   -43.15   0.000     -.232951   -.2127069
   ln_labour |   .5837424   .1898371     3.07   0.002     .2116617     .955823
  specialise |   .4291273   .1580308     2.72   0.007     .1193872    .7388675
             |
        year |
       2000  |  -1.980517   .1850662   -10.70   0.000    -2.343247   -1.617787
       2001  |  -1.950668   .1802338   -10.82   0.000    -2.303926    -1.59741
       2002  |  -2.193959   .1787211   -12.28   0.000    -2.544252   -1.843666
       2003  |  -1.610224   .1803254    -8.93   0.000    -1.963661   -1.256786
       2004  |  -.5826545   .1728331    -3.37   0.001    -.9214073   -.2439017
       2005  |   .2093896    .172018     1.22   0.224    -.1277656    .5465447
       2006  |   1.448861   .1760334     8.23   0.000     1.103836    1.793886
       2007  |  (omitted)
             |
       _cons |   6.681211   1.565891     4.27   0.000     3.612066    9.750357
-------------+----------------------------------------------------------------
     sigma_u |  43.949628
     sigma_e |  10.969368
         rho |  .94135815   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(10862, 67311) =    56.27        Prob > F = 0.0000

. 
. *xtreg osrape_prop energydum sizeclass setasideuaa ln_labour ln_ffi solvency specialise intensity l
> n_c_ret_ha i.year year#mscode, fe
. 
. *xtreg oilseedrapeuaa energydum sizeclass setasideuaa ln_labour ln_ffi solvency specialise intensit
> y ln_c_ret_ha i.year year#mscode, fe
. 
. 
. *************************************************************
. *** POST-ESTIMATION TESTS *
. ***************************
. ****************
. *** Chow test
. ****************
. *xtreg osrape_prop energydum edum_adop adopter farmsrepresented  sizeclass setasideuaa ln_labour ln
> _ffi solvency specialise intensity ln_c_ret_ha i.year year#mscode
. xtreg osrape_prop energydum edum_adop adopter sizeclass setasideuaa ln_labour specialise i.year, fe
note: adopter omitted because of collinearity
note: 2007.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     78186
Group variable: pid                             Number of groups   =     10863

R-sq:  within  = 0.0188                         Obs per group: min =         2
       between = 0.0088                                        avg =       7.2
       overall = 0.0005                                        max =         9

                                                F(13,67310)        =     99.11
corr(u_i, Xb)  = -0.1564                        Prob > F           =    0.0000

------------------------------------------------------------------------------
 osrape_prop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   energydum |  -.0142956   .0010044   -14.23   0.000    -.0162641    -.012327
   edum_adop |   .0180208   .0010851    16.61   0.000      .015894    .0201475
     adopter |  (omitted)
   sizeclass |  -.0024399   .0004955    -4.92   0.000     -.003411   -.0014687
 setasideuaa |  -.0003905   .0000266   -14.71   0.000    -.0004425   -.0003384
   ln_labour |  -.0010606   .0009767    -1.09   0.278    -.0029749    .0008538
  specialise |   .0015457   .0008124     1.90   0.057    -.0000467     .003138
             |
        year |
       2000  |  -.0134895   .0009514   -14.18   0.000    -.0153542   -.0116248
       2001  |  -.0148841   .0009265   -16.06   0.000    -.0167001   -.0130681
       2002  |  -.0202262   .0009188   -22.01   0.000    -.0220269   -.0184254
       2003  |  -.0179709    .000927   -19.39   0.000    -.0197879    -.016154
       2004  |  -.0061656   .0008886    -6.94   0.000    -.0079073   -.0044238
       2005  |  -.0045352   .0008845    -5.13   0.000    -.0062688   -.0028016
       2006  |    .002669    .000905     2.95   0.003     .0008952    .0044427
       2007  |  (omitted)
             |
       _cons |   .1140675    .008055    14.16   0.000     .0982797    .1298554
-------------+----------------------------------------------------------------
     sigma_u |  .09340862
     sigma_e |  .05638991
         rho |  .73290011   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(10862, 67310) =    16.10        Prob > F = 0.0000

. 
. test _b[edum_adop]=0, notest

 ( 1)  edum_adop = 0

. test _b[adopter]=0, accum

 ( 1)  edum_adop = 0
 ( 2)  o.adopter = 0
       Constraint 2 dropped

       F(  1, 67310) =  275.82
            Prob > F =    0.0000

. 
. *xtreg oilseedrapeuaa energydum edum_adop adopter farmsrepresented  sizeclass setasideuaa ln_labour
>  ln_ffi solvency specialise intensity ln_c_ret_ha i.year year#mscode
. xtreg oilseedrapeuaa energydum edum_adop adopter sizeclass setasideuaa ln_labour specialise i.year
note: 2007.year omitted because of collinearity

Random-effects GLS regression                   Number of obs      =     78186
Group variable: pid                             Number of groups   =     10863

R-sq:  within  = 0.0211                         Obs per group: min =         2
       between = 0.1401                                        avg =       7.2
       overall = 0.1286                                        max =         9

                                                Wald chi2(14)      =   3673.69
corr(u_i, X)   = 0 (assumed)                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
oilseedrap~a |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   energydum |  -.5033479    .204774    -2.46   0.014    -.9046975   -.1019983
   edum_adop |   4.432333    .221736    19.99   0.000     3.997738    4.866927
     adopter |   24.08058   .8385515    28.72   0.000     22.43705    25.72411
   sizeclass |   1.280842   .0937405    13.66   0.000     1.097114     1.46457
 setasideuaa |  -.0765752   .0051141   -14.97   0.000    -.0865986   -.0665518
   ln_labour |   5.345739    .184934    28.91   0.000     4.983275    5.708203
  specialise |   .4893419   .1640031     2.98   0.003     .1679017    .8107821
             |
        year |
       2000  |  -1.876902   .1944686    -9.65   0.000    -2.258053    -1.49575
       2001  |  -1.952612   .1893401   -10.31   0.000    -2.323712   -1.581512
       2002  |  -1.788169    .187555    -9.53   0.000     -2.15577   -1.420568
       2003  |   -1.25765    .189243    -6.65   0.000    -1.628559   -.8867407
       2004  |  -1.081867   .1814685    -5.96   0.000    -1.437539   -.7261954
       2005  |  -.1995064   .1806471    -1.10   0.269    -.5535681    .1545554
       2006  |   1.135956   .1849173     6.14   0.000     .7735244    1.498387
       2007  |  (omitted)
             |
       _cons |  -42.00813   1.516001   -27.71   0.000    -44.97943   -39.03682
-------------+----------------------------------------------------------------
     sigma_u |   29.85452
     sigma_e |  10.938822
         rho |  .88163826   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. test _b[edum_adop]=0, notest

 ( 1)  edum_adop = 0

. test _b[adopter]=0, accum

 ( 1)  edum_adop = 0
 ( 2)  adopter = 0

           chi2(  2) = 1395.14
         Prob > chi2 =    0.0000

. 
. 
. *************************************************************
. *** CLEAN UP              *
. ***************************
. tsset, clear

. clear

. clear matrix

. log close
      name:  <unnamed>
       log:  /home/patrickgillespie/Documents/lin_forpatrick/Task 4/Data_Analysis/analysis/logs/resul
> ts/8_May_2012_13_26_59.log
  log type:  text
 closed on:   8 May 2012, 13:28:44
-----------------------------------------------------------------------------------------------------
